
Процедура УсловиеПечатиПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СогласованиеМенеджеромПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ТекЗадача из ФормируемыеЗадачи Цикл
		ТекЗадача.Исполнитель =  Справочники.Пользователи.НайтиПоНаименованию("Николай Киселев");
		ТекЗадача.Счет   =Счет;
		//ТекЗадача.Реализация = Реализация;
		//ТекЗадача.ВидЗадачи = Перечисления.амбВидыЗадач.Согласование;
		//ТекЗадача.КоличествоКопийПечати = КоличествоКопийПечати;
		ТекЗадача.Расписка = Резерв; 
		ТекЗадача.Информация = "Заявка на отправку товара из резерва в сервисную службу."
	КонецЦикла;                                 
КонецПроцедуры

Процедура СогласованиеМенеджеромПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура Действие1ПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
 
КонецПроцедуры

Процедура Действие1ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для каждого ТекЗадача из ФормируемыеЗадачи Цикл
		
		ТекЗадача.Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Николай Киселев");
		ТекЗадача.Счет   =Счет;
		//ТекЗадача.Реализация = Реализация;
		//ТекЗадача.ВидЗадачи = Перечисления.амбВидыЗадач.Распечатка;
		//ТекЗадача.КоличествоКопийПечати = КоличествоКопийПечати;
		ТекЗадача.Расписка = Резерв;

	КонецЦикла;
КонецПроцедуры


Процедура СогласованиеМенеджеромПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	//Сообщить("Задача отправлена на склад!!!");
	//КоличествоКопийПечати = Задача.КоличествоКопийПечати;
	//резерв = Задача.Расписка;
	Если не отказ тогда
		
		Обр = Обработки.ПереместитьТоварСоСкладаНаСклад.Создать();
		Обр.Организация = Задача.Счет.Организация;
		Обр.СкладОтправки = Задача.Счет.СкладГруппа;
		ФормаОбработки = Обр.ПолучитьФорму();
		ФормаОбработки.Резерв = Задача.Расписка;
		ФормаОбработки.Открыть();
		
		
		
	КонецЕсли;	
		
КонецПроцедуры



	

