
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		ДатаНачалаПлан = ДанныеЗаполнения.ДатаНачалаПлан;
		ДатаОкончанияПлан = ДанныеЗаполнения.ДатаОкончанияПлан;
		Клиент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		ПодразделениеИсточник = ДанныеЗаполнения.ПодразделениеИсточник;
		ЗаявкаОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаОборудование Из ДанныеЗаполнения.Оборудование Цикл
			НоваяСтрока = Оборудование.Добавить();
			НоваяСтрока.Оборудование = ТекСтрокаОборудование.Оборудование;
			НоваяСтрока.Цель = ТекСтрокаОборудование.Цель;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
