
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		// регистр амбСрокиИСерии Приход
		Движение 				= Движения.амбСрокиИСерии.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаНоменклатура.Номенклатура;
		Движение.СерияНоменклатуры = ТекСтрокаНоменклатура.СерияНоменклатуры;
		Движение.СрокГодности 	= ТекСтрокаНоменклатура.СрокГодности;
		Движение.Количество 	= ТекСтрокаНоменклатура.Количество;
		СкладДляРегистра = ?(Склад.амбИспользоватьОбособленныйУчетСроковГодности, Склад, Справочники.Склады.ПустаяСсылка());
		Движение.Склад			= СкладДляРегистра;
	КонецЦикла;

	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если не ЗначениеЗаполнено( Ответственный) тогда
	Ответственный = ПараметрыСеанса.ТекущийПользователь.Ссылка;
	КонецЕсли;

КонецПроцедуры
