
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоБазовая = ОбновлениеКонфигурации.ЭтоБазоваяВерсияКонфигурации();
	
	Если НЕ ЭтоБазовая Тогда
		HTMLДокумент = Обработки.ПомощникПереходаНаУТ11.ПолучитьМакет("ОписаниеУТ");
	Иначе
		Если Параметры.Свойство("ОбновлениеПлатформы") и Параметры.ОбновлениеПлатформы Тогда
			HTMLДокумент = Обработки.ПомощникПереходаНаУТ11.ПолучитьМакет("ОписаниеОбновленияПлатформы");
		Иначе
			HTMLДокумент = Обработки.ПомощникПереходаНаУТ11.ПолучитьМакет("ОписаниеУТБазовая");
		КонецЕсли;
	КонецЕсли; 
	
	ВебСодержимое = HTMLДокумент.ПолучитьТекст();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВебСодержимоеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		ЗапуститьПриложение("explorer " + ДанныеСобытия.Href);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


