// Обработчик события элемента ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если Не ЭтоГруппа Тогда
		ЕдиницаХраненияОстатков = Неопределено;
	КонецЕсли; 

КонецПроцедуры

// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка
	   И НЕ ЭтоГруппа
	   И Не ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
	    #Если Клиент Тогда
		РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "базовая единица");
		#КонецЕсли
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

