
Процедура ДобавитьСтроку(Номенклатура, Количество) Экспорт
	
	
	СтрокаТЧ = Товары.Добавить();	
	СтрокаТЧ.Номенклатура = Номенклатура.Ссылка;
	СтрокаТЧ.Количество = Количество;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(ТоварыВРезерве.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0) КАК Резерв,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезерве.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыКПередачеСоСкладовОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток,
	|	ТоварыНаСкладахОстатки.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕДИЗМ
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				&Дата,
	|				амбРасписка = ИСТИНА
	|					И Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				&Дата,
	|				амбРасписка = ЛОЖЬ
	|					И Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ТоварыВРезерве
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезерве.Номенклатура,
	|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК ТоварыКПередачеСоСкладовОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура.Наименование";

	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Результат 				= Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() тогда
		СтрокаТЧ.Резерв  = Выборка.Резерв;
		СтрокаТЧ.Остаток = Выборка.СвободныйОстаток;
	КонецЕсли;	
	    СтрокаТЧ.ЕдИзм = Номенклатура.ЕдиницаХраненияОстатков;
    //Получим цену номенклатуры
	ТипЦеныРозница = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Розничные");
	Цена = Ценообразование.ПолучитьЦенуНоменклатуры(Номенклатура, , ТипЦеныРозница, ТекущаяДата(), , Константы.ВалютаРегламентированногоУчета.Получить(), 1 , , , );
	СтрокаТЧ.розница = Цена;
	 //Узнаем последнюю цену закупки этой позиции
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК Дата,
	               |	ПоступлениеТоваровУслугТовары.Цена,
	               |	ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента КАК Валюта
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |ГДЕ
	              |	 ПоступлениеТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	СтрокаТЧ.ПоследняяЗакупка = Выборка.Цена;                           	
	СтрокаТЧ.ВалютаПослЗак    = Выборка.Валюта;
	КонецЕсли;
	 
	СтрокаТЧ.Количество = 1;
	СтрокаТЧ.СуммаРозница = Цена;
    //Найдем предпологаемый срокгодности:
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	амбСрокиИСерииОстатки.Номенклатура,
	               |	амбСрокиИСерииОстатки.СрокГодности КАК СрокГодности
	               |ИЗ
	               |	РегистрНакопления.амбСрокиИСерии.Остатки(
	               |			,
	               |			Номенклатура = &Номенклатура
	               |				И Склад = &Склад) КАК амбСрокиИСерииОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СрокГодности";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Справочники.Склады.ПустаяСсылка());	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда	
	СтрокаТЧ.ПредварительныйСрокГодности = Выборка.СрокГодности;	
	
	КонецЕсли;

	


КонецПроцедуры

