
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.НомерКонтейнера > 0 Тогда
		УчетнаяЗапись = "PIN" + Параметры.НомерКонтейнера;
		Элементы.УчетнаяЗапись.Доступность = Ложь;
		ТекущийЭлемент = Элементы.ПинКод;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеАвторизации = Новый Структура;
	НомерКонтейнера = Число(Сред(УчетнаяЗапись, 4, 1));
	ДанныеАвторизации.Вставить("НомерКонтейнера", НомерКонтейнера);
	ДанныеАвторизации.Вставить("ПинКод", ПинКод);
	Закрыть(ДанныеАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

