
//Проверим перекрестное наполнение между типом договора и номером

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПрефиксОрг = Организация.Префикс;
	ДлинаПреф  = 1 + СтрДлина(ПрефиксОрг);
	
	Если ЭтоНовый() или (Лев(Номер,ДлинаПреф)=ПрефиксОрг+"Р" и не ЗначениеЗаполнено(ПоСчету))или (Лев(Номер,ДлинаПреф)=ПрефиксОрг+"Д" и ЗначениеЗаполнено(ПоСчету)) тогда
		
		Если ЗначениеЗаполнено(ПоСчету)	тогда
			УстановитьНовыйНомер(ПрефиксОрг+"Р");
		Иначе
			УстановитьНовыйНомер(ПрефиксОрг+"Д");
		КонецЕсли;	
		
		Если не ЗначениеЗаполнено(НомерДоговора) тогда
			НомерДоговора = Номер;
		КонецЕсли;	
		Если не ЗначениеЗаполнено(ДатаДоговора) тогда
			ДатаДоговора  = Дата;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
