Перем мИмяРегистраДляПодбораСерий Экспорт;
Перем мИспользоватьХарактеристики Экспорт;
Перем мИспользоватьСерии Экспорт;
Перем УчетнаяПолитикаПоСкладу Экспорт;

Перем мТекстЗапросаОтборНоменклатурыПоРодителю;
Перем мОтборНоменклатурыПоРодителю;

Перем СтруктураОстаткиПриВыбореНоменклатуры Экспорт;

Перем мУсловиеНоменклатура Экспорт;
Перем мУсловиеНоменклатураСклад Экспорт;
Перем мУсловиеНоменклатураСкладОрганизация Экспорт;

#Если Клиент Тогда
	
// Процедура устанавливает запрос параметр "УсловиеПродаж"
//
Процедура УстановитьПараметрУсловиеПродаж(Запрос)
	Перем УсловиеПродаж;
	СтруктураИсходныхПараметров.Свойство("УсловиеПродаж", УсловиеПродаж);
	УсловиеПродаж = ?(УсловиеПродаж = Неопределено ИЛИ УсловиеПродаж = Справочники.УсловияПродаж.ПустаяСсылка(), NULL, УсловиеПродаж);
	Запрос.УстановитьПараметр("УсловиеПродаж", УсловиеПродаж);
КонецПроцедуры

// Функция формирует строку запроса для получения свободных остатков
// Параметры
//  <СтруктураРегистровОстатков>  – <Структура> – <Ключи структуры содержат названия регистров накопления остатков>
//  <ТекстУсловияКачества>        – <Строка> – <Строка с условием на качество номенклатуры>
//  <ПолучатьНоменклатуры>        – <Булево> – <ПолучатьНоменклатуры = Истина сформировать строку запроса в разрезе "Номенклатура,ХарактеристикаНоменклатуры,Качество">
//                                             <ПолучатьНоменклатуры = Ложь сформировать строку запроса в разрезе "ХарактеристикаНоменклатуры,Качество">
//
// Возвращаемое значение:
//   <Строка>   – <Строка запроса для расчета свободного остатка>
Функция ПолучитьСтрокуЗапросаСвободныеОстатки(СтруктураРегистровОстатков, ТекстУсловияКачества, ПолучатьНоменклатуры) Экспорт
	Перем СоответствиеИмяРегистраУсловие;
	Перем СтрокаЗапроса;
	СтрокаЗапроса = "";
	СоответствиеИмяРегистраУсловие = Новый Соответствие();
	СоответствиеИмяРегистраУсловие.Вставить("ТоварыНаСкладах"  , ЭтотОбъект.мУсловиеНоменклатураСклад + ТекстУсловияКачества);
	СоответствиеИмяРегистраУсловие.Вставить("ТоварыВРознице"   , ЭтотОбъект.мУсловиеНоменклатураСклад + ТекстУсловияКачества);
	СоответствиеИмяРегистраУсловие.Вставить("ТоварыОрганизаций", ЭтотОбъект.мУсловиеНоменклатураСкладОрганизация + ТекстУсловияКачества);
	СоответствиеИмяРегистраУсловие.Вставить("ТоварыВНТТ"       , ЭтотОбъект.мУсловиеНоменклатураСклад);
	Для Каждого ИмяРегистра Из СтруктураРегистровОстатков Цикл
		СтрокаЗапроса = СтрокаЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	" + ?(ПолучатьНоменклатуры, "ТаблицаОстатков.Номенклатура               КАК Номенклатура,", "") + "
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	" + ?(ИмяРегистра.Ключ = "ТоварыВНТТ", "ЗНАЧЕНИЕ(Справочник.Качество.Новый)", "ТаблицаОстатков.Качество")+ " КАК Качество,
		|	" + ?(ИмяРегистра.Ключ = "ТоварыОрганизаций", "0", "ТаблицаОстатков.КоличествоОстаток") + " КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления." + ИмяРегистра.Ключ + ".Остатки(&Дата, " + СоответствиеИмяРегистраУсловие[ИмяРегистра.Ключ] + ") КАК ТаблицаОстатков
		|";
	КонецЦикла;
	СтрокаЗапроса = Сред(СтрокаЗапроса, 16);
	возврат СтрокаЗапроса;
КонецФункции

//Процедура создает временные таблицы если в СтруктураИсходныхПараметров.Свойство("Заказы",СтруктураЗаказов) является структурой
Процедура ДобавитьВременнуюТаблицу(Запрос) Экспорт
	СтруктураВременныеТаблицы = Неопределено;
	ЗаказИзШапки = Ложь;
	СтруктураИсходныхПараметров.Свойство("ВременныеТаблицы",СтруктураВременныеТаблицы);
	Если НЕ СтруктураВременныеТаблицы = Неопределено Тогда
		СоздатьВременнуюТаблицу(Запрос, СтруктураВременныеТаблицы);
	КонецЕсли;
КонецПроцедуры

//Процедура создает временную таблицу условия продаж номенклатуры
//
// Параметры
//  <Запрос>  – <Запрос> – <Запрос, для которого свойству МенеджерВременныхТаблиц добавляется временная таблица>
//
Процедура ВременнаяТаблицаУсловияПродаж(Запрос)

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		УсловияПродаж.НоменклатурнаяЦеноваяГруппа КАК НоменклатурнаяЦеноваяГруппа,
	|		УсловияПродаж.ПроцентНаценки              КАК ПроцентНаценки
	|ПОМЕСТИТЬ УсловияПродаж
	|ИЗ
	|	РегистрСведений.НаценкиПоУсловиямПродаж.СрезПоследних(&ДатаРегистраСведений, УсловиеПродаж = &УсловиеПродаж) КАК УсловияПродаж
	|ИНДЕКСИРОВАТЬ ПО НоменклатурнаяЦеноваяГруппа
	|";
	Запрос.Выполнить();

КонецПроцедуры

//Процедура создает временные таблицы для расчета цен на номенклатуру
//
// Параметры
//  <Запрос>  – <Запрос> – <Запрос, для которого свойству МенеджерВременныхТаблиц добавляется временная таблица>
//
Процедура ВременнаяТаблицаЦен(Запрос)

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		ТипИЗГрупп.НоменклатурнаяЦеноваяГруппа КАК НоменклатурнаяЦеноваяГруппа,
	|		ТипИЗГрупп.ТипЦен                      КАК ТипЦен
	|ПОМЕСТИТЬ ТипИЗГрупп
	|ИЗ
	|	РегистрСведений.ТипыЦенПоГруппамНоменклатурыДляПокупателей.СрезПоследних(&ДатаРегистраСведений, Контрагент = &Контрагент) КАК ТипИЗГрупп
	|ГДЕ
	|	НЕ ТипИЗГрупп.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка)
	|ИНДЕКСИРОВАТЬ ПО НоменклатурнаяЦеноваяГруппа
	|";
	Запрос.Выполнить();

	Запрос.Текст = "
	|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|			ТипЦен           КАК ТипЦен,
	|			МАКСИМУМ(Период) КАК Период
	|	ПОМЕСТИТЬ Диапазон2
	|	ИЗ
	|		РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних(&ДатаРегистраСведений, ) КАК Диапазон
	|	СГРУППИРОВАТЬ ПО Диапазон.ТипЦен
	|ИНДЕКСИРОВАТЬ ПО ТипЦен, Период
	|";
	Запрос.Выполнить();

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		Диапазон.Валюта         КАК Валюта,
	|		ТипыЦен.БазовыйТипЦен   КАК ТипЦен,
	|		Диапазон.Цена           КАК Цена,
	|		Диапазон.ВерхняяГраница КАК ВерхняяГраница
	|ПОМЕСТИТЬ ЦенаПоДиапазонуВерхняяГраница
	|ИЗ
	|	РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних(&ДатаРегистраСведений,) КАК Диапазон 
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	/////////////////////////////
	|	Диапазон2 КАК Диапазон2
	/////////////////////////////
	|ПО Диапазон2.ТипЦен = Диапазон.ТипЦен И Диапазон2.Период = Диапазон.Период
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦен
	|ПО
	|	ТипыЦен.Ссылка = Диапазон.ТипЦен
	|ИНДЕКСИРОВАТЬ ПО ТипЦен, ВерхняяГраница
	|";
	Запрос.Выполнить();

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		Диапазон.Валюта         КАК Валюта,
	|		ТипыЦен.БазовыйТипЦен   КАК ТипЦен,
	|		Диапазон.Цена           КАК Цена,
	|		Диапазон.ВерхняяГраница КАК ВерхняяГраница
	|ПОМЕСТИТЬ ЦенаПоДиапазонуЦена
	|ИЗ
	|	РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних(&ДатаРегистраСведений,) КАК Диапазон 
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦен
	|ПО
	|	ТипыЦен.Ссылка = Диапазон.ТипЦен
	|ИНДЕКСИРОВАТЬ ПО ТипЦен, ВерхняяГраница
	|";
	Запрос.Выполнить();

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатуры.Номенклатура               КАК Номенклатура,
	|	ЦеныНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатуры.ТипЦен                     КАК ТипЦен,
	|	ЦеныНоменклатуры.Валюта                     КАК Валюта,
	|	ЦеныНоменклатуры.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
	|	ЦеныНоменклатуры.ПроцентСкидкиНаценки       КАК ПроцентСкидкиНаценки,
	|	ЦеныНоменклатуры.СпособРасчетаЦены          КАК СпособРасчетаЦены,
	|	ЦеныНоменклатуры.Цена                       КАК Цена
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + ") КАК ЦеныНоменклатуры
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры, ТипЦен
	|";
	Запрос.Выполнить();

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДинамическийТипЦен.Номенклатура               КАК Номенклатура,
	|	ДинамическийТипЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДинамическийТипЦен.ДинамическийТип            КАК БазовыйТипЦен,
	|	ДинамическийТипЦен.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ЦенаПоДиапазонуЦена.Цена, 0.00)      КАК Цена,
	|	ЦенаПоДиапазонуЦена.Валюта                    КАК Валюта
	|ПОМЕСТИТЬ ЦенаПоДиапазону
	|ИЗ
	|(
	|	ВЫБРАТЬ ЦенаДляРасчетаДиапазона.Номенклатура                  КАК Номенклатура,
	|			ЦенаДляРасчетаДиапазона.ХарактеристикаНоменклатуры    КАК ХарактеристикаНоменклатуры,
	|			ЦенаДляРасчетаДиапазона.ДинамическийТип               КАК ДинамическийТип,
	|			МИНИМУМ(ЦенаПоДиапазонуВерхняяГраница.Валюта)         КАК Валюта,
	|			МИНИМУМ(ЦенаДляРасчетаДиапазона.ЕдиницаИзмерения)     КАК ЕдиницаИзмерения,
	|			МИНИМУМ(ЦенаПоДиапазонуВерхняяГраница.ВерхняяГраница) КАК Цена
	|	ИЗ
	|	(
	|		ВЫБРАТЬ
	|				НомеклатураХарактеристикаТип.Номенклатура                                                КАК Номенклатура,
	|				НомеклатураХарактеристикаТип.ХарактеристикаНоменклатуры                                  КАК ХарактеристикаНоменклатуры,
	|				ЕСТЬNULL(ЕСТЬNULL(ЦеныБазовые.Цена, ЦеныБазовыеПустаяХарактеристика.Цена), 0.00)         КАК Цена,
	|				ЕСТЬNULL(ЦеныБазовые.ТипЦен, ЦеныБазовыеПустаяХарактеристика.ТипЦен)                     КАК ДинамическийТип,
	|				ЕСТЬNULL(ЦеныБазовые.ЕдиницаИзмерения, ЦеныБазовыеПустаяХарактеристика.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	|		ИЗ
	/////////////////////////////////////////////////
	|			НоменклатураХарактеристика КАК НомеклатураХарактеристикаТип
	/////////////////////////////////////////////////
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	/////////////////////////////////////////////////
	|			ЦеныНоменклатуры КАК ЦеныБазовые
	/////////////////////////////////////////////////
	|		ПО
	|			ЦеныБазовые.Номенклатура = НомеклатураХарактеристикаТип.Номенклатура
	|			И ЦеныБазовые.ХарактеристикаНоменклатуры = НомеклатураХарактеристикаТип.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	/////////////////////////////////////////////////
	|			ЦеныНоменклатуры КАК ЦеныБазовыеПустаяХарактеристика
	/////////////////////////////////////////////////
	|		ПО
	|			ЦеныБазовыеПустаяХарактеристика.Номенклатура = НомеклатураХарактеристикаТип.Номенклатура
	|			И ЦеныБазовыеПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ГДЕ
	|			НЕ ЕСТЬNULL(ЦеныБазовые.ТипЦен, ЦеныБазовыеПустаяХарактеристика.ТипЦен) ЕСТЬ NULL
	|) КАК ЦенаДляРасчетаДиапазона
	|ЛЕВОЕ СОЕДИНЕНИЕ
	/////////////////////////////////////////////////
	|		ЦенаПоДиапазонуВерхняяГраница КАК ЦенаПоДиапазонуВерхняяГраница
	/////////////////////////////////////////////////
	|ПО
	|	ЦенаПоДиапазонуВерхняяГраница.ТипЦен = ЦенаДляРасчетаДиапазона.ДинамическийТип
	|	И ЦенаПоДиапазонуВерхняяГраница.ВерхняяГраница > ЦенаДляРасчетаДиапазона.Цена
	|ГДЕ
	|	НЕ ЦенаПоДиапазонуВерхняяГраница.ВерхняяГраница ЕСТЬ NULL
	|	СГРУППИРОВАТЬ ПО ЦенаДляРасчетаДиапазона.ДинамическийТип
	|	, ЦенаДляРасчетаДиапазона.ХарактеристикаНоменклатуры
	|	, ЦенаДляРасчетаДиапазона.Номенклатура
	|) КАК ДинамическийТипЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	/////////////////////////////////////////////////
	|		ЦенаПоДиапазонуЦена КАК ЦенаПоДиапазонуЦена
	/////////////////////////////////////////////////
	|ПО
	|	ЦенаПоДиапазонуЦена.ТипЦен = ДинамическийТипЦен.ДинамическийТип
	|	И ЦенаПоДиапазонуЦена.ВерхняяГраница = ДинамическийТипЦен.Цена
	|ИНДЕКСИРОВАТЬ ПО БазовыйТипЦен, Номенклатура, ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УсловияПоставок.Номенклатура               КАК Номенклатура,
	|	УсловияПоставок.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	УсловияПоставок.ВалютаЦены                 КАК ВалютаЦены,
	|	УсловияПоставок.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
	|	УсловияПоставок.Цена                       КАК Цена
	|ПОМЕСТИТЬ УсловияПоставок
	|ИЗ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставок
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();
	
	Запрос.Текст = "
	|		ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|				ЦеныНаБазовыйТип.Номенклатура                                КАК Номенклатура,
	|				ЦеныНаБазовыйТип.ХарактеристикаНоменклатуры                  КАК ХарактеристикаНоменклатуры,
	|				ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
	|						ТОГДА ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена)
	|						ИНАЧЕ
	|								ВЫБОР	КОГДА ЦеныНаБазовыйТип.Рассчитывается
	|										ТОГДА
	|												ВЫБОР	КОГДА ЦеныНаБазовыйТип.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
	|														ТОГДА ЕСТЬNULL(ЦеныНаБазовыйТип.Цена, 0.00) + ЕСТЬNULL(ЦеныНаБазовыйТип.Цена, 0.00) * (ЦеныНаБазовыйТип.ПроцентСкидкиНаценки /100)
	|														ИНАЧЕ ЕСТЬNULL(ЦенаПоДиапазону.Цена, 0.00)
	|												КОНЕЦ
	|										ИНАЧЕ ЦеныНаБазовыйТип.Цена
	|								КОНЕЦ
	|				КОНЕЦ                                                        КАК Цена,
	|				ВЫБОР 	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
	|						ТОГДА ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ВалютаЦены)
	|						ИНАЧЕ
	|								ВЫБОР	КОГДА ЦеныНаБазовыйТип.Рассчитывается
	|										ТОГДА
	|												ВЫБОР	КОГДА ЦеныНаБазовыйТип.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
	|														ТОГДА ЦеныНаБазовыйТип.Валюта
	|														ИНАЧЕ ЦенаПоДиапазону.Валюта
	|												КОНЕЦ
	|										ИНАЧЕ ЦеныНаБазовыйТип.Валюта
	|								КОНЕЦ
	|				КОНЕЦ                                                        КАК Валюта,
	|				ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
	|						ТОГДА ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ЕдиницаИзмерения)
	|						ИНАЧЕ
	|								ВЫБОР	КОГДА ЦеныНаБазовыйТип.Рассчитывается
	|										ТОГДА
	|												ВЫБОР	КОГДА ЦеныНаБазовыйТип.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
	|														ТОГДА ЦеныНаБазовыйТип.ЕдиницаИзмерения
	|														ИНАЧЕ ЦенаПоДиапазону.ЕдиницаИзмерения
	|												КОНЕЦ
	|										ИНАЧЕ ЦеныНаБазовыйТип.ЕдиницаИзмерения
	|								КОНЕЦ
	|				КОНЕЦ                                                        КАК ЕдиницаИзмерения,
	|				ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
	|						ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ                                                        КАК ФлагУсловийПоставки
	|		ПОМЕСТИТЬ Цены
	|		ИЗ
	|		(
	|			ВЫБРАТЬ
	|				НоменклатураХарактеристикаТипЦены.Номенклатура                       КАК Номенклатура,
	|				НоменклатураХарактеристикаТипЦены.ХарактеристикаНоменклатуры         КАК ХарактеристикаНоменклатуры,
	|				ВЫБОР	КОГДА НоменклатураХарактеристикаТипЦены.Рассчитывается
	|						ТОГДА	ВЫБОР	КОГДА ЕСТЬNULL(КурсВалют.Кратность, 0.00) = 0 ИЛИ ЕСТЬNULL(КурсВалютДинамическийТип.Курс, 0.00) = 0
	|										ТОГДА 0.00
	|										ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(ЦеныНоменклатуры.Цена, ЦеныНоменклатурыПустаяХарактеристика.Цена), 0.00)
	|											  * ЕСТЬNULL(КурсВалют.Курс, 0.00)
	|											  * ЕСТЬNULL(КурсВалютДинамическийТип.Кратность, 0.00)
	|											  / КурсВалют.Кратность
	|											  / КурсВалютДинамическийТип.Курс
	|								КОНЕЦ
	|						ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, ЦеныНоменклатурыПустаяХарактеристика.Цена)
	|				КОНЕЦ                                                                КАК Цена,
	|				ВЫБОР	КОГДА НоменклатураХарактеристикаТипЦены.Рассчитывается
	|						ТОГДА	ВЫБОР	КОГДА ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.СпособРасчетаЦены, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.СпособРасчетаЦены) ЕСТЬ NULL
	|										ТОГДА ТипЦенНоменклаутры.СпособРасчетаЦены
	|										ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.СпособРасчетаЦены, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.СпособРасчетаЦены)
	|								КОНЕЦ
	|						ИНАЧЕ NULL
	|				КОНЕЦ                                                                КАК СпособРасчета,
	|				ВЫБОР 	КОГДА НоменклатураХарактеристикаТипЦены.Рассчитывается
	|						ТОГДА	ВЫБОР	КОГДА ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.ПроцентСкидкиНаценки, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.ПроцентСкидкиНаценки) ЕСТЬ NULL
	|										ТОГДА ТипЦенНоменклаутры.ПроцентСкидкиНаценки
	|										ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.ПроцентСкидкиНаценки, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.ПроцентСкидкиНаценки)
	|								КОНЕЦ
	|						ИНАЧЕ NULL
	|				КОНЕЦ                                                                КАК ПроцентСкидкиНаценки,
	|				ВЫБОР	КОГДА НоменклатураХарактеристикаТипЦены.Рассчитывается
	|						ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.Валюта, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.Валюта), ТипЦенНоменклаутры.ВалютаЦены)
	|						ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Валюта, ЦеныНоменклатурыПустаяХарактеристика.Валюта)
	|				КОНЕЦ                                                                КАК Валюта,
	|				КурсВалютДинамическийТип.Валюта                                      КАК ВалютаДинамическийТип,
	|				ЕСТЬNULL(ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения, ЦеныНоменклатурыПустаяХарактеристика.ЕдиницаИзмерения), НоменклатураХарактеристикаТипЦены.ЕдиницаХраненияОстатков) КАК ЕдиницаИзмерения,
	|				НоменклатураХарактеристикаТипЦены.ТипЦен                             КАК ТипЦен,
	|				НоменклатураХарактеристикаТипЦены.ТипЦенБазовыйДинамический          КАК ТипЦенБазовыйДинамический,
	|				НоменклатураХарактеристикаТипЦены.Рассчитывается                     КАК Рассчитывается
	|			ИЗ
	|			(
	|				ВЫБРАТЬ
	|					НоменклатураХарактеристикаТипЦены.Номенклатура               КАК Номенклатура,
	|					НоменклатураХарактеристикаТипЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|					НоменклатураХарактеристикаТипЦены.ЕдиницаХраненияОстатков    КАК ЕдиницаХраненияОстатков,
	|					ВЫБОР	КОГДА СпрТипЦены.Рассчитывается
	|							ТОГДА СпрТипЦены.БазовыйТипЦен
	|							ИНАЧЕ СпрТипЦены.Ссылка
	|					КОНЕЦ                                                        КАК ТипЦен,
	|					СпрТипЦены.Ссылка                                            КАК ТипЦенБазовыйДинамический,
	|					СпрТипЦены.Рассчитывается                                    КАК Рассчитывается
	|				ИЗ
	|				(
	|					ВЫБРАТЬ НоменклатураХарактеристика.Номенклатура                        КАК Номенклатура,
	|							НоменклатураХарактеристика.ХарактеристикаНоменклатуры          КАК ХарактеристикаНоменклатуры,
	|							НоменклатураХарактеристика.ТипЦен                              КАК Тип,
	|							СпрНомеклатура.ЕдиницаХраненияОстатков                         КАК ЕдиницаХраненияОстатков,
	|							ЕСТЬNULL(ТипИЗГрупп.ТипЦен, НоменклатураХарактеристика.ТипЦен) КАК ТипЦен
	|					ИЗ
	|					(
	|						ВЫБРАТЬ
	|							Характеристики.Владелец    КАК Номенклатура,
	|							Характеристики.Ссылка      КАК ХарактеристикаНоменклатуры,
	|							&ТипЦен КАК ТипЦен
	|						ИЗ
	|							Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|							Справочник.Номенклатура    КАК сНоменклатура
	|						ПО
	|							сНоменклатура.Ссылка = Характеристики.Владелец
	|						ГДЕ сНоменклатура.Родитель = &Родитель
	|						ОБЪЕДИНИТЬ
	|						ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								Ссылка                 КАК Номенклатура,
	|								ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|								&ТипЦен                КАК ТипЦен
	|						ИЗ
	|							Справочник.Номенклатура ГДЕ Родитель = &Родитель
	|					) КАК НоменклатураХарактеристика
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|						Справочник.Номенклатура КАК СпрНомеклатура
	|					ПО
	|						СпрНомеклатура.Ссылка = НоменклатураХарактеристика.Номенклатура
	|					ЛЕВОЕ СОЕДИНЕНИЕ
	/////////////////////////////////////////////////
	|						ТипИЗГрупп КАК ТипИЗГрупп
	/////////////////////////////////////////////////
	|					ПО
	|						ТипИЗГрупп.НоменклатурнаяЦеноваяГруппа = СпрНомеклатура.НоменклатурнаяГруппа
	|						ИЛИ ТипИЗГрупп.НоменклатурнаяЦеноваяГруппа = СпрНомеклатура.ЦеноваяГруппа
	|				) КАК НоменклатураХарактеристикаТипЦены
	|				ЛЕВОЕ СОЕДИНЕНИЕ
	|					Справочник.ТипыЦенНоменклатуры КАК СпрТипЦены
	|				ПО
	|					СпрТипЦены.Ссылка = НоменклатураХарактеристикаТипЦены.ТипЦен
	|			) КАК НоменклатураХарактеристикаТипЦены
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|				ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|			ПО
	|				ЦеныНоменклатуры.Номенклатура = НоменклатураХарактеристикаТипЦены.Номенклатура
	|				И ЦеныНоменклатуры.ХарактеристикаНоменклатуры = НоменклатураХарактеристикаТипЦены.ХарактеристикаНоменклатуры
	|				И ЦеныНоменклатуры.ТипЦен = НоменклатураХарактеристикаТипЦены.ТипЦен
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|				ЦеныНоменклатуры КАК ЦеныНоменклатурыПустаяХарактеристика
	|			ПО
	|				ЦеныНоменклатурыПустаяХарактеристика.Номенклатура = НоменклатураХарактеристикаТипЦены.Номенклатура
	|				И ЦеныНоменклатурыПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И ЦеныНоменклатурыПустаяХарактеристика.ТипЦен = НоменклатураХарактеристикаТипЦены.ТипЦен
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|				ЦеныНоменклатуры КАК ЦеныНоменклатурыДинамическийТип
	|			ПО
	|				ЦеныНоменклатурыДинамическийТип.Номенклатура = НоменклатураХарактеристикаТипЦены.Номенклатура
	|				И ЦеныНоменклатурыДинамическийТип.ХарактеристикаНоменклатуры = НоменклатураХарактеристикаТипЦены.ХарактеристикаНоменклатуры
	|				И ЦеныНоменклатурыДинамическийТип.ТипЦен = НоменклатураХарактеристикаТипЦены.ТипЦенБазовыйДинамический
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|				ЦеныНоменклатуры КАК ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип
	|			ПО
	|				ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.Номенклатура = НоменклатураХарактеристикаТипЦены.Номенклатура
	|				И ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.ТипЦен = НоменклатураХарактеристикаТипЦены.ТипЦенБазовыйДинамический
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|				РегистрСведений.КурсыВалют.СрезПоследних(&ДатаРегистраСведений) КАК КурсВалют
	|			ПО
	|				КурсВалют.Валюта = ЕСТЬNULL(ЦеныНоменклатуры.Валюта, ЦеныНоменклатурыПустаяХарактеристика.Валюта)
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|				Справочник.ТипыЦенНоменклатуры КАК ТипЦенНоменклаутры
	|			ПО 
	|				ТипЦенНоменклаутры.Ссылка = НоменклатураХарактеристикаТипЦены.ТипЦенБазовыйДинамический
	|			ЛЕВОЕ СОЕДИНЕНИЕ
	|				РегистрСведений.КурсыВалют.СрезПоследних(&ДатаРегистраСведений) КАК КурсВалютДинамическийТип
	|			ПО
	|				КурсВалютДинамическийТип.Валюта = 	ВЫБОР 	КОГДА НоменклатураХарактеристикаТипЦены.Рассчитывается И ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.Валюта, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.Валюта) ЕСТЬ NULL
	|															ТОГДА ТипЦенНоменклаутры.ВалютаЦены
	|															ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.Валюта, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.Валюта)
	|													КОНЕЦ
	|		) КАК ЦеныНаБазовыйТип
	|		//Динамический тип цен
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	/////////////////////////////////////////////////
	|			ЦенаПоДиапазону КАК ЦенаПоДиапазону
	/////////////////////////////////////////////////
	|		ПО
	|			ЦенаПоДиапазону.БазовыйТипЦен = ЦеныНаБазовыйТип.ТипЦен
	|			И ЦенаПоДиапазону.Номенклатура = ЦеныНаБазовыйТип.Номенклатура
	|			И ЦенаПоДиапазону.ХарактеристикаНоменклатуры = ЦеныНаБазовыйТип.ХарактеристикаНоменклатуры
	|		//Цены по договорам самый высокий приоритет
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	/////////////////////////////////////////////////
	|			УсловияПоставок КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	/////////////////////////////////////////////////
	|		ПО
	|			УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = ЦеныНаБазовыйТип.Номенклатура
	|			И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ЦеныНаБазовыйТип.ХарактеристикаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	/////////////////////////////////////////////////
	|			УсловияПоставок КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика
	/////////////////////////////////////////////////
	|		ПО
	|			УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Номенклатура = ЦеныНаБазовыйТип.Номенклатура
	|			И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ГДЕ
	|			ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
	|					ТОГДА ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена)
	|					ИНАЧЕ
	|						ВЫБОР	КОГДА ЦеныНаБазовыйТип.Рассчитывается
	|								ТОГДА
	|									ВЫБОР	КОГДА ЦеныНаБазовыйТип.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
	|											ТОГДА ЕСТЬNULL(ЦеныНаБазовыйТип.Цена, 0.00) + ЕСТЬNULL(ЦеныНаБазовыйТип.Цена, 0.00) * (ЦеныНаБазовыйТип.ПроцентСкидкиНаценки /100)
	|											ИНАЧЕ ЕСТЬNULL(ЦенаПоДиапазону.Цена, 0.00)
	|									КОНЕЦ
	|								ИНАЧЕ ЕСТЬNULL(ЦеныНаБазовыйТип.Цена, 0.00)
	|						КОНЕЦ
	|			КОНЕЦ > 0
	|ИНДЕКСИРОВАТЬ ПО ЦеныНаБазовыйТип.Номенклатура, ЦеныНаБазовыйТип.ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();

КонецПроцедуры

//Процедура создает временные таблицы для расчета цен на номенклатуру по типам цен контрагентов
//
// Параметры
//  <Запрос>  – <Запрос> – <Запрос, для которого свойству МенеджерВременныхТаблиц добавляется временная таблица>
//
Процедура ВременнаяТаблицаЦенКонтрагентов(Запрос)

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УсловияПоставок.Номенклатура               КАК Номенклатура,
	|	УсловияПоставок.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	УсловияПоставок.ВалютаЦены                 КАК ВалютаЦены,
	|	УсловияПоставок.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
	|	УсловияПоставок.Цена                       КАК Цена
	|ПОМЕСТИТЬ УсловияПоставок
	|ИЗ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставок
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура               КАК Номенклатура,
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныСрезПоследних.Цена                       КАК Цена,
	|	ЦеныСрезПоследних.Валюта                     КАК Валюта,
	|	ЦеныСрезПоследних.ЕдиницаИзмерения           КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ЦеныСрезПоследних
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ИНДЕКСИРОВАТЬ ПО ЦеныСрезПоследних.Номенклатура, ЦеныСрезПоследних.ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НоменклатураХарактеристика.Номенклатура                  КАК Номенклатура,
	|	НоменклатураХарактеристика.ХарактеристикаНоменклатуры    КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
	|			ТОГДА ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена)
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена), 0.00)
	|	КОНЕЦ                                                    КАК Цена,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ВалютаЦены), ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Валюта, ЦеныСрезПоследнихПустаяХарактеристика.Валюта), ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|	КОНЕЦ                                                    КАК Валюта,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), НоменклатураХарактеристика.ЕдиницаХраненияОстатков)
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.ЕдиницаИзмерения, ЦеныСрезПоследнихПустаяХарактеристика.ЕдиницаИзмерения), НоменклатураХарактеристика.ЕдиницаХраненияОстатков)
	|	КОНЕЦ                                                    КАК ЕдиницаИзмерения,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
	|			ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                    КАК ФлагУсловийПоставки
	|ПОМЕСТИТЬ Цены
	|ИЗ
	///////////////////////////////////////
	|	НоменклатураХарактеристика КАК НоменклатураХарактеристика
	///////////////////////////////////////
	|ЛЕВОЕ СОЕДИНЕНИЕ
	///////////////////////////////////////
	|	ЦеныСрезПоследних КАК ЦеныСрезПоследних
	///////////////////////////////////////
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И ЦеныСрезПоследних.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	///////////////////////////////////////
	|	ЦеныСрезПоследних КАК ЦеныСрезПоследнихПустаяХарактеристика
	///////////////////////////////////////
	|ПО
	|	ЦеныСрезПоследнихПустаяХарактеристика.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И ЦеныСрезПоследнихПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|ЛЕВОЕ СОЕДИНЕНИЕ
	///////////////////////////////////////
	|	УсловияПоставок КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	///////////////////////////////////////
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	///////////////////////////////////////
	|	УсловияПоставок КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика
	///////////////////////////////////////
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|ИНДЕКСИРОВАТЬ ПО НоменклатураХарактеристика.Номенклатура, НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();

КонецПроцедуры

//Процедура создает временную таблицу для номенклатуры контрагента
//
// Параметры
//  <Запрос>  – <Запрос> – <Запрос, для которого свойству МенеджерВременныхТаблиц добавляется временная таблица>
//
Процедура ВременнаяТаблицаНоменклатураКонтрагента(Запрос)

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураКонтрагентов.Номенклатура                        КАК Номенклатура,
	|	НоменклатураКонтрагентов.Контрагент                          КАК Контрагент,
	|	НоменклатураКонтрагентов.ХарактеристикаНоменклатуры          КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Представление, """")     КАК ПредставлениеХарактеристики,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Наименование, """")      КАК НаименованиеХарактеристики,
	|	НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК НаименованиеНоменклатурыКонтрагента,
	|	НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента      КАК АртикулНоменклатурыКонтрагента
	|ПОМЕСТИТЬ НоменклатураКонтрагентов
	|ИЗ
	|	РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ПО
	|	ХарактеристикиНоменклатуры.Владелец = НоменклатураКонтрагентов.Номенклатура
	|	И ХарактеристикиНоменклатуры.Ссылка = НоменклатураКонтрагентов.ХарактеристикаНоменклатуры
	|ГДЕ
	|	НоменклатураКонтрагентов.Контрагент = &Контрагент
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();

КонецПроцедуры // ВременнаяТаблицаНоменклатураКонтрагента()

// Процедура создает временную таблицу на номенклутуру с характеристиками
//
// Параметры
//  <Запрос>  – <Запрос> – <Запрос, для которого свойству МенеджерВременныхТаблиц добавляется временная таблица>
//
Процедура ВременнаяТаблицаНоменклатураХарактеристика(Запрос)

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		ХарактеристикиНоменклатуры.Владелец         КАК Номенклатура,
	|		ХарактеристикиНоменклатуры.Ссылка           КАК ХарактеристикаНоменклатуры,
	|		сНоменклатура.ЕдиницаХраненияОстатков       КАК ЕдиницаХраненияОстатков,
	|		ХарактеристикиНоменклатуры.Представление    КАК Представление,
	|		ХарактеристикиНоменклатуры.Наименование     КАК НаименованиеХарактеристики
	|ПОМЕСТИТЬ НоменклатураХарактеристика
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.Номенклатура КАК сНоменклатура
	|ПО
	|	сНоменклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	|ГДЕ
	|	сНоменклатура.Родитель = &Родитель
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|		сНоменалатура.Ссылка                        КАК Номенклатура,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|		сНоменалатура.ЕдиницаХраненияОстатков       КАК ЕдиницаХраненияОстатков,
	|		""""                                        КАК Представление,
	|		""""                                        КАК НаименованиеХарактеристики
	|ИЗ
	|	Справочник.Номенклатура КАК сНоменалатура
	|ГДЕ
	|	сНоменалатура.Родитель = &Родитель
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();

КонецПроцедуры // ВременнаяТаблицаНоменклатураХарактеристика()

// Процедура создает временную таблицу с остатками номенклатуры
//
// Параметры
//  <Запрос>  – <Запрос> – <Запрос, для которого свойству МенеджерВременныхТаблиц добавляется временная таблица>
//
Процедура ВременнаяТаблицаОстаткиНоменклатуры(Запрос, РегистрыОстатков)
	Перем УчитыватьЗаказ, ДокументРезерва, ВидРегистраПлюсСвободныйОстаток;

	ТекстУсловияКачества = " И ВЫБОР КОГДА &РазворачиватьДоКачества ТОГДА ИСТИНА ИНАЧЕ Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый) КОНЕЦ";

	Если РегистрыОстатков = "ТоварыВНТТ" Тогда
		Запрос.Текст = "
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		ТоварыНаСкладахОстаткиОрганизации.Номенклатура                                               КАК Номенклатура,
		|		ТоварыНаСкладахОстаткиОрганизации.ХарактеристикаНоменклатуры                                 КАК ХарактеристикаНоменклатуры,
		|		ЗНАЧЕНИЕ(Справочник.Качество.Новый)                                                          КАК Качество,
		|		СУММА(ЕСТЬNULL(ТоварыНаСкладахОстаткиОрганизации.ТоварыНаСкладахКоличествоОстаток, 0.00))    КАК КоличествоСвободныйОстаток,
		|		СУММА(ЕСТЬNULL(ТоварыНаСкладахОстаткиОрганизации.ОстаткиОгранизацииКоличествоОстаток, 0.00)) КАК КоличествоОстатокОрганизации
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|(	ВЫБРАТЬ
		|		ТоварыНаСкладах.Номенклатура                  КАК Номенклатура,
		|		ТоварыНаСкладах.ХарактеристикаНоменклатуры    КАК ХарактеристикаНоменклатуры,
		|		ТоварыНаСкладах.КоличествоОстаток             КАК ТоварыНаСкладахКоличествоОстаток,
		|		0                                             КАК ОстаткиОгранизацииКоличествоОстаток
		|		
		|	ИЗ
		|		РегистрНакопления.ТоварыВНТТ.Остатки(&Дата, " + мУсловиеНоменклатураСклад + ") КАК ТоварыНаСкладах
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОстаткиОрганизации.Номенклатура               КАК Номенклатура,
		|		ОстаткиОрганизации.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		0                                             КАК ТоварыНаСкладахКоличествоОстаток,
		|		ОстаткиОрганизации.КоличествоОстаток          КАК ОстаткиОгранизацииКоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мУсловиеНоменклатураСкладОрганизация + ТекстУсловияКачества + ") КАК ОстаткиОрганизации
		|) КАК ТоварыНаСкладахОстаткиОрганизации
		|	
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстаткиОрганизации.Номенклатура,
		|	ТоварыНаСкладахОстаткиОрганизации.ХарактеристикаНоменклатуры
		|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
		|";
		Запрос.Выполнить();
		возврат;
	КонецЕсли;

	УчитыватьЗаказ = ПолучитьСтруктуруЗаказовВРезерве();
	//Если УчитыватьЗаказ["СтруктураЗаказов"] равен Неопределено значит в запросе не нужно учитывать по заказам
	//иначе нужно считать заказы в резерве

	СтруктураЗаказов = УчитыватьЗаказ["СтруктураЗаказов"];

	Если НЕ СтруктураЗаказов = Неопределено Тогда
		УчитыватьЗаказ.Свойство("ДокументРезерва",ДокументРезерва);
		ЗаказИзШапки = УчитыватьЗаказ["ЗаказИзШапки"];
		Запрос.УстановитьПараметр("ДокументРезерва"      , ДокументРезерва);
		УчитыватьЗаказ.Свойство("ВидРегистраПлюсСвободныйОстаток", ВидРегистраПлюсСвободныйОстаток);
	КонецЕсли;

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		ТоварыВРезервеНаСкладах.Номенклатура               КАК Номенклатура,
	|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ЗНАЧЕНИЕ(Справочник.Качество.Новый)                КАК Качество,
	|		ТоварыВРезервеНаСкладах.КоличествоОстаток          КАК КоличествоОстаток
	|ПОМЕСТИТЬ ТоварыВРезервеНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мУсловиеНоменклатураСклад + ") КАК ТоварыВРезервеНаСкладах
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		ТоварыКПередачеСоСкладов.Номенклатура               КАК Номенклатура,
	|		ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ТоварыКПередачеСоСкладов.Качество                   КАК Качество,
	|		ТоварыКПередачеСоСкладов.КоличествоОстаток          КАК КоличествоОстаток
	|ПОМЕСТИТЬ ТоварыКПередачеСоСкладов
	|ИЗ
	|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мУсловиеНоменклатураСклад + ТекстУсловияКачества + ") КАК ТоварыКПередачеСоСкладов
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры, Качество
	|";
	Запрос.Выполнить();

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		ОстаткиОрганизации.Номенклатура               КАК Номенклатура,
	|		ОстаткиОрганизации.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ОстаткиОрганизации.Качество                   КАК Качество,
	|		ОстаткиОрганизации.КоличествоОстаток          КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиОрганизации
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мУсловиеНоменклатураСкладОрганизация + ТекстУсловияКачества + ") КАК ОстаткиОрганизации
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры, Качество
	|";
	Запрос.Выполнить();

	Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладах.Номенклатура                                КАК Номенклатура,
	|	ТоварыНаСкладах.ХарактеристикаНоменклатуры                  КАК ХарактеристикаНоменклатуры,
	|	ТоварыНаСкладах.Качество                                    КАК Качество,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладах.КоличествоОстаток, 0.0)
	|	      - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0.00)
	|	      - ЕСТЬNULL(ТоварыКПередачеСоСкладов.КоличествоОстаток, 0.00)
	|" + ?(НЕ СтруктураЗаказов = Неопределено, " + ЕСТЬNULL(ТоварыВРезерве.КоличествоОстаток, 0.00)", "") + "
	|		)                                                       КАК КоличествоСвободныйОстаток,
	|	СУММА(ЕСТЬNULL(ОстаткиОрганизации.КоличествоОстаток, 0.00)) КАК КоличествоОстатокОрганизации
	
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		ОбщиеОстатки.Номенклатура               КАК Номенклатура,
	|		ОбщиеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ОбщиеОстатки.Качество                   КАК Качество,
	|		СУММА(ОбщиеОстатки.КоличествоОстаток)   КАК КоличествоОстаток
	|	ИЗ
	|	(";
	Текст = Текст + ПолучитьСтрокуЗапросаСвободныеОстатки(Новый Структура(РегистрыОстатков), ТекстУсловияКачества, Истина);
	Текст = Текст + "
	|	) КАК ОбщиеОстатки
	|	СГРУППИРОВАТЬ ПО
	|		ОбщиеОстатки.Номенклатура,
	|		ОбщиеОстатки.ХарактеристикаНоменклатуры,
	|		ОбщиеОстатки.Качество
	|) КАК ТоварыНаСкладах";
	
	Если НЕ СтруктураЗаказов = Неопределено Тогда
		Если ЗаказИзШапки Тогда
			Если ВидРегистраПлюсСвободныйОстаток = "ТоварыВРезервеНаСкладах" Тогда
				Текст = Текст +"
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мУсловиеНоменклатураСклад + " И ДокументРезерва = &ДокументРезерва) КАК ТоварыВРезерве
				|ПО ТоварыВРезерве.Номенклатура = ТоварыНаСкладах.Номенклатура
				|	И ТоварыВРезерве.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
				|	И ЗНАЧЕНИЕ(Справочник.Качество.Новый) = ТоварыНаСкладах.Качество
				|";
			ИначеЕсли ВидРегистраПлюсСвободныйОстаток = "ТоварыКПередачеСоСкладов" Тогда
				Текст = Текст +"
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мУсловиеНоменклатураСклад + " И ДокументПередачи = &ДокументРезерва) КАК ТоварыВРезерве
				|ПО ТоварыВРезерве.Номенклатура = ТоварыНаСкладах.Номенклатура
				|	И ТоварыВРезерве.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
				|	И ТоварыВРезерве.Качество = ТоварыНаСкладах.Качество
				|";
			КонецЕсли;
		Иначе
			//временная таблица товаров в резерве
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТоварыВРезервеНаСкладах.Номенклатура               КАК Номенклатура,
			|	ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ЗНАЧЕНИЕ(Справочник.Качество.Новый)                КАК Качество,
			|	СУММА(ТоварыВРезервеНаСкладах.КоличествоОстаток)   КАК КоличествоОстаток
			|ПОМЕСТИТЬ ТоварыВРезерве
			|ИЗ
			|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мУсловиеНоменклатураСклад + ") КАК ТоварыВРезервеНаСкладах
			|ЛЕВОЕ СОЕДИНЕНИЕ
			///////////////////////////////////////////////////////////
			|	ЗаказыТаблицаНоменклатура КАК ЗаказаноПоДокументуЗаказ
			///////////////////////////////////////////////////////////
			|ПО
			|	ЗаказаноПоДокументуЗаказ.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
			|	И ЗаказаноПоДокументуЗаказ.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
			|	И ЗаказаноПоДокументуЗаказ.ДокументРезерва = ТоварыВРезервеНаСкладах.ДокументРезерва
			|ГДЕ
			|	НЕ ЗаказаноПоДокументуЗаказ.ДокументРезерва ЕСТЬ NULL
			|	ИЛИ ТоварыВРезервеНаСкладах.ДокументРезерва = &ДокументРезерва
			|СГРУППИРОВАТЬ ПО ТоварыВРезервеНаСкладах.Номенклатура, ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
			|ИНДЕКСИРОВАТЬ ПО ТоварыВРезервеНаСкладах.Номенклатура, ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
			|";
			Запрос.Выполнить();

			Текст = Текст +"
			|ЛЕВОЕ СОЕДИНЕНИЕ
			//временная таблица товаров в резерве
			|	ТоварыВРезерве КАК ТоварыВРезерве
			//
			|ПО
			|	ТоварыВРезерве.Номенклатура = ТоварыНаСкладах.Номенклатура
			|	И ТоварыВРезерве.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
			|	И ТоварыВРезерве.Качество = ТоварыНаСкладах.Качество
			|";
		КонецЕсли;
	КонецЕсли;

	Текст = Текст +"
	|ЛЕВОЕ СОЕДИНЕНИЕ
	/////////////////////////////////////////////////////////
	|	ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
	/////////////////////////////////////////////////////////
	|ПО
	|	ТоварыВРезервеНаСкладах.Номенклатура = ТоварыНаСкладах.Номенклатура
	|	И ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	И ТоварыВРезервеНаСкладах.Качество = ТоварыНаСкладах.Качество
	|ЛЕВОЕ СОЕДИНЕНИЕ
	////////////////////////////////////////////////////////////
	|	ТоварыКПередачеСоСкладов КАК ТоварыКПередачеСоСкладов
	////////////////////////////////////////////////////////////
	|ПО
	|	ТоварыКПередачеСоСкладов.Номенклатура = ТоварыНаСкладах.Номенклатура
	|	И ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	И ТоварыКПередачеСоСкладов.Качество = ТоварыНаСкладах.Качество
	|ЛЕВОЕ СОЕДИНЕНИЕ
	////////////////////////////////////////////////
	|	ОстаткиОрганизации КАК ОстаткиОрганизации
	////////////////////////////////////////////////
	|ПО
	|	ОстаткиОрганизации.Номенклатура = ТоварыНаСкладах.Номенклатура
	|	И ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	И ОстаткиОрганизации.Качество = ТоварыНаСкладах.Качество
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладах.Номенклатура,
	|	ТоварыНаСкладах.ХарактеристикаНоменклатуры,
	|	ТоварыНаСкладах.Качество
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры, Качество
	|";
	Запрос.Текст = Текст;
	Запрос.Выполнить();

КонецПроцедуры // ВременнаяТаблицаОстаткиНоменклатуры()

//Процедура формирует структуру для запроса к остаткам характеристик при выборе номенклатуры
Процедура СтруктураЗапросаОстаткиНоменклатурыСХарактеристиками(ДатаЗапроса, СписокПараметровЗапроса, ПоказыватьОстатки, РазворачиватьДоКачества) Экспорт
	Перем Склад, Организация, ДокументРезерва, ЗаказИзШапки, СтруктураЗаказов, ВидРегистраПлюсСвободныйОстаток;

	//Текст и параметры запроса при выборе номенклатуры с характеристиками остатки
	СтруктураОстаткиПриВыбореНоменклатуры = Неопределено;
	СтруктураОстаткиПриВыбореНоменклатуры = Новый Структура();

	СтруктураОстаткиПриВыбореНоменклатуры.Вставить("ПоказыватьОстатки", ПоказыватьОстатки);
	Если НЕ ПоказыватьОстатки["ПоказыватьОстатки"] Тогда
		возврат;
	КонецЕсли;

	Если ТипЗнч(СписокПараметровЗапроса) = Тип("СписокЗначений") Тогда
		Склад = СписокПараметровЗапроса.НайтиПоЗначению ("Склад");
		Организация = СписокПараметровЗапроса.НайтиПоЗначению ("Организация");
		СтруктураИсходныхПараметров.Свойство(?(Склад = Неопределено,"НетСклада",Склад.Значение),Склад);
		СтруктураИсходныхПараметров.Свойство(?(Организация = Неопределено,"НетОрганизации",Организация.Значение),Организация);
	ИначеЕсли ТипЗнч(СписокПараметровЗапроса) = Тип("Структура") Тогда
		СписокПараметровЗапроса.Свойство("Склад",Склад);
		СписокПараметровЗапроса.Свойство("Организация",Организация);
	КонецЕсли;
	//Если УчитыватьЗаказ["СтруктураЗаказов"] равен Неопределено значит в запросе не нужно считать по заказам в резерве
	//иначе нужно считать заказы в резерве
	УчитыватьЗаказ = ПолучитьСтруктуруЗаказовВРезерве();
	УчитыватьЗаказ.Свойство("ДокументРезерва",ДокументРезерва);
	СтруктураЗаказов = УчитыватьЗаказ["СтруктураЗаказов"];
	ЗаказИзШапки = УчитыватьЗаказ["ЗаказИзШапки"];
	УчитыватьЗаказ.Свойство("ВидРегистраПлюсСвободныйОстаток", ВидРегистраПлюсСвободныйОстаток);

	СтруктураПараметровЗапроса = Новый Структура();
	СтруктураПараметровЗапроса.Вставить("Дата"                   , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
	СтруктураПараметровЗапроса.Вставить("Склад"                  , Склад);
	СтруктураПараметровЗапроса.Вставить("Организация"            , Организация);
	СтруктураПараметровЗапроса.Вставить("ДокументРезерва"        , ДокументРезерва);
	СтруктураПараметровЗапроса.Вставить("РазворачиватьДоКачества", РазворачиватьДоКачества);

	ТекстУсловияКачества = " И ВЫБОР КОГДА &РазворачиватьДоКачества ТОГДА ИСТИНА ИНАЧЕ Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый) КОНЕЦ";

	текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладах.ХарактеристикаНоменклатуры                  КАК ХарактеристикаНоменклатуры,
	|	ТоварыНаСкладах.Качество                                    КАК Качество,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладах.КоличествоОстаток, 0.00)
	|	      - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0.00)
	|	      - ЕСТЬNULL(ТоварыКПередачеСоСкладов.КоличествоОстаток, 0.00)
	|	      " + ?(СтруктураЗаказов = Неопределено,"","+ ЕСТЬNULL(ТоварыВРезерве.КоличествоОстаток, 0.00)") + ") КАК КоличествоСвободныйОстаток,
	|	СУММА(ЕСТЬNULL(ОстаткиОрганизации.КоличествоОстаток, 0.00)) КАК КоличествоОстатокОрганизации
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОбщиеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ОбщиеОстатки.Качество                   КАК Качество,
	|		СУММА(ОбщиеОстатки.КоличествоОстаток)   КАК КоличествоОстаток
	|	ИЗ
	|		(";
	текст = текст + ПолучитьСтрокуЗапросаСвободныеОстатки(Новый Структура("ТоварыНаСкладах,ТоварыВРознице,ТоварыОрганизаций,ТоварыВНТТ"), ТекстУсловияКачества, Ложь);
	текст = текст + "
	|		) КАК ОбщиеОстатки
	|		
	|	СГРУППИРОВАТЬ ПО
	|		ОбщиеОстатки.ХарактеристикаНоменклатуры,
	|		ОбщиеОстатки.Качество
	|	) КАК ТоварыНаСкладах
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мУсловиеНоменклатураСклад + ") КАК ТоварыВРезервеНаСкладах
	|ПО
	|	ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	И ТоварыНаСкладах.Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)";
	Если НЕ СтруктураЗаказов = Неопределено Тогда
		Если ЗаказИзШапки Тогда
			Если ВидРегистраПлюсСвободныйОстаток = "ТоварыВРезервеНаСкладах" Тогда
				текст = текст +"
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мУсловиеНоменклатураСклад + " И ДокументРезерва = &ДокументРезерва) КАК ТоварыВРезерве
				|ПО ТоварыВРезерве.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
				|	И ТоварыНаСкладах.Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)
				|";
			ИначеЕсли ВидРегистраПлюсСвободныйОстаток = "ТоварыКПередачеСоСкладов" Тогда
				Текст = Текст +"
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мУсловиеНоменклатураСклад + " И ДокументПередачи = &ДокументРезерва) КАК ТоварыВРезерве
				|ПО ТоварыВРезерве.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
				|	И ТоварыВРезерве.Качество = ТоварыНаСкладах.Качество
				|";
			КонецЕсли;
		Иначе
			текст = текст + "
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|(
			|	ВЫБРАТЬ
			|		ТоварыВРезервеНаСкладах.Номенклатура               КАК Номенклатура,
			|		ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|		СУММА(ТоварыВРезервеНаСкладах.КоличествоОстаток)   КАК КоличествоОстаток
			|	ИЗ
			|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Дата, " + мУсловиеНоменклатураСклад + ") КАК ТоварыВРезервеНаСкладах
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			//
			|		ЗаказыТаблицаНоменклатура КАК ЗаказаноПоДокументуЗаказ
			//
			|	ПО
			|		ЗаказаноПоДокументуЗаказ.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
			|		И ЗаказаноПоДокументуЗаказ.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
			|		И ЗаказаноПоДокументуЗаказ.ДокументРезерва = ТоварыВРезервеНаСкладах.ДокументРезерва
			|	ГДЕ
			|		НЕ ЗаказаноПоДокументуЗаказ.ДокументРезерва ЕСТЬ NULL
			|		ИЛИ ТоварыВРезервеНаСкладах.ДокументРезерва = &ДокументРезерва
			|	СГРУППИРОВАТЬ ПО ТоварыВРезервеНаСкладах.Номенклатура, ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры
			|) КАК ТоварыВРезерве
			|ПО ТоварыВРезерве.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
			|	И ТоварыНаСкладах.Качество = ЗНАЧЕНИЕ(Справочник.Качество.Новый)
			|";
		КонецЕсли;
	КонецЕсли;
	текст = текст +"
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&Дата, " + мУсловиеНоменклатураСклад + ТекстУсловияКачества + ") КАК ТоварыКПередачеСоСкладов
	|ПО
	|	ТоварыКПередачеСоСкладов.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	И ТоварыКПередачеСоСкладов.Качество = ТоварыНаСкладах.Качество
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(&Дата, " + мУсловиеНоменклатураСкладОрганизация + ТекстУсловияКачества + ") КАК ОстаткиОрганизации
	|ПО
	|	ОстаткиОрганизации.ХарактеристикаНоменклатуры = ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|	И ОстаткиОрганизации.Качество = ТоварыНаСкладах.Качество
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладах.ХарактеристикаНоменклатуры,
	|	ТоварыНаСкладах.Качество
	|ИНДЕКСИРОВАТЬ ПО ТоварыНаСкладах.ХарактеристикаНоменклатуры
	|";
	
	СтруктураОстаткиПриВыбореНоменклатуры.Вставить("ТекстЗапроса",текст);
	СтруктураОстаткиПриВыбореНоменклатуры.Вставить("СтруктураПараметровЗапроса", СтруктураПараметровЗапроса);
	СтруктураОстаткиПриВыбореНоменклатуры.Вставить("ПоказыватьОстатки", ПоказыватьОстатки);

КонецПроцедуры

//Функция вернет структуру для расчета заказов в резерве
Функция ПолучитьСтруктуруЗаказовВРезерве() Экспорт
	СтруктураЗаказов = Неопределено;
	ЗаказИзШапки = Ложь;
	ДокументРезерва = Неопределено;
	ВидРегистраПлюсСвободныйОстаток = "";
	
	Если СтруктураИсходныхПараметров.Свойство("ВременныеТаблицы") И СтруктураИсходныхПараметров.ВременныеТаблицы.Свойство("ДокументРеализацияТоваровИУслуг")Тогда
		СтруктураЗаказов = СтруктураИсходныхПараметров.ВременныеТаблицы.ДокументРеализацияТоваровИУслуг;
	КонецЕсли;
	
	Если НЕ СтруктураЗаказов = Неопределено Тогда
		ДокументРезерва = Неопределено;
		СтруктураИсходныхПараметров.Свойство("Сделка", ДокументРезерва);
		Если ДокументРезерва = Неопределено Тогда
			СтруктураИсходныхПараметров.Свойство("Заказ", ДокументРезерва);
		КонецЕсли;

		ЗаказИзШапки = Неопределено;
		
		СтруктураЗаказов.Свойство("ЗаказИзШапки", ЗаказИзШапки);
		СтруктураЗаказов.Свойство("ВидРегистраПлюсСвободныйОстаток", ВидРегистраПлюсСвободныйОстаток);
		ЗаказИзШапки = ?(ЗаказИзШапки = Неопределено, Истина, ЗаказИзШапки);
	КонецЕсли;
	УчитыватьЗаказ = Новый Структура;
	УчитыватьЗаказ.Вставить("СтруктураЗаказов", СтруктураЗаказов);
	УчитыватьЗаказ.Вставить("ЗаказИзШапки", ЗаказИзШапки);
	УчитыватьЗаказ.Вставить("ДокументРезерва", ДокументРезерва);
	УчитыватьЗаказ.Вставить("ВидРегистраПлюсСвободныйОстаток", ВидРегистраПлюсСвободныйОстаток);
	возврат УчитыватьЗаказ;
КонецФункции

// Функция получает ведется учет товаров отганизации в разрезе складов
Процедура ПолучитьУчетнуюПолитикуВРазрезеСкладов(ПолучитьНаДату) Экспорт
	Если УчетнаяПолитикаПоСкладу = Неопределено Тогда
		УчетнаяПолитикаПоСкладу = Ложь;
		УчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(ПолучитьНаДату);
		УчетнаяПолитикаПоСкладу = УчетнаяПолитика.ВестиУчетТоваровОрганизацийВРазрезеСкладов;
	КонецЕсли;
КонецПроцедуры

//Процедура создает временную таблицу
Процедура СоздатьВременнуюТаблицу(Запрос, ВременныеТаблицы) Экспорт
	//Параметры "Запрос"	- запрос в котором нужно добавить временную таблицу
	//ИсточникЗначений 		- Структура на основе чего будет создана временная таблица
	
	ЗапросСозданиеВременнойТаблицы = Новый Запрос;
	МенеджерВТ = ?(Запрос.МенеджерВременныхТаблиц = Неопределено, Новый МенеджерВременныхТаблиц(), Запрос.МенеджерВременныхТаблиц);
	ЗапросСозданиеВременнойТаблицы.МенеджерВременныхТаблиц = МенеджерВТ;
	Для Каждого ЭлементСтруктуры Из ВременныеТаблицы Цикл
		Индексировать        = Неопределено;
		ИсточникЗначений     = ЭлементСтруктуры.Значение;
		ТаблицаИсходыеДанные = Неопределено;
		ИсточникЗначений.Свойство("ТаблицаИсточник",ТаблицаИсходыеДанные);
		ИсточникЗначений.Свойство("Индексировать", Индексировать);
		
		ЗапросСозданиеВременнойТаблицы.УстановитьПараметр("ТаблицаИсточник",ТаблицаИсходыеДанные);
		
		строкаПоля = "";
		Для Каждого ПолеВременнойТаблицы Из ИсточникЗначений["СтруктураВременнойТаблицы"] Цикл
			строкаПоля = строкаПоля + ",  " + ПолеВременнойТаблицы.Ключ
		КонецЦикла;
		строкаПоля = Сред(строкаПоля,2,СтрДлина(строкаПоля));
		Текст = "
		|ВЫБРАТЬ " + строкаПоля + "
		|ПОМЕСТИТЬ "+ ИсточникЗначений["ИмяВременнойТаблицы"] +"
		|ИЗ
		|	&ТаблицаИсточник КАК Таблица
		|";
		ЗапросСозданиеВременнойТаблицы.Текст = текст + ?(Индексировать = Неопределено, "", "ИНДЕКСИРОВАТЬ ПО " + строкаПоля);
		ЗапросСозданиеВременнойТаблицы.Выполнить();
	КонецЦикла;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
Конецпроцедуры

// Функция формирует список имен параметров для подстановки значений в запросы
//
// Параметры
//  ИмяПодбора - строка, имя подбора, по которому определяется запрос
//
// Возвращаемое значение:
//   СписокЗначений
//
Функция ПолучитьСписокПараметровЗапроса(ИмяПодбора) Экспорт

	СписокЗначенийВозврата = Новый СписокЗначений;

	Если ИмяПодбора = "ПриходЦеныКонтрагента"
	 ИЛИ ИмяПодбора = "ПриходНоменклатураКонтрагента"
	 ИЛИ ИмяПодбора = "РасходЦеныНоменклатуры"
	 ИЛИ ИмяПодбора = "РасходОстаткиИЦеныНоменклатуры"
	 ИЛИ ИмяПодбора = "ВозвратПоставщикуЦеныКонтрагентаИОстатки"
	 ИЛИ ИмяПодбора = "ВозвратПоставщикуЦеныКонтрагентаИОстаткиНТТ"
	 ИЛИ ИмяПодбора = "ВозвратПоставщикуНоменклатураКонтрагентаИОстатки"
	 ИЛИ ИмяПодбора = "ВозвратПоставщикуНоменклатураКонтрагентаИОстаткиНТТ"
	 ИЛИ ИмяПодбора = "РасходЦеныПлановойСебестоимостиНоменклатуры" Тогда

		СписокЗначенийВозврата.Добавить("ТипЦен");
		СписокЗначенийВозврата.Добавить("Контрагент");
		СписокЗначенийВозврата.Добавить("Организация");
		СписокЗначенийВозврата.Добавить("Склад");
		СписокЗначенийВозврата.Добавить("ДоговорКонтрагента");

	ИначеЕсли ИмяПодбора = "ОстаткиУКомиссионеров"
		  ИЛИ ИмяПодбора = "ОстаткиТоваровКомитентов" Тогда

		СписокЗначенийВозврата.Добавить("ТипЦен");
		СписокЗначенийВозврата.Добавить("Контрагент");
		СписокЗначенийВозврата.Добавить("ДоговорКонтрагента");

	ИначеЕсли ИмяПодбора = "ОстаткиНоменклатуры" Тогда

		СписокЗначенийВозврата.Добавить("Организация");
		СписокЗначенийВозврата.Добавить("Склад");

	ИначеЕсли ИмяПодбора = "ОстаткиНТТ" Тогда

		СписокЗначенийВозврата.Добавить("Склад");
	
	ИначеЕсли ИмяПодбора = "РасходЦеныУслуг"
		ИЛИ ИмяПодбора = "ПриходЦеныУслуг" Тогда

		СписокЗначенийВозврата.Добавить("ТипЦен");
		СписокЗначенийВозврата.Добавить("ДоговорКонтрагента");
		СписокЗначенийВозврата.Добавить("Контрагент");

	ИначеЕсли ИмяПодбора = "ПриходНоменклатураКонтрагентаБезЦенИОстатков" Тогда

		СписокЗначенийВозврата.Добавить("Контрагент");

	ИначеЕсли ИмяПодбора = "ЛимитПокупателю"
		  ИЛИ ИмяПодбора = "ЛимитПоставщика" Тогда

		СписокЗначенийВозврата.Добавить("ДоговорКонтрагента");
	ИначеЕсли ИмяПодбора = "РасходОстаткиЦеныРозничнаяТочка"
			  ИЛИ ИмяПодбора = "РасходЦеныРозничнаяТочка"
			  ИЛИ ИмяПодбора = "ОстаткиНоменклатурыВРознице" Тогда
		
		СписокЗначенийВозврата.Добавить("ВалютаДокумента");
		СписокЗначенийВозврата.Добавить("Склад");
		СписокЗначенийВозврата.Добавить("Организация");
		
	КонецЕсли;

	Возврат СписокЗначенийВозврата;

КонецФункции

//Функция формирует текст запроса по ИмяПодбора = "ОстаткиНоменклатурыВРознице"
Функция ЗапросОстаткиНоменклатурыВРознице(Запрос)
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ПредсталениеНоменклатуры                 КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ПредставлениеХарактеристики              КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Качество                                 КАК Качество,
	|	Подбор.Качество.Представление                   КАК ПредставлениеКачество,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	НоменклатураХарактеристика.ХарактеристикаНоменклатуры    КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(НоменклатураХарактеристика.Представление, """") КАК ПредставлениеХарактеристики,
	|	ЕСТЬNULL(НоменклатураХарактеристика.НаименованиеХарактеристики, """")  КАК НаименованиеХарактеристики,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков           КАК ЕдиницаИзмерения,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СправочникНоменклатура.Представление                     КАК ПредсталениеНоменклатуры,
	|	СправочникНоменклатура.Наименование                      КАК НаименованиеНоменклатуры,
	|	СправочникНоменклатура.НоменклатурнаяГруппа              КАК НоменклатурнаяГруппа,
	|	ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00)       КАК КоличествоСвободныйОстаток,
	|	ЕСТЬNULL(Остатки.КоличествоОстатокОрганизации, 0.00)     КАК КоличествоОстатокОрганизации,
	|	Остатки.Качество                                 КАК     Качество
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	// временная таблица номенклатура, характеристика
	|	НоменклатураХарактеристика КАК НоменклатураХарактеристика
	//
	|ПО СправочникНоменклатура.Ссылка = НоменклатураХарактеристика.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица остатков номенклатуры
	|	Остатки КАК Остатки
	//
	|ПО
	|	Остатки.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И Остатки.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|
	|ГДЕ СправочникНоменклатура.Родитель = &Родитель И (СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор ИЛИ СправочникНоменклатура.Комплект
	|	ИЛИ ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00) > 0)
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры,
	|	Подбор.НаименованиеХарактеристики
	|";

	ВременнаяТаблицаНоменклатураХарактеристика(Запрос);
	ВременнаяТаблицаОстаткиНоменклатуры(Запрос, "ТоварыВРознице,ТоварыОрганизаций");

	Возврат ТекстЗапроса;
	
КонецФункции //ЗапросОстаткиНоменклатурыВРознице()

//Функция формирует текст запроса по ИмяПодбора = "РасходОстаткиЦеныРозничнаяТочка"
Функция ЗапросРасходВРозницеЦеныОстатки(Запрос, УсловиеУчитыватьОстатки)

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)    КАК ПроцентНаценки,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Качество                                 КАК Качество,
	|	Подбор.Качество.Представление                   КАК ПредставлениеКачество,
	|	Подбор.ПредставлениеНоменклатуры                КАК ПредставлениеНоменклатура,
	|	ВЫБОР	КОГДА Подбор.Цена ЕСТЬ NULL ИЛИ Подбор.ЭтоГруппа ТОГДА """"
	|			ИНАЧЕ Подбор.ЕдиницаИзмерения.Представление
	|			КОНЕЦ                                   КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ПредставлениеХарактеристики              КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                              КАК Код,
	|	СправочникНоменклатура.Артикул                          КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                        КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                  КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                            КАК Набор,
	|	СправочникНоменклатура.Услуга                           КАК Услуга,
	|	СправочникНоменклатура.Ссылка                           КАК Номенклатура,
	|	НоменклатураХарактеристика.ХарактеристикаНоменклатуры	КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена), 0.00) КАК Цена,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			Иначе &ВалютаДокумента
	|	КОНЕЦ                                                    КАК Валюта,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков           КАК ЕдиницаИзмерения,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СправочникНоменклатура.НоменклатурнаяГруппа              КАК НоменклатурнаяГруппа,
	|	СправочникНоменклатура.ЦеноваяГруппа                     КАК ЦеноваяГруппа,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков           КАК ЕдиницаХраненияОстатков,
	|	СправочникНоменклатура.Представление                     КАК ПредставлениеНоменклатуры,
	|	СправочникНоменклатура.Наименование                      КАК НаименованиеНоменклатуры,
	|	ЕСТЬNULL(НоменклатураХарактеристика.Представление, """") КАК ПредставлениеХарактеристики,
	|	ЕСТЬNULL(НоменклатураХарактеристика.НаименованиеХарактеристики, """") КАК НаименованиеХарактеристики,
	|	ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00)       КАК КоличествоСвободныйОстаток,
	|	ЕСТЬNULL(Остатки.КоличествоОстатокОрганизации, 0.00)     КАК КоличествоОстатокОрганизации,
	|	Остатки.Качество                                         КАК Качество
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица номенклатура, характеристика
	|	НоменклатураХарактеристика КАК НоменклатураХарактеристика
	//
	|ПО СправочникНоменклатура.Ссылка = НоменклатураХарактеристика.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	// временная таблица цен номенклатуры
	|	ЦеныСрезПоследних КАК ЦеныСрезПоследних
	//
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И ЦеныСрезПоследних.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	// временная таблица цен номенклатуры
	|	ЦеныСрезПоследних КАК ЦеныСрезПоследнихПустаяХарактеристика
	//
	|ПО
	|	ЦеныСрезПоследнихПустаяХарактеристика.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И ЦеныСрезПоследнихПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица остатки номенклатуры
	|	Остатки КАК Остатки
	//
	|ПО
	|	Остатки.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И Остатки.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|
	|ГДЕ СправочникНоменклатура.Родитель = &Родитель И
	|	(СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор ИЛИ СправочникНоменклатура.Комплект
	|	ИЛИ
	|	ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена), 0.00) > 0
	|	И ВЫБОР КОГДА &ПодбиратьУслуги ТОГДА ИСТИНА ИНАЧЕ НЕ СправочникНоменклатура.Услуга КОНЕЦ" + ?(УсловиеУчитыватьОстатки, " И ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00) > 0 ИЛИ ВЫБОР КОГДА &ПодбиратьУслуги ТОГДА СправочникНоменклатура.Услуга ИНАЧЕ Ложь КОНЕЦ", "") + ")
	|) КАК Подбор
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица условия продаж
	|	УсловияПродаж КАК УсловияПродаж
	//
	|ПО
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.ЦеноваяГруппа
	|	ИЛИ
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры,
	|	Подбор.НаименованиеХарактеристики
	|";

	// временная таблица цен номенклатуры
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура               КАК Номенклатура,
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныСрезПоследних.Цена КАК                   Цена
	|ПОМЕСТИТЬ ЦеныСрезПоследних
	|ИЗ
	|	РегистрСведений.ЦеныАТТ.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатураСклад + ") КАК ЦеныСрезПоследних
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();

	ВременнаяТаблицаНоменклатураХарактеристика(Запрос);
	ВременнаяТаблицаОстаткиНоменклатуры(Запрос, "ТоварыВРознице,ТоварыОрганизаций");
	ВременнаяТаблицаУсловияПродаж(Запрос);

	Возврат ТекстЗапроса;
	
КонецФункции //ЗапросРасходВРозницеЦеныОстатки()

// Функция формирует текст запроса по ИмяПодбора = "ПриходЦеныКонтрагента" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросПриходЦеныКонтрагента(Запрос)

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоСвободныйОстаток
	|		  ИНАЧЕ Подбор.КоличествоСвободныйОстаток * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоСвободныйОстаток,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоОстатокОрганизации
	|		  ИНАЧЕ Подбор.КоличествоОстатокОрганизации * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоОстатокОрганизации,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоЗаказанное
	|		  ИНАЧЕ Подбор.КоличествоЗаказанное * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоЗаказанное,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.Цена * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  ИНАЧЕ Подбор.Цена
	|		  КОНЕЦ                                     КАК Цена,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ТОГДА NULL
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)    КАК ПроцентНаценки,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Качество                                 КАК Качество,
	|	Подбор.Качество.Представление                   КАК ПредставлениеКачество,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.ПредставлениеНоменклатура                КАК ПредставлениеНоменклатура,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ИЛИ Подбор.ЭтоГруппа ТОГДА """"
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков.Представление
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения.Представление
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ПредставлениеХарактеристикаНоменклатуры  КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                            КАК Код,
	|	СправочникНоменклатура.Артикул                        КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                      КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                          КАК Набор,
	|	СправочникНоменклатура.Услуга                         КАК Услуга,
	|	СправочникНоменклатура.Ссылка                         КАК Номенклатура,
	|	СправочникНоменклатура.Представление                  КАК ПредставлениеНоменклатура,
	|	СправочникНоменклатура.Наименование                   КАК НаименованиеНоменклатуры,
	|	СправочникНоменклатура.Родитель                       КАК Родитель,
	|	СправочникНоменклатура.ЦеноваяГруппа                  КАК ЦеноваяГруппа,
	|	СправочникНоменклатура.НоменклатурнаяГруппа           КАК НоменклатурнаяГруппа,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков        КАК ЕдиницаХраненияОстатков,
	|	ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00)    КАК КоличествоСвободныйОстаток,
	|	ЕСТЬNULL(Остатки.КоличествоОстатокОрганизации, 0.00)  КАК КоличествоОстатокОрганизации,
	|	Остатки.Качество                                      КАК Качество,
	|	ЕСТЬNULL(Заказано.КоличествоЗаказанное, 0.00)         КАК КоличествоЗаказанное,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена)
	|			ИНАЧЕ ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена)
	|	КОНЕЦ                                                 КАК Цена,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.ЕдиницаИзмерения, ЦеныСрезПоследнихПустаяХарактеристика.ЕдиницаИзмерения), СправочникНоменклатура.ЕдиницаХраненияОстатков)
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ЕдиницаИзмерения), СправочникНоменклатура.ЕдиницаХраненияОстатков)
	|	КОНЕЦ                                                 КАК ЕдиницаИзмерения,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Валюта, ЦеныСрезПоследнихПустаяХарактеристика.Валюта), ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ВалютаЦены), ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|	КОНЕЦ                                                 КАК Валюта,
	|	НоменклатураХарактеристика.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	НоменклатураХарактеристика.Представление              КАК ПредставлениеХарактеристикаНоменклатуры,
	|	НоменклатураХарактеристика.НаименованиеХарактеристики КАК НаименованиеХарактеристики,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА NULL
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента, """") КАК Строка(100))
	|	КОНЕЦ                                                 КАК НаименованиеНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА NULL
	|			ИНАЧЕ ЕСТЬNULL(НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента, """")
	|	КОНЕЦ                                                 КАК АртикулНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|	КОНЕЦ                                                 КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//Временная таблица номенклатура характеристика
	|	НоменклатураХарактеристика КАК НоменклатураХарактеристика
	|ПО
	|	НоменклатураХарактеристика.Номенклатура = СправочникНоменклатура.Ссылка
	//
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И ЦеныСрезПоследних.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследнихПустаяХарактеристика
	|ПО
	|	ЦеныСрезПоследнихПустаяХарактеристика.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И ЦеныСрезПоследнихПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица остатки номенклатуры
	|	Остатки КАК Остатки
	//
	|ПО
	|	Остатки.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И Остатки.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица номенклатура заказана
	|	Заказано КАК Заказано
	//
	|ПО
	|	Заказано.Номенклатура = Остатки.Номенклатура
	|	И Заказано.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	|	И Заказано.Качество = Остатки.Качество
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица номенклатура контрагентов
	|	НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	//
	|ПО
	|	НоменклатураКонтрагентов.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И НоменклатураКонтрагентов.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|
	|ГДЕ СправочникНоменклатура.Родитель = &Родитель И
	|	(СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор ИЛИ
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена), 0.00)
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00)
	|	КОНЕЦ > 0 И ВЫБОР КОГДА &ПодбиратьУслуги ТОГДА ИСТИНА ИНАЧЕ НЕ СправочникНоменклатура.Услуга КОНЕЦ)
	|) КАК Подбор
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица условия продаж
	|	УсловияПродаж КАК УсловияПродаж
	//
	|ПО
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.ЦеноваяГруппа
	|	ИЛИ
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры,
	|	Подбор.НаименованиеХарактеристики
	|";

	ВременнаяТаблицаНоменклатураХарактеристика(Запрос);
	ВременнаяТаблицаНоменклатураКонтрагента(Запрос);
	ВременнаяТаблицаОстаткиНоменклатуры(Запрос, "ТоварыНаСкладах,ТоварыВРознице,ТоварыОрганизаций");
	ВременнаяТаблицаУсловияПродаж(Запрос);

	//временная таблица номенклатура заказана
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикам.Номенклатура               КАК Номенклатура,
	|	ЗаказыПоставщикам.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.Качество.Новый)          КАК Качество,
	|	СУММА(ЗаказыПоставщикам.КоличествоОстаток
	|	      - ЕСТЬNULL(ТоварыРазмещенные.КоличествоОстаток, 0.00)) КАК КоличествоЗаказанное
	|ПОМЕСТИТЬ Заказано
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата, " + мУсловиеНоменклатура + ") КАК ЗаказыПоставщикам
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&Дата, " + мУсловиеНоменклатура + ") КАК ТоварыРазмещенные
	|ПО
	|	ЗаказыПоставщикам.Номенклатура = ТоварыРазмещенные.Номенклатура
	|	И ЗаказыПоставщикам.ХарактеристикаНоменклатуры = ТоварыРазмещенные.ХарактеристикаНоменклатуры
	|	И ЗаказыПоставщикам.ЗаказПоставщику = ТоварыРазмещенные.ЗаказПоставщику
	|СГРУППИРОВАТЬ ПО ЗаказыПоставщикам.Номенклатура, ЗаказыПоставщикам.ХарактеристикаНоменклатуры
	|ИНДЕКСИРОВАТЬ ПО ЗаказыПоставщикам.Номенклатура, ЗаказыПоставщикам.ХарактеристикаНоменклатуры, Качество
	|";
	Запрос.Выполнить();

	Возврат ТекстЗапроса;

КонецФункции // ЗапросПриходЦеныКонтрагента()

// Функция формирует текст запроса по ИмяПодбора = "ПриходНоменклатураКонтрагента" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросПриходНоменклатураКонтрагента(Запрос, РегистрыОстатков)
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены ИЛИ Подбор.ЕдиницаИзмерения ЕСТЬ NULL)
	|		  ТОГДА Подбор.КоличествоСвободныйОстаток
	|		  ИНАЧЕ Подбор.КоличествоСвободныйОстаток * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоСвободныйОстаток,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены ИЛИ Подбор.ЕдиницаИзмерения ЕСТЬ NULL)
	|		  ТОГДА Подбор.КоличествоОстатокОрганизации
	|		  ИНАЧЕ Подбор.КоличествоОстатокОрганизации * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоОстатокОрганизации,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены ИЛИ Подбор.ЕдиницаИзмерения ЕСТЬ NULL)
	|		  ТОГДА Подбор.КоличествоЗаказанное
	|		  ИНАЧЕ Подбор.КоличествоЗаказанное * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоЗаказанное,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.Цена * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  ИНАЧЕ Подбор.Цена
	|		  КОНЕЦ                                     КАК Цена,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL
	|		  ТОГДА Подбор.ЕдиницаИзмерения
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)    КАК ПроцентНаценки,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Качество                                 КАК Качество,
	|	Подбор.Качество.Представление                   КАК ПредставлениеКачество,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.ПредставлениеНоменклатуры                КАК ПредставлениеНоменклатура,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ИЛИ Подбор.ЭтоГруппа 
	|		  ТОГДА ЕСТЬNULL(Подбор.ЕдиницаИзмерения.Представление, """")
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков.Представление
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения.Представление
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ПредставлениеХарактеристики              КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                                      КАК Код,
	|	СправочникНоменклатура.Артикул                                  КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                                КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                          КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                                    КАК Набор,
	|	СправочникНоменклатура.Услуга                                   КАК Услуга,
	|	СправочникНоменклатура.Номенклатура                             КАК Номенклатура,
	|	СправочникНоменклатура.ПредставлениеНоменклатуры                КАК ПредставлениеНоменклатуры,
	|	СправочникНоменклатура.НаименованиеНоменклатуры                 КАК НаименованиеНоменклатуры,
	|	СправочникНоменклатура.Родитель                                 КАК Родитель,
	|	СправочникНоменклатура.ЦеноваяГруппа                            КАК ЦеноваяГруппа,
	|	СправочникНоменклатура.НоменклатурнаяГруппа                     КАК НоменклатурнаяГруппа,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков                  КАК ЕдиницаХраненияОстатков,
	|	ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00)              КАК КоличествоСвободныйОстаток,
	|	ЕСТЬNULL(Остатки.КоличествоОстатокОрганизации, 0.00)            КАК КоличествоОстатокОрганизации,
	|	Остатки.Качество                                                КАК Качество,
	|	ЕСТЬNULL(Заказано.КоличествоЗаказанное, 0.00)                   КАК КоличествоЗаказанное,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена)
	|			ИНАЧЕ ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена)
	|	КОНЕЦ                                                           КАК Цена,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.ЕдиницаИзмерения, ЦеныСрезПоследнихПустаяХарактеристика.ЕдиницаИзмерения), СправочникНоменклатура.ЕдиницаХраненияОстатков)
	|			ИНАЧЕ ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ЕдиницаИзмерения)
	|	КОНЕЦ                                                           КАК ЕдиницаИзмерения,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЦеныСрезПоследних.Валюта, ЦеныСрезПоследнихПустаяХарактеристика.Валюта)
	|			ИНАЧЕ ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ВалютаЦены)
	|	КОНЕЦ                                                           КАК Валюта,
	|	СправочникНоменклатура.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	СправочникНоменклатура.ПредставлениеХарактеристики              КАК ПредставлениеХарактеристики,
	|	СправочникНоменклатура.НаименованиеХарактеристики               КАК НаименованиеХарактеристики,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА NULL
	|			ИНАЧЕ ВЫРАЗИТЬ(СправочникНоменклатура.НаименованиеНоменклатурыКонтрагента КАК Строка(100)) 
	|	КОНЕЦ                                                           КАК НаименованиеНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА NULL
	|			ИНАЧЕ СправочникНоменклатура.АртикулНоменклатурыКонтрагента
	|	КОНЕЦ                                                           КАК АртикулНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|	КОНЕЦ                                                           КАК ФлагУсловийПоставки
	|ИЗ
	|(ВЫБРАТЬ
	|			СправочникНоменклатура.Ссылка                                        КАК Номенклатура,
	|			СправочникНоменклатура.Представление                                 КАК ПредставлениеНоменклатуры,
	|			СправочникНоменклатура.Наименование                                  КАК НаименованиеНоменклатуры,
	|			СправочникНоменклатура.Код                                           КАК Код,
	|			СправочникНоменклатура.Артикул                                       КАК Артикул,
	|			СправочникНоменклатура.ЭтоГруппа                                     КАК ЭтоГруппа,
	|			СправочникНоменклатура.ПометкаУдаления                               КАК ПометкаУдаления,
	|			СправочникНоменклатура.Набор                                         КАК Набор,
	|			СправочникНоменклатура.Услуга                                        КАК Услуга,
	|			СправочникНоменклатура.Родитель                                      КАК Родитель,
	|			СправочникНоменклатура.Комплект                                      КАК Комплект,
	|			СправочникНоменклатура.ЕдиницаХраненияОстатков                       КАК ЕдиницаХраненияОстатков,
	|			СправочникНоменклатура.ЦеноваяГруппа                                 КАК ЦеноваяГруппа,
	|			СправочникНоменклатура.НоменклатурнаяГруппа                          КАК НоменклатурнаяГруппа,
	|			НоменклатураКонтрагентов.ХарактеристикаНоменклатуры                  КАК ХарактеристикаНоменклатуры,
	|			ЕСТЬNULL(НоменклатураКонтрагентов.ПредставлениеХарактеристики, """") КАК ПредставлениеХарактеристики,
	|			ЕСТЬNULL(НоменклатураКонтрагентов.НаименованиеХарактеристики, """")  КАК НаименованиеХарактеристики,
	|			НоменклатураКонтрагентов.Контрагент                                  КАК Контрагент,
	|			НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента         КАК НаименованиеНоменклатурыКонтрагента,
	|			НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента              КАК АртикулНоменклатурыКонтрагента
	|	ИЗ
	|		Справочник.Номенклатура КАК СправочникНоменклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	// временная таблица номенклатура контрагента
	|		НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	//
	|	ПО
	|		СправочникНоменклатура.Ссылка = НоменклатураКонтрагентов.Номенклатура
	|	ГДЕ
	|		НЕ НоменклатураКонтрагентов.Номенклатура ЕСТЬ NULL
	|		И НоменклатураКонтрагентов.Контрагент = &Контрагент
	|		И СправочникНоменклатура.Родитель = &Родитель
	|		И ВЫБОР КОГДА &ПодбиратьУслуги ТОГДА ИСТИНА ИНАЧЕ НЕ СправочникНоменклатура.Услуга КОНЕЦ
	|		ИЛИ
	|		СправочникНоменклатура.Родитель = &Родитель
	|		И (СправочникНоменклатура.ЭтоГруппа
	|			ИЛИ СправочникНоменклатура.Набор
	|			ИЛИ СправочникНоменклатура.Комплект)
	|) КАК СправочникНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Номенклатура
	|	И ЦеныСрезПоследних.ХарактеристикаНоменклатуры = СправочникНоменклатура.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследнихПустаяХарактеристика
	|ПО
	|	ЦеныСрезПоследнихПустаяХарактеристика.Номенклатура = СправочникНоменклатура.Номенклатура
	|	И ЦеныСрезПоследнихПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица остатки номенклатуры
	|	Остатки КАК Остатки
	//
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Номенклатура
	|	И Остатки.ХарактеристикаНоменклатуры = СправочникНоменклатура.ХарактеристикаНоменклатуры
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица заказана номенклаутра
	|	Заказано КАК Заказано
	//
	|ПО
	|	Заказано.Номенклатура = Остатки.Номенклатура
	|	И Заказано.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	|	И Заказано.Качество = Остатки.Качество
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = СправочникНоменклатура.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Номенклатура = СправочникНоменклатура.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|
	|) КАК Подбор
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица условия продаж
	|	УсловияПродаж КАК УсловияПродаж
	//
	|ПО
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.ЦеноваяГруппа
	|	ИЛИ
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры,
	|	Подбор.НаименованиеХарактеристики
	|";

	ВременнаяТаблицаОстаткиНоменклатуры(Запрос, РегистрыОстатков);
	ВременнаяТаблицаНоменклатураКонтрагента(Запрос);
	ВременнаяТаблицаУсловияПродаж(Запрос);

	//временная таблица номенклаутра заказана
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		ЗаказыПоставщикам.Номенклатура                                 КАК Номенклатура,
	|		ЗаказыПоставщикам.ХарактеристикаНоменклатуры                   КАК ХарактеристикаНоменклатуры,
	|		ЗНАЧЕНИЕ(Справочник.Качество.Новый)                            КАК Качество,
	|		СУММА(	ЗаказыПоставщикам.КоличествоОстаток
	|				- ЕСТЬNULL(ТоварыРазмещенные.КоличествоОстаток, 0.00)) КАК КоличествоЗаказанное
	|ПОМЕСТИТЬ Заказано
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата, " + мУсловиеНоменклатура + ") КАК ЗаказыПоставщикам
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&Дата, " + мУсловиеНоменклатура + ") КАК ТоварыРазмещенные
	|ПО
	|	ЗаказыПоставщикам.Номенклатура = ТоварыРазмещенные.Номенклатура
	|	И ЗаказыПоставщикам.ХарактеристикаНоменклатуры = ТоварыРазмещенные.ХарактеристикаНоменклатуры
	|	И ЗаказыПоставщикам.ЗаказПоставщику = ТоварыРазмещенные.ЗаказПоставщику
	|
	|СГРУППИРОВАТЬ ПО ЗаказыПоставщикам.Номенклатура, ЗаказыПоставщикам.ХарактеристикаНоменклатуры
	|ИНДЕКСИРОВАТЬ ПО ЗаказыПоставщикам.Номенклатура, ЗаказыПоставщикам.ХарактеристикаНоменклатуры, Качество
	|";
	Запрос.Выполнить();

	Возврат ТекстЗапроса;

КонецФункции // ЗапросПриходНоменклатураКонтрагента()

// Функция формирует текст запроса по ИмяПодбора = "ПриходНоменклатураКонтрагентаБезЦенИОстатков" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросПриходНоменклатураКонтрагентаБезЦенИОстатков(Запрос)

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ПредставлениеХарактеристикаНоменклатуры  КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.ПредставлениеНоменклатуры                КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                                           КАК Код,
	|	СправочникНоменклатура.Артикул                                       КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                                     КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                               КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                                         КАК Набор,
	|	СправочникНоменклатура.Услуга                                        КАК Услуга,
	|	СправочникНоменклатура.Ссылка                                        КАК Номенклатура,
	|	СправочникНоменклатура.Представление                                 КАК ПредставлениеНоменклатуры,
	|	СправочникНоменклатура.Наименование                                  КАК НаименованиеНоменклатуры,
	|	ЕСТЬNULL(НоменклатураКонтрагентов.ПредставлениеХарактеристики, """") КАК ПредставлениеХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(НоменклатураКонтрагентов.НаименованиеХарактеристики, """")  КАК НаименованиеХарактеристики,
	|	НоменклатураКонтрагентов.ХарактеристикаНоменклатуры                  КАК ХарактеристикаНоменклатуры,
	|	СправочникНоменклатура.НоменклатурнаяГруппа                          КАК НоменклатурнаяГруппа,
	|	СправочникНоменклатура.Родитель                                      КАК Родитель,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL
	|			ИНАЧЕ ВЫРАЗИТЬ(НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента КАК Строка(100)) 
	|	КОНЕЦ                                                                КАК НаименованиеНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА NULL
	|			ИНАЧЕ НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента
	|	КОНЕЦ                                                                КАК АртикулНоменклатурыКонтрагента,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков                       КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица номенклатура контрагента
	|	НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	//
	|ПО
	|	НоменклатураКонтрагентов.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	СправочникНоменклатура.Родитель = &Родитель
	|			И (НЕ НоменклатураКонтрагентов.Номенклатура ЕСТЬ NULL И ВЫБОР КОГДА &ПодбиратьУслуги ТОГДА ИСТИНА ИНАЧЕ НЕ СправочникНоменклатура.Услуга КОНЕЦ ИЛИ СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор ИЛИ СправочникНоменклатура.Комплект)
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры,
	|	Подбор.НаименованиеХарактеристики
	|";
	
	ВременнаяТаблицаНоменклатураКонтрагента(Запрос);
	
	Возврат ТекстЗапроса;

КонецФункции // ЗапросПриходНоменклатураКонтрагентаБезЦенИОстатков()

// Функция формирует текст запроса по ИмяПодбора = "РасходЦеныНоменклатуры" 
// и "РасходЦеныПлановойСебестоимостиНоменклатуры"
// и "РасходОстаткиИЦеныНоменклатуры" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросРасходОстаткиИЦеныНоменклатуры(Запрос, Организация, ВидПодбора)

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоСвободныйОстаток
	|		  ИНАЧЕ Подбор.КоличествоСвободныйОстаток * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоСвободныйОстаток,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоОстатокОрганизации
	|		  ИНАЧЕ Подбор.КоличествоОстатокОрганизации * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоОстатокОрганизации,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.Цена * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  ИНАЧЕ Подбор.Цена
	|		  КОНЕЦ                                     КАК Цена,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ТОГДА NULL
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)    КАК ПроцентНаценки,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Качество                                 КАК Качество,
	|	Подбор.Качество.Представление                   КАК ПредставлениеКачество,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.ПредставлениеНоменклатуры                КАК ПредставлениеНоменклатура,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ИЛИ Подбор.ЭтоГруппа ТОГДА """"
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков.Представление
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения.Представление
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ПредставлениеХарактеристики              КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                                      КАК Код,
	|	СправочникНоменклатура.Артикул                                  КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                                КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                          КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                                    КАК Набор,
	|	СправочникНоменклатура.Услуга                                   КАК Услуга,
	|	СправочникНоменклатура.Ссылка                                   КАК Номенклатура,
	|	СправочникНоменклатура.Представление                            КАК ПредставлениеНоменклатуры,
	|	СправочникНоменклатура.Наименование                             КАК НаименованиеНоменклатуры,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков                  КАК ЕдиницаХраненияОстатков,
	|	СправочникНоменклатура.НоменклатурнаяГруппа                     КАК НоменклатурнаяГруппа,
	|	СправочникНоменклатура.ЦеноваяГруппа                            КАК ЦеноваяГруппа,
	|	НоменклатураХарактеристика.ХарактеристикаНоменклатуры           КАК ХарактеристикаНоменклатуры,
	|	НоменклатураХарактеристика.Представление                        КАК ПредставлениеХарактеристики,
	|	НоменклатураХарактеристика.НаименованиеХарактеристики           КАК НаименованиеХарактеристики,
	|	ЕСТЬNULL(Цены.Цена, 0.00)                                       КАК Цена,
	|	Цены.Валюта                                                     КАК Валюта,
	|	Цены.ЕдиницаИзмерения                                           КАК ЕдиницаИзмерения,
	|	Цены.ФлагУсловийПоставки                                        КАК ФлагУсловийПоставки,
	|	СправочникНоменклатура.Родитель                                 КАК Родитель,
	|	ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00)              КАК КоличествоСвободныйОстаток,
	|	ЕСТЬNULL(Остатки.КоличествоОстатокОрганизации, 0.00)            КАК КоличествоОстатокОрганизации,
	|	ВЫБОР	КОГДА СправочникНоменклатура.Набор
	|					ИЛИ СправочникНоменклатура.Услуга
	|					ИЛИ СправочникНоменклатура.ЭтоГруппа
	|					ИЛИ СправочникНоменклатура.Комплект
	|			ТОГДА NULL
	|			ИНАЧЕ ЕСТЬNULL(Остатки.Качество, ЗНАЧЕНИЕ(Справочник.Качество.Новый))
	|	КОНЕЦ                                                           КАК Качество
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица с номенклатурой и характеристикой
	|	НоменклатураХарактеристика КАК НоменклатураХарактеристика
	//
	|ПО СправочникНоменклатура.Ссылка = НоменклатураХарактеристика.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица остатков номенклатуры
	|	Остатки КАК Остатки
	//
	|ПО
	|	Остатки.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И Остатки.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица цен номенклатуры
	|	Цены КАК Цены
	//
	|ПО
	|	Цены.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И Цены.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|
	|ГДЕ СправочникНоменклатура.Родитель = &Родитель И
	|" + ?(ВидПодбора = "РасходОстаткиИЦеныНоменклатуры"
		//Условие для вида подбора "РасходОстаткиИЦеныНоменклатуры"
		, "(СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор ИЛИ ВЫБОР КОГДА &ПодбиратьУслуги ТОГДА СправочникНоменклатура.Услуга ИНАЧЕ Ложь КОНЕЦ
	|		ИЛИ
	|		(ЕСТЬNULL(Цены.Цена, 0.00) > 0
	|		И (ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00) > 0" +?(УправлениеДопПравамиПользователей.РазрешеноПревышениеОстаткаТоваровОрганизации(Организация),""," И ЕСТЬNULL(Остатки.КоличествоОстатокОрганизации, 0.00) > 0") + "))
	|		ИЛИ СправочникНоменклатура.Комплект И ЕСТЬNULL(Цены.Цена, 0.00) > 0)"
		//Условие для вида подбора "РасходЦеныНоменклатуры" и "РасходЦеныПлановойСебестоимостиНоменклатуры"
		, "(СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор
	|		ИЛИ ЕСТЬNULL(Цены.Цена, 0.00) > 0 И ВЫБОР КОГДА &ПодбиратьУслуги ТОГДА ИСТИНА ИНАЧЕ НЕ СправочникНоменклатура.Услуга КОНЕЦ)"
		) + "
	|) КАК Подбор
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица условия продаж
	|	УсловияПродаж КАК УсловияПродаж
	//
	|ПО
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.ЦеноваяГруппа
	|	ИЛИ
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.НоменклатурнаяГруппа
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры,
	|	Подбор.НаименованиеХарактеристики
	|";

	ВременнаяТаблицаНоменклатураХарактеристика(Запрос);
	ВременнаяТаблицаЦен(Запрос);
	ВременнаяТаблицаОстаткиНоменклатуры(Запрос, "ТоварыНаСкладах,ТоварыВРознице,ТоварыОрганизаций");
	ВременнаяТаблицаУсловияПродаж(Запрос);

	Возврат ТекстЗапроса;

КонецФункции // ЗапросРасходОстаткиИЦеныНоменклатуры()

// Функция формирует текст запроса по ИмяПодбора = "ОстаткиНоменклатуры" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросОстаткиНоменклатуры(Запрос, Организация)

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Номенклатура.Код                         КАК Код,
	|	Подбор.Номенклатура.Артикул                     КАК Артикул,
	|	Подбор.Номенклатура.ЭтоГруппа                   КАК ЭтоГруппа,
	|	Подбор.Номенклатура.ПометкаУдаления             КАК ПометкаУдаления,
	|	Подбор.Номенклатура.Набор                       КАК Набор,
	|	Подбор.Номенклатура.Услуга                      КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Номенклатура.Родитель                    КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.КоличествоОстатокОрганизации             КАК КоличествоОстатокОрганизации,
	|	Подбор.Номенклатура.ЕдиницаХраненияОстатков     КАК ЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Качество                                 КАК Качество,
	|	Подбор.Качество.Представление                   КАК ПредставлениеКачество,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА Подбор.Номенклатура.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоСвободныйОстаток)                КАК КоличествоСвободныйОстаток,
	|	СУММА(Остатки.КоличествоОстатокОрганизации)              КАК КоличествоОстатокОрганизации,
	|	Остатки.ХарактеристикаНоменклатуры                       КАК ХарактеристикаНоменклатуры,
	|	Остатки.Качество                                         КАК Качество
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица остатки номенклатуры
	|	Остатки КАК Остатки
	//
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор ИЛИ СправочникНоменклатура.Комплект)
	|	ИЛИ
	|	(ВЫБОР КОГДА &ПодбиратьУслуги ТОГДА СправочникНоменклатура.Услуга ИНАЧЕ Ложь КОНЕЦ)
	|	ИЛИ
	|	(Остатки.КоличествоСвободныйОстаток > 0"+?(УправлениеДопПравамиПользователей.РазрешеноПревышениеОстаткаТоваровОрганизации(Организация),""," И Остатки.КоличествоОстатокОрганизации > 0")+"))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.Качество
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.Номенклатура.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование,
	|	Подбор.ХарактеристикаНоменклатуры.Наименование
	|";

	ВременнаяТаблицаОстаткиНоменклатуры(Запрос, "ТоварыНаСкладах,ТоварыВРознице,ТоварыОрганизаций");
	Возврат ТекстЗапроса;

КонецФункции // ЗапросОстаткиНоменклатуры()

// Функция формирует текст запроса по ИмяПодбора = "ВозвратПоставщикуЦеныКонтрагентаИОстаткиНТТ" или "ВозвратПоставщикуЦеныКонтрагентаИОстатки" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросВозвратПоставщикуЦеныКонтрагентаИОстатки(Запрос, РегистрыОстатков)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоСвободныйОстаток
	|		  ИНАЧЕ Подбор.КоличествоСвободныйОстаток * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоСвободныйОстаток,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоОстатокОрганизации
	|		  ИНАЧЕ Подбор.КоличествоОстатокОрганизации * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоОстатокОрганизации,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.Цена * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  ИНАЧЕ Подбор.Цена
	|		  КОНЕЦ                                     КАК Цена,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ТОГДА NULL
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)    КАК ПроцентНаценки,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Качество                                 КАК Качество,
	|	Подбор.Качество.Представление                   КАК ПредставлениеКачество,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.ПредставлениеНоменклатуры                КАК ПредставлениеНоменклатура,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ИЛИ Подбор.ЭтоГруппа 
	|		  ТОГДА Подбор.ЕдиницаИзмерения
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков.Представление
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения.Представление
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ПредставлениеХарактеристики              КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00)       КАК КоличествоСвободныйОстаток,
	|	ЕСТЬNULL(Остатки.КоличествоОстатокОрганизации, 0.00)     КАК КоличествоОстатокОрганизации,
	|	Остатки.Качество                                         КАК Качество,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена), 0.00)
	|			ИНАЧЕ ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена)
	|	КОНЕЦ                                                    КАК Цена,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.ЕдиницаИзмерения, ЦеныСрезПоследнихПустаяХарактеристика.ЕдиницаИзмерения), СправочникНоменклатура.ЕдиницаХраненияОстатков)
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ЕдиницаИзмерения), СправочникНоменклатура.ЕдиницаХраненияОстатков)
	|	КОНЕЦ                                                    КАК ЕдиницаИзмерения,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Валюта, ЦеныСрезПоследнихПустаяХарактеристика.Валюта), ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ВалютаЦены), ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|	КОНЕЦ                                                    КАК Валюта,
	|	НоменклатураХарактеристика.ХарактеристикаНоменклатуры    КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА NULL
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента, """") КАК Строка(100))
	|	КОНЕЦ                                                    КАК НаименованиеНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА NULL
	|			ИНАЧЕ ЕСТЬNULL(НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента, """")
	|	КОНЕЦ                                                    КАК АртикулНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|	КОНЕЦ                                                    КАК ФлагУсловийПоставки,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков           КАК ЕдиницаХраненияОстатков,
	|	СправочникНоменклатура.Представление                     КАК ПредставлениеНоменклатуры,
	|	СправочникНоменклатура.Наименование                      КАК НаименованиеНоменклатуры,
	|	ЕСТЬNULL(НоменклатураХарактеристика.Представление, """") КАК ПредставлениеХарактеристики,
	|	ЕСТЬNULL(НоменклатураХарактеристика.НаименованиеХарактеристики, """") КАК НаименованиеХарактеристики,
	|	СправочникНоменклатура.НоменклатурнаяГруппа              КАК НоменклатурнаяГруппа,
	|	СправочникНоменклатура.ЦеноваяГруппа                     КАК ЦеноваяГруппа
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//Временная таблица номенклатура характеристика
	|	НоменклатураХарактеристика КАК НоменклатураХарактеристика
	|ПО
	|	НоменклатураХарактеристика.Номенклатура = СправочникНоменклатура.Ссылка
	//
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И ЦеныСрезПоследних.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследнихПустаяХарактеристика
	|ПО
	|	ЦеныСрезПоследнихПустаяХарактеристика.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И ЦеныСрезПоследнихПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица остатки номенклатуры
	|	Остатки КАК Остатки
	//
	|ПО
	|	Остатки.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И Остатки.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица номенлатура контрагентов
	|	НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	//
	|ПО
	|	НоменклатураКонтрагентов.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И НоменклатураКонтрагентов.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|
	|ГДЕ
	|	СправочникНоменклатура.Родитель = &Родитель И (СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор
	|	ИЛИ
	|	(ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена), 0.00)
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00)
	|	КОНЕЦ > 0 И ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00) > 0 "+?(УправлениеДопПравамиПользователей.РазрешеноПревышениеОстаткаТоваровОрганизации(),""," И ЕСТЬNULL(Остатки.КоличествоОстатокОрганизации, 0.00) > 0")+"
	|	)
	|	ИЛИ
	|	(ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена), 0.00)
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00)
	|	КОНЕЦ > 0 И СправочникНоменклатура.Комплект))
	|) КАК Подбор
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица условия продаж
	|	УсловияПродаж КАК УсловияПродаж
	//
	|ПО
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.ЦеноваяГруппа
	|	ИЛИ
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры,
	|	Подбор.НаименованиеХарактеристики
	|";

	ВременнаяТаблицаНоменклатураХарактеристика(Запрос);
	ВременнаяТаблицаОстаткиНоменклатуры(Запрос, РегистрыОстатков);
	ВременнаяТаблицаНоменклатураКонтрагента(Запрос);
	ВременнаяТаблицаУсловияПродаж(Запрос);

	Возврат ТекстЗапроса;

КонецФункции // ЗапросВозвратПоставщикуЦеныКонтрагентаИОстатки()

// Функция формирует текст запроса по ИмяПодбора = "ВозвратПоставщикуНоменклатураКонтрагентаИОстатки" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросВозвратПоставщикуНоменклатураКонтрагентаИОстатки(Запрос, РегистрыОстатков)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоСвободныйОстаток
	|		  ИНАЧЕ Подбор.КоличествоСвободныйОстаток * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоСвободныйОстаток,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоОстатокОрганизации
	|		  ИНАЧЕ Подбор.КоличествоОстатокОрганизации * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоОстатокОрганизации,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.Цена * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  ИНАЧЕ Подбор.Цена
	|		  КОНЕЦ                                     КАК Цена,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL
	|		  ТОГДА Подбор.ЕдиницаИзмерения
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)    КАК ПроцентНаценки,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.Качество                                 КАК Качество,
	|	Подбор.Качество.Представление                   КАК ПредставлениеКачество,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.ПредставлениеНоменклатуры                КАК ПредставлениеНоменклатура,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ИЛИ Подбор.ЭтоГруппа 
	|		  ТОГДА ЕСТЬNULL(Подбор.ЕдиницаИзмерения.Представление, """")
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков.Представление
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения.Представление
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ПредставлениеХарактеристики              КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Номенклатура                      КАК Номенклатура,
	|	СправочникНоменклатура.ПредставлениеНоменклатуры         КАК ПредставлениеНоменклатуры,
	|	СправочникНоменклатура.НаименованиеНоменклатуры          КАК НаименованиеНоменклатуры,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СправочникНоменклатура.ЦеноваяГруппа                     КАК ЦеноваяГруппа,
	|	СправочникНоменклатура.НоменклатурнаяГруппа              КАК НоменклатурнаяГруппа,
	|	ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00)       КАК КоличествоСвободныйОстаток,
	|	ЕСТЬNULL(Остатки.КоличествоОстатокОрганизации, 0.00)     КАК КоличествоОстатокОрганизации,
	|	Остатки.Качество                                         КАК Качество,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена), 0.00)
	|			ИНАЧЕ ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена)
	|	КОНЕЦ                                                    КАК Цена,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.ЕдиницаИзмерения, ЦеныСрезПоследнихПустаяХарактеристика.ЕдиницаИзмерения), СправочникНоменклатура.ЕдиницаХраненияОстатков)
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ЕдиницаИзмерения), СправочникНоменклатура.ЕдиницаХраненияОстатков)
	|	КОНЕЦ                                                    КАК ЕдиницаИзмерения,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЦеныСрезПоследних.Валюта, ЦеныСрезПоследнихПустаяХарактеристика.Валюта)
	|			ИНАЧЕ ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ВалютаЦены)
	|	КОНЕЦ                                                    КАК Валюта,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков           КАК ЕдиницаХраненияОстатков,
	|	СправочникНоменклатура.ХарактеристикаНоменклатуры        КАК ХарактеристикаНоменклатуры,
	|	СправочникНоменклатура.ПредставлениеХарактеристики       КАК ПредставлениеХарактеристики,
	|	СправочникНоменклатура.НаименованиеХарактеристики        КАК НаименованиеХарактеристики,
	|	ВЫБОР	КОГДА СправочникНоменклатура.Номенклатура.ЭтоГруппа
	|			ТОГДА NULL
	|			ИНАЧЕ ВЫРАЗИТЬ(СправочникНоменклатура.НаименованиеНоменклатурыКонтрагента КАК Строка(100))
	|	КОНЕЦ                                                    КАК НаименованиеНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА NULL
	|			ИНАЧЕ СправочникНоменклатура.АртикулНоменклатурыКонтрагента
	|	КОНЕЦ                                                    КАК АртикулНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|	КОНЕЦ                                                    КАК ФлагУсловийПоставки
	|ИЗ
	|(ВЫБРАТЬ
	|			СправочникНоменклатура.Ссылка                                        КАК Номенклатура,
	|			СправочникНоменклатура.Представление                                 КАК ПредставлениеНоменклатуры,
	|			СправочникНоменклатура.Наименование                                  КАК НаименованиеНоменклатуры,
	|			СправочникНоменклатура.Код                                           КАК Код,
	|			СправочникНоменклатура.Артикул                                       КАК Артикул,
	|			СправочникНоменклатура.ЭтоГруппа                                     КАК ЭтоГруппа,
	|			СправочникНоменклатура.ПометкаУдаления                               КАК ПометкаУдаления,
	|			СправочникНоменклатура.Набор                                         КАК Набор,
	|			СправочникНоменклатура.Услуга                                        КАК Услуга,
	|			СправочникНоменклатура.Родитель                                      КАК Родитель,
	|			СправочникНоменклатура.Комплект                                      КАК Комплект,
	|			СправочникНоменклатура.ЕдиницаХраненияОстатков                       КАК ЕдиницаХраненияОстатков,
	|			СправочникНоменклатура.ЦеноваяГруппа                                 КАК ЦеноваяГруппа,
	|			СправочникНоменклатура.НоменклатурнаяГруппа                          КАК НоменклатурнаяГруппа,
	|			НоменклатураКонтрагентов.ХарактеристикаНоменклатуры                  КАК ХарактеристикаНоменклатуры,
	|			ЕСТЬNULL(НоменклатураКонтрагентов.ПредставлениеХарактеристики, """") КАК ПредставлениеХарактеристики,
	|			ЕСТЬNULL(НоменклатураКонтрагентов.НаименованиеХарактеристики, """")  КАК НаименованиеХарактеристики,
	|			НоменклатураКонтрагентов.Контрагент                                  КАК Контрагент,
	|			НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента         КАК НаименованиеНоменклатурыКонтрагента,
	|			НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента              КАК АртикулНоменклатурыКонтрагента
	|	ИЗ
	|		Справочник.Номенклатура КАК СправочникНоменклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	//Временная таблица номенклатура контрагентов
	|		НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	//
	|	ПО
	|		СправочникНоменклатура.Ссылка = НоменклатураКонтрагентов.Номенклатура
	|	ГДЕ
	|		НЕ НоменклатураКонтрагентов.Номенклатура ЕСТЬ NULL
	|		И НоменклатураКонтрагентов.Контрагент = &Контрагент
	|		И СправочникНоменклатура.Родитель = &Родитель
	|		ИЛИ
	|		СправочникНоменклатура.Родитель = &Родитель
	|		И (СправочникНоменклатура.ЭтоГруппа
	|			ИЛИ СправочникНоменклатура.Набор
	|			ИЛИ СправочникНоменклатура.Комплект)
	|) КАК СправочникНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица с остатками номенклатуры
	|	Остатки КАК Остатки
	//
	|ПО Остатки.Номенклатура = СправочникНоменклатура.Номенклатура
	|	И Остатки.ХарактеристикаНоменклатуры = СправочникНоменклатура.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО ЦеныСрезПоследних.Номенклатура = СправочникНоменклатура.Номенклатура
	|	И ЦеныСрезПоследних.ХарактеристикаНоменклатуры = СправочникНоменклатура.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследнихПустаяХарактеристика
	|ПО
	|	ЦеныСрезПоследнихПустаяХарактеристика.Номенклатура = СправочникНоменклатура.Номенклатура
	|	И ЦеныСрезПоследнихПустаяХарактеристика.ХарактеристикаНоменклатуры = &ПустаяХарактеристика
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = СправочникНоменклатура.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = СправочникНоменклатура.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Номенклатура = СправочникНоменклатура.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ХарактеристикаНоменклатуры = &ПустаяХарактеристика
	|ГДЕ
	|	
	|		(ЕСТЬNULL(Остатки.КоличествоСвободныйОстаток, 0.00) > 0"+ ?(УправлениеДопПравамиПользователей.РазрешеноПревышениеОстаткаТоваровОрганизации(),""," И ЕСТЬNULL(Остатки.КоличествоОстатокОрганизации, 0.00) > 0") + ")
	|		ИЛИ СправочникНоменклатура.ЭтоГруппа
	|		ИЛИ СправочникНоменклатура.Комплект
	|		ИЛИ СправочникНоменклатура.Набор
	|) КАК Подбор
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица условия продаж
	|	УсловияПродаж КАК УсловияПродаж
	//
	|ПО
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.ЦеноваяГруппа
	|	ИЛИ
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры,
	|	Подбор.НаименованиеХарактеристики
	|";

	ВременнаяТаблицаНоменклатураКонтрагента(Запрос);
	ВременнаяТаблицаОстаткиНоменклатуры(Запрос, РегистрыОстатков);
	ВременнаяТаблицаУсловияПродаж(Запрос);

	Возврат ТекстЗапроса;

КонецФункции // ЗапросВозвратПоставщикуНоменклатураКонтрагентаИОстатки()

// Функция формирует текст запроса по ИмяПодбора = "ОстаткиУКомиссионеров" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросОстаткиУКомиссионеров(Запрос)

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоСвободныйОстаток
	|		  ИНАЧЕ Подбор.КоличествоСвободныйОстаток * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоСвободныйОстаток,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.Цена * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  ИНАЧЕ Подбор.Цена
	|		  КОНЕЦ                                     КАК Цена,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ТОГДА NULL
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)    КАК ПроцентНаценки,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.ПредставлениеНоменклатуры                КАК ПредставлениеНоменклатура,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ИЛИ Подбор.ЭтоГруппа ТОГДА """"
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков.Представление
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения.Представление
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                     КАК Код,
	|	СправочникНоменклатура.Артикул                 КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа               КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления         КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                   КАК Набор,
	|	СправочникНоменклатура.Услуга                  КАК Услуга,
	|	СправочникНоменклатура.Ссылка                  КАК Номенклатура,
	|	СправочникНоменклатура.Представление           КАК ПредставлениеНоменклатуры,
	|	СправочникНоменклатура.Наименование            КАК НаименованиеНоменклатуры,
	|	СправочникНоменклатура.НоменклатурнаяГруппа    КАК НоменклатурнаяГруппа,
	|	СправочникНоменклатура.ЦеноваяГруппа           КАК ЦеноваяГруппа,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
	|	Остатки.ХарактеристикаНоменклатуры             КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(Цены.Цена, 0.00)                      КАК Цена,
	|	Цены.Валюта                                    КАК Валюта,
	|	ЕСТЬNULL(Цены.ЕдиницаИзмерения, СправочникНоменклатура.ЕдиницаХраненияОстатков) КАК ЕдиницаИзмерения,
	|	Цены.ФлагУсловийПоставки                       КАК ФлагУсловийПоставки,
	|	СправочникНоменклатура.Родитель                КАК Родитель,
	|	ЕСТЬNULL(Остатки.Количество, 0.00)             КАК КоличествоСвободныйОстаток
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица остатков номенклатуры
	|	Остатки КАК Остатки
	//
	|ПО Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица цен номенклатуры
	|	Цены КАК Цены
	//
	|ПО
	|	Цены.Номенклатура = Остатки.Номенклатура
	|	И
	|	Цены.ХарактеристикаНоменклатуры = Остатки.ХарактеристикаНоменклатуры
	|ГДЕ СправочникНоменклатура.Родитель = &Родитель И
	|	(СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор ИЛИ СправочникНоменклатура.Комплект
	|		ИЛИ ЕСТЬNULL(Остатки.Количество, 0.00) > 0)
	|) КАК Подбор
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица условия продаж
	|	УсловияПродаж КАК УсловияПродаж
	//
	|ПО
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.ЦеноваяГруппа
	|	ИЛИ
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры,
	|	Подбор.ХарактеристикаНоменклатуры.Наименование
	|";
	ВременнаяТаблицаНоменклатураХарактеристика(Запрос);
	ВременнаяТаблицаЦен(Запрос);
	ВременнаяТаблицаУсловияПродаж(Запрос);

	//временная таблица остатков номенклатуры
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		Количество
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		ТоварыПереданныеОстатки.Номенклатура               КАК Номенклатура,
	|		ТоварыПереданныеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(	ВЫБОР	КОГДА ЗаказыПокупателейОстатки.КоличествоОстаток ЕСТЬ NULL
	|						ТОГДА ТоварыПереданныеОстатки.КоличествоОстаток
	|						ИНАЧЕ (ТоварыПереданныеОстатки.КоличествоОстаток - ЗаказыПокупателейОстатки.КоличествоОстаток)
	|				КОНЕЦ)                                      КАК Количество
	|	ИЗ
	|		РегистрНакопления.ТоварыПереданные.Остатки(&Дата, " + мУсловиеНоменклатура + " И (ДоговорКонтрагента = &ДоговорКонтрагента И СтатусПередачи = &СтатусКомиссия)) КАК ТоварыПереданныеОстатки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(&Дата, " + мУсловиеНоменклатура + ") КАК ЗаказыПокупателейОстатки
	|	ПО
	|			ТоварыПереданныеОстатки.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
	|			И ТоварыПереданныеОстатки.ХарактеристикаНоменклатуры = ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры
	|			И ТоварыПереданныеОстатки.Сделка = ЗаказыПокупателейОстатки.ЗаказПокупателя
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыПереданныеОстатки.Номенклатура,
	|		ТоварыПереданныеОстатки.ХарактеристикаНоменклатуры
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|			СправочникНоменклатура.Ссылка                  КАК Номенклатура,
	|			ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|			0                                              КАК Количество
	|	ИЗ Справочник.Номенклатура КАК СправочникНоменклатура
	|	ГДЕ СправочникНоменклатура.Родитель = &Родитель И СправочникНоменклатура.ЭтоГруппа
	|) КАК Подзапрос
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();
	Возврат ТекстЗапроса;

КонецФункции // ЗапросОстаткиУКомиссионеров()

// Функция формирует текст запроса по ИмяПодбора = "ОстаткиТоваровКомитентов" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросОстаткиТоваровКомитентов(Запрос)

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.КоличествоСвободныйОстаток
	|		  ИНАЧЕ Подбор.КоличествоСвободныйОстаток * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  КОНЕЦ                                     КАК КоличествоСвободныйОстаток,
	|	ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		  ТОГДА Подбор.Цена * (Подбор.ЕдиницаХраненияОстатков.Коэффициент / Подбор.ЕдиницаИзмерения.Коэффициент)
	|		  ИНАЧЕ Подбор.Цена
	|		  КОНЕЦ                                     КАК Цена,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL
	|		  ТОГДА Подбор.ЕдиницаИзмерения
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)    КАК ПроцентНаценки,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.НаименованиеНоменклатурыКонтрагента      КАК НаименованиеНоменклатурыКонтрагента,
	|	Подбор.АртикулНоменклатурыКонтрагента           КАК АртикулНоменклатурыКонтрагента,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.ПредставлениеНоменклатура                КАК ПредставлениеНоменклатура,
	|	ВЫБОР КОГДА Подбор.Цена ЕСТЬ NULL ИЛИ Подбор.ЭтоГруппа 
	|		  ТОГДА ЕСТЬNULL(Подбор.ЕдиницаИзмерения.Представление, """")
	|		  ИНАЧЕ ВЫБОР КОГДА (Подбор.ЕдиницаХраненияОстатков = Подбор.ЕдиницаИзмерения ИЛИ НЕ &ПересчитатьОстаткиВЕдиницуЦены)
	|		              ТОГДА Подбор.ЕдиницаХраненияОстатков.Представление
	|		              ИНАЧЕ Подбор.ЕдиницаИзмерения.Представление
	|		        КОНЕЦ
	|		  КОНЕЦ                                     КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ПредставлениеХарактеристикаНоменклатуры  КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                                      КАК Код,
	|	СправочникНоменклатура.Артикул                                  КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                                КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                          КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                                    КАК Набор,
	|	СправочникНоменклатура.Услуга                                   КАК Услуга,
	|	СправочникНоменклатура.Ссылка                                   КАК Номенклатура,
	|	СправочникНоменклатура.Представление                            КАК ПредставлениеНоменклатура,
	|	СправочникНоменклатура.Наименование                             КАК НаименованиеНоменклатуры,
	|	СправочникНоменклатура.Родитель                                 КАК Родитель,
	|	СправочникНоменклатура.ЦеноваяГруппа                            КАК ЦеноваяГруппа,
	|	СправочникНоменклатура.НоменклатурнаяГруппа                     КАК НоменклатурнаяГруппа,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков                  КАК ЕдиницаХраненияОстатков,
	|	ЕСТЬNULL(Остатки.Количество, 0.00)                              КАК КоличествоСвободныйОстаток,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЦеныСрезПоследних.Цена, ЦеныСрезПоследнихПустаяХарактеристика.Цена)
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00)
	|	КОНЕЦ                                                КАК Цена,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.ЕдиницаИзмерения, ЦеныСрезПоследнихПустаяХарактеристика.ЕдиницаИзмерения), СправочникНоменклатура.ЕдиницаХраненияОстатков)
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ЕдиницаИзмерения), СправочникНоменклатура.ЕдиницаХраненияОстатков)
	|	КОНЕЦ                                                КАК ЕдиницаИзмерения,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСрезПоследних.Валюта, ЦеныСрезПоследнихПустаяХарактеристика.Валюта), ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ВалютаЦены), ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|	КОНЕЦ                                                           КАК Валюта,
	|	НоменклатураХарактеристика.ХарактеристикаНоменклатуры           КАК ХарактеристикаНоменклатуры,
	|	НоменклатураХарактеристика.Представление                        КАК ПредставлениеХарактеристикаНоменклатуры,
	|	НоменклатураХарактеристика.НаименованиеХарактеристики           КАК НаименованиеХарактеристики,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА NULL
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(НоменклатураКонтрагентов.НаименованиеНоменклатурыКонтрагента, """") КАК Строка(100))
	|	КОНЕЦ                                                           КАК НаименованиеНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА СправочникНоменклатура.ЭтоГруппа
	|			ТОГДА NULL
	|			ИНАЧЕ ЕСТЬNULL(НоменклатураКонтрагентов.АртикулНоменклатурыКонтрагента, """")
	|	КОНЕЦ                                                           КАК АртикулНоменклатурыКонтрагента,
	|	ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
	|			ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|	КОНЕЦ                                                           КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	//
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//Временная таблица номенклатура характеристика
	|	НоменклатураХарактеристика КАК НоменклатураХарактеристика
	//
	|ПО
	|	НоменклатураХарактеристика.Номенклатура = СправочникНоменклатура.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|ПО
	|	ЦеныСрезПоследних.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И ЦеныСрезПоследних.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, " + мУсловиеНоменклатура + " И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследнихПустаяХарактеристика
	|ПО
	|	ЦеныСрезПоследнихПустаяХарактеристика.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И ЦеныСрезПоследнихПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица остатки номенклатуры
	|	Остатки КАК Остатки
	//
	|ПО
	|	Остатки.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И Остатки.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица номенклатура контрагентов
	|	НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	//
	|ПО
	|	НоменклатураКонтрагентов.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И НоменклатураКонтрагентов.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика
	|ПО
	|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|
	|ГДЕ СправочникНоменклатура.Родитель = &Родитель И
	|	(СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор ИЛИ СправочникНоменклатура.Комплект
	|	ИЛИ ЕСТЬNULL(Остатки.Количество, 0.00) > 0)
	|) КАК Подбор
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица условия продаж
	|	УсловияПродаж КАК УсловияПродаж
	//
	|ПО
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.ЦеноваяГруппа
	|	ИЛИ
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры,
	|	Подбор.НаименованиеХарактеристики
	|";
	
	//временная таблица остатки номенклатуры
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыПолученныеОстатки.Номенклатура               КАК Номенклатура,
	|	ТоварыПолученныеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТоварыПолученныеОстатки.КоличествоОстаток          КАК Количество
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.ТоварыПолученные.Остатки(&Дата, " + мУсловиеНоменклатура + " И (ДоговорКонтрагента = &ДоговорКонтрагента И СтатусПолучения = &СтатусКомиссия) И ВЫБОР КОГДА &Сделка = Неопределено ТОГДА ИСТИНА ИНАЧЕ Сделка = &Сделка КОНЕЦ) КАК ТоварыПолученныеОстатки
	|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
	|";
	Запрос.Выполнить();
	ВременнаяТаблицаНоменклатураХарактеристика(Запрос);
	ВременнаяТаблицаНоменклатураКонтрагента(Запрос);
	ВременнаяТаблицаУсловияПродаж(Запрос);
	
	Возврат ТекстЗапроса;

КонецФункции // ЗапросОстаткиТоваровКомитентов()

// Функция формирует текст запроса по ИмяПодбора = "ОстаткиНТТ" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросОстаткиНТТ()

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Номенклатура.Код                         КАК Код,
	|	Подбор.Номенклатура.Артикул                     КАК Артикул,
	|	Подбор.Номенклатура.ЭтоГруппа                   КАК ЭтоГруппа,
	|	Подбор.Номенклатура.ПометкаУдаления             КАК ПометкаУдаления,
	|	Подбор.Номенклатура.Набор                       КАК Набор,
	|	Подбор.Номенклатура.Услуга                      КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.КоличествоСвободныйОстаток               КАК КоличествоСвободныйОстаток,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.Номенклатура.ЕдиницаХраненияОстатков     КАК ЕдиницаИзмерения,
	|	ВЫБОР	КОГДА Подбор.Номенклатура.ЭтоГруппа
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ИНАЧЕ Подбор.Валюта
	|	КОНЕЦ                                           КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ХарактеристикаНоменклатуры.Представление КАК ПредставлениеХарактеристикаНоменклатуры,
	|	ВЫБОР	КОГДА Подбор.Номенклатура.ЭтоГруппа
	|			ТОГДА """"
	|			ИНАЧЕ Подбор.Валюта.Представление
	|	КОНЕЦ                                           КАК ПредставлениеВалюта,
	|	ВЫБОР
	|		КОГДА Подбор.Номенклатура.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	СУММА(Остатки.КоличествоОстаток)                         КАК КоличествоСвободныйОстаток,
	|	Остатки.ЦенаВРознице                                     КАК Цена,
	|	&ВалютаРегламентированногоУчета                          КАК Валюта,
	|	Остатки.ХарактеристикаНоменклатуры                       КАК ХарактеристикаНоменклатуры,
	|	Ложь                                                     КАК ФлагУсловийПоставки
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыВНТТ.Остатки(&Дата, " + мУсловиеНоменклатураСклад + ") КАК Остатки
	|ПО
	|	Остатки.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ГДЕ
	|	СправочникНоменклатура.Родитель = &Родитель
	|	И
	|	((СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор ИЛИ СправочникНоменклатура.Комплект ИЛИ ВЫБОР КОГДА &ПодбиратьУслуги ТОГДА СправочникНоменклатура.Услуга ИНАЧЕ Ложь КОНЕЦ)
	|	ИЛИ
	|	(Остатки.КоличествоОстаток > 0))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка,
	|	Остатки.ХарактеристикаНоменклатуры,
	|	Остатки.ЦенаВРознице
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.Номенклатура.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование,
	|	Подбор.ХарактеристикаНоменклатуры.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросОстаткиНТТ()

// Функция формирует текст запроса по ИмяПодбора = "РасходУслуги" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросРасходУслуги()

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Код                                      КАК Код,
	|	СправочникНоменклатура.Артикул                                  КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                                КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                          КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                                    КАК Набор,
	|	СправочникНоменклатура.Услуга                                   КАК Услуга,
	|	СправочникНоменклатура.Ссылка                                   КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                                 КАК Родитель,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков                  КАК ЕдиницаИзмерения,
	|	СправочникНоменклатура.Представление                            КАК ПредставлениеНоменклатура,
	|	СправочникНоменклатура.ЕдиницаХраненияОстатков.Представление    КАК ПредставлениеЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА СправочникНоменклатура.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ СправочникНоменклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ГДЕ СправочникНоменклатура.Родитель = &Родитель И
	|	(СправочникНоменклатура.Услуга ИЛИ СправочникНоменклатура.ЭтоГруппа)
	|УПОРЯДОЧИТЬ ПО
	|	СправочникНоменклатура.ЭтоГруппа УБЫВ,
	|	СправочникНоменклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросРасходУслуги()

// Функция формирует текст запроса по ИмяПодбора = "РасходЦеныУслуг" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросЦеныУслуг(Запрос, ИмяПодбора)

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Код                                      КАК Код,
	|	Подбор.Артикул                                  КАК Артикул,
	|	Подбор.ЭтоГруппа                                КАК ЭтоГруппа,
	|	Подбор.ПометкаУдаления                          КАК ПометкаУдаления,
	|	Подбор.Набор                                    КАК Набор,
	|	Подбор.Услуга                                   КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.Цена                                     КАК Цена,
	|	Подбор.ЕдиницаИзмерения                         КАК ЕдиницаИзмерения,
	|	Подбор.Валюта                                   КАК Валюта,
	|	Подбор.ХарактеристикаНоменклатуры               КАК ХарактеристикаНоменклатуры,
	|	Подбор.ФлагУсловийПоставки                      КАК ФлагУсловийПоставки,
	|	Подбор.ПредставлениеНоменклатуры                КАК ПредставлениеНоменклатура,
	|	Подбор.ЕдиницаИзмерения.Представление           КАК ПредставлениеЕдиницаИзмерения,
	|	Подбор.ПредставлениеХарактеристики              КАК ПредставлениеХарактеристикаНоменклатуры,
	|	Подбор.Валюта.Представление                     КАК ПредставлениеВалюта,
	|	ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)    КАК ПроцентНаценки,
	|	ВЫБОР
	|		КОГДА Подбор.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Код                               КАК Код,
	|	СправочникНоменклатура.Артикул                           КАК Артикул,
	|	СправочникНоменклатура.ЭтоГруппа                         КАК ЭтоГруппа,
	|	СправочникНоменклатура.ПометкаУдаления                   КАК ПометкаУдаления,
	|	СправочникНоменклатура.Набор                             КАК Набор,
	|	СправочникНоменклатура.Услуга                            КАК Услуга,
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Представление                     КАК ПредставлениеНоменклатуры,
	|	СправочникНоменклатура.Наименование                      КАК НаименованиеНоменклатуры,
	|	СправочникНоменклатура.НоменклатурнаяГруппа              КАК НоменклатурнаяГруппа,
	|	СправочникНоменклатура.ЦеноваяГруппа                     КАК ЦеноваяГруппа,
	|	НоменклатураХарактеристика.ХарактеристикаНоменклатуры    КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(НоменклатураХарактеристика.Представление, """") КАК ПредставлениеХарактеристики,
	|	ЕСТЬNULL(Цены.Цена, 0.00)                                КАК Цена,
	|	Цены.Валюта                                              КАК Валюта,
	|	Цены.ЕдиницаИзмерения                                    КАК ЕдиницаИзмерения,
	|	Цены.ФлагУсловийПоставки                                 КАК ФлагУсловийПоставки,
	|	СправочникНоменклатура.Родитель                          КАК Родитель
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица с номенклатурой и характеристикой
	|	НоменклатураХарактеристика КАК НоменклатураХарактеристика
	//
	|ПО СправочникНоменклатура.Ссылка = НоменклатураХарактеристика.Номенклатура
	| ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица цен номенклатуры
	|	Цены КАК Цены
	//
	|ПО
	|	Цены.Номенклатура = НоменклатураХарактеристика.Номенклатура
	|	И Цены.ХарактеристикаНоменклатуры = НоменклатураХарактеристика.ХарактеристикаНоменклатуры
	|
	|ГДЕ СправочникНоменклатура.Родитель = &Родитель И
	|	(СправочникНоменклатура.ЭтоГруппа
	|		ИЛИ ЕСТЬNULL(Цены.Цена, 0.00) > 0 И СправочникНоменклатура.Услуга)
	|) КАК Подбор
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	//временная таблица условия продаж
	|	УсловияПродаж КАК УсловияПродаж
	//
	|ПО
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.ЦеноваяГруппа
	|	ИЛИ
	|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Подбор.НоменклатурнаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.ЭтоГруппа УБЫВ,
	|	Подбор.НаименованиеНоменклатуры
	|";

	ВременнаяТаблицаНоменклатураХарактеристика(Запрос);
	Если ИмяПодбора = "ПриходЦеныУслуг" Тогда
		ВременнаяТаблицаЦенКонтрагентов(Запрос);
	Иначе
		ВременнаяТаблицаЦен(Запрос);
	КонецЕсли;
	
	ВременнаяТаблицаУсловияПродаж(Запрос);

	Возврат ТекстЗапроса;

КонецФункции // ЗапросЦеныУслуг()

// Функция формирует текст запроса по ИмяПодбора = "ЛимитПокупателю" и "ЛимитПоставщика" для заполнения табличной части
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ЗапросЛимитПокупателю_ЛимитПоставщика(ИмяПодбора)

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подбор.Номенклатура.Код                         КАК Код,
	|	Подбор.Номенклатура.Артикул                     КАК Артикул,
	|	Подбор.Номенклатура.ЭтоГруппа                   КАК ЭтоГруппа,
	|	Подбор.Номенклатура.ПометкаУдаления             КАК ПометкаУдаления,
	|	Подбор.Номенклатура.Набор                       КАК Набор,
	|	Подбор.Номенклатура.Услуга                      КАК Услуга,
	|	Подбор.Номенклатура                             КАК Номенклатура,
	|	Подбор.Родитель                                 КАК Родитель,
	|	Подбор.Лимит                                    КАК Лимит,
	|	Подбор.Номенклатура.ЕдиницаХраненияОстатков     КАК ЕдиницаИзмерения,
	|	Подбор.Номенклатура.Представление               КАК ПредставлениеНоменклатура,
	|	Подбор.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ПредставлениеЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Подбор.Номенклатура.ЭтоГруппа ТОГДА ""Группа""
	|		ИНАЧЕ Подбор.Номенклатура.НоменклатурнаяГруппа.Представление
	|	КОНЕЦ                                           КАК ПредставлениеНоменклатурнаяГруппа,
	|	Ложь                                            КАК ПереходитьВверх
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка                            КАК Номенклатура,
	|	СправочникНоменклатура.Родитель                          КАК Родитель,
	|	МАКСИМУМ(Лимиты."+ИмяПодбора+")                          КАК Лимит
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЛимитыВозвратнойТары.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК Лимиты
	|ПО
	|	Лимиты.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ГДЕ
	|	(СправочникНоменклатура.Родитель = &Родитель) И
	|	((СправочникНоменклатура.ЭтоГруппа ИЛИ СправочникНоменклатура.Набор ИЛИ СправочникНоменклатура.Комплект)
	|	  ИЛИ
	|	 (Лимиты."+ИмяПодбора+" > 0))
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.Ссылка
	|
	|) КАК Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подбор.Номенклатура.ЭтоГруппа УБЫВ,
	|	Подбор.Номенклатура.Наименование
	|";

	Возврат ТекстЗапроса;

КонецФункции // ЗапросЛимитПокупателю_ЛимитПоставщика()

//  Функция формирует текст условия
//
// Параметры
//  <ИмяУсловия>  – <Строка>
//  <Организация>  – <СправочникСсылка.Организации ИЛИ Неопределено>
//
// Возвращаемое значение:
//Тип "Строка" =Текст уславия запроса
//
Функция ПолучитьСтрокуУсловия(ПоСправочнику, ИмяУсловия, Склад = Неопределено, Организация = Неопределено) Экспорт
	Перем ТекстУсловия, строкаСклад, строкаОрганизация;
	
	ТекстУсловия      = "";
	строкаСклад       = "";
	строкаОрганизация = "";
	строкаНоменклатура = ?(ПоСправочнику, " Номенклатура В (&МассивНоменклатуры) ", " Номенклатура В (ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ Родитель = &Родитель) ");
	Если ИмяУсловия = "Номенклатура" Тогда
		ТекстУсловия = строкаНоменклатура;
	ИначеЕсли ИмяУсловия = "НоменклатураСклад" Тогда
		строкаСклад = ?(ЗначениеЗаполнено(Склад), " И Склад В (&Склад) ", "");
		ТекстУсловия = строкаНоменклатура + строкаСклад;
	ИначеЕсли ИмяУсловия = "НоменклатураСкладОрганизация" Тогда
		мПревышатьОстаткиПоОрганизации = УправлениеДопПравамиПользователей.РазрешеноПревышениеОстаткаТоваровОрганизации(Организация);
		строкаСклад = ?(УчетнаяПолитикаПоСкладу,?(ЗначениеЗаполнено(Склад), " И Склад В (&Склад) ", ""),"");
		строкаОрганизация = ?(мПревышатьОстаткиПоОрганизации, "",?(ЗначениеЗаполнено(Организация), " И Организация = &Организация ", ""));
		ТекстУсловия      = строкаНоменклатура + строкаСклад + строкаОрганизация;
	ИначеЕсли ИмяУсловия = "НоменклатураХарактеристика" Тогда
		ТекстУсловия = " (ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ Родитель = &Родитель) ";
	ИначеЕсли ИмяУсловия = "НоменклатураСкладДополнительнаяФорма" Тогда
		строкаСклад = ?(ЗначениеЗаполнено(Склад), " И Склад В (&Склад) ", "");
		ТекстУсловия =" Номенклатура = &Номенклатура " + строкаСклад;
	КонецЕсли;
	
	возврат ТекстУсловия;
	
КонецФункции // ПолучитьСтрокуУсловия()

// Процедура формирует строки условий для запросов
//
// Параметры
//  <Параметры>  – <Структура>
//                 <Если режим по справочнику, значения структуры: "Организация, Склад, ДатаЗапроса, МассивНоменклатуры">
//                 <Все остальные режимы, значения структуры: "Организация, Склад, Родитель, ДатаЗапроса">
//  <ПоСправочнику>  – <Булево>
//                 <Истина - для режима "По справочниу">
//                 <Ложь - Все остальные режимы">
//
Процедура СформироватьОтборыДляЗапросов(Параметры, ПоСправочнику) Экспорт
	Перем Организация, Склад, ДатаЗапроса;

	мУсловиеНоменклатура                 = "";
	мУсловиеНоменклатураСклад            = "";
	мУсловиеНоменклатураСкладОрганизация = "";
	мОтборНоменклатурыПоРодителю         = "";

	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Склад",       Склад);
	Параметры.Свойство("ДатаЗапроса", ДатаЗапроса);

	ПолучитьУчетнуюПолитикуВРазрезеСкладов(?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));

	мУсловиеНоменклатура                 = ПолучитьСтрокуУсловия(ПоСправочнику, "Номенклатура");
	мУсловиеНоменклатураСклад            = ПолучитьСтрокуУсловия(ПоСправочнику, "НоменклатураСклад", Склад);
	мУсловиеНоменклатураСкладОрганизация = ПолучитьСтрокуУсловия(ПоСправочнику, "НоменклатураСкладОрганизация", Склад,Организация);
	мОтборНоменклатурыПоРодителю         = ПолучитьСтрокуУсловия(ПоСправочнику, "НоменклатураХарактеристика");

КонецПроцедуры //СформироватьВременнуюТаблицуДляУсловийЗапросов()

// Функция определяет какой запрос надо использовать для заполнения табличной части
//
// Параметры
//  ИмяПодбора  - строка, имя подбора для определения запроса
//  Родитель    - СправочникСсылка.Номенклатура, родитель для элементов, по коротым будет строиться запрос
//  ДатаЗапроса - Дата, на которую будут рассчитываться остатки и пр.
//
// Возвращаемое значение:
//   Запрос, с заполненным текстом и параметрами
//
Функция ПолучитьЗапросДляПодбора(Знач ИмяПодбора, Родитель, ДатаЗапроса, ПересчитатьОстаткиВЕдиницуЦены = Истина, РазворачиватьДоКачества, ВладелецФормы) Экспорт
	Перем Организация, Склад, МенеджерВТ, ПодбиратьУслуги;

	СтруктураИсходныхПараметров.Свойство("Организация", Организация);
	СтруктураИсходныхПараметров.Свойство("Склад"      , Склад);
	СтруктураИсходныхПараметров.Свойство("ПодбиратьУслуги" , ПодбиратьУслуги);
	ПодбиратьУслуги = ?(ПодбиратьУслуги = Неопределено, Ложь, ПодбиратьУслуги);

	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	ДобавитьВременнуюТаблицу(Запрос);

	СформироватьОтборыДляЗапросов(Новый Структура("Организация, Склад, Родитель, ДатаЗапроса", Организация, Склад, Родитель, ДатаЗапроса), Ложь);

	мИмяРегистраДляПодбораСерий = "";

	СписокПараметровЗапроса = ПолучитьСписокПараметровЗапроса(ИмяПодбора);

	СтруктураЗапросаОстаткиНоменклатурыСХарактеристиками(ДатаЗапроса, СписокПараметровЗапроса, Новый Структура("ПоказыватьОстатки,ПоказыватьКолонки", Ложь, Ложь), РазворачиватьДоКачества);

	Запрос.УстановитьПараметр("РазворачиватьДоКачества", РазворачиватьДоКачества);

	Если ИмяПодбора = "ПриходЦеныКонтрагента" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПодбиратьУслуги"      , ПодбиратьУслуги);

		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;
		
		УстановитьПараметрУсловиеПродаж(Запрос);

		Запрос.Текст = ЗапросПриходЦеныКонтрагента(Запрос);
	ИначеЕсли ИмяПодбора = "РасходОстаткиЦеныРозничнаяТочка" 
				ИЛИ ИмяПодбора = "РасходЦеныРозничнаяТочка"
				ИЛИ ИмяПодбора = "ОстаткиНоменклатурыВРознице" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПодбиратьУслуги"      , ПодбиратьУслуги);

		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		УстановитьПараметрУсловиеПродаж(Запрос);

		Если ИмяПодбора = "ОстаткиНоменклатурыВРознице" Тогда
			Запрос.Текст = ЗапросОстаткиНоменклатурыВРознице(Запрос);
		Иначе
			УсловиеУчитыватьОстатки = ИмяПодбора = "РасходОстаткиЦеныРозничнаяТочка";
			Запрос.Текст = ЗапросРасходВРозницеЦеныОстатки(Запрос, УсловиеУчитыватьОстатки);
		КонецЕсли;

	ИначеЕсли ИмяПодбора = "ПриходНоменклатураКонтрагента" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПодбиратьУслуги"      , ПодбиратьУслуги);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		УстановитьПараметрУсловиеПродаж(Запрос);

		РегистрыОстатков = "ТоварыНаСкладах,ТоварыВРознице,ТоварыОрганизаций";
		Если НЕ ВладелецФормы = Неопределено И ВладелецФормы.Ссылка.Метаданные().Имя = "ПоступлениеДопРасходов" Тогда
			РегистрыОстатков = "ТоварыНаСкладах,ТоварыВРознице,ТоварыВНТТ,ТоварыОрганизаций";
		КонецЕсли;

		Запрос.Текст = ЗапросПриходНоменклатураКонтрагента(Запрос, РегистрыОстатков);

	ИначеЕсли ИмяПодбора = "ПриходНоменклатураКонтрагентаБезЦенИОстатков" Тогда

		Запрос.УстановитьПараметр("Родитель"       , Родитель);
		Запрос.УстановитьПараметр("ПодбиратьУслуги", ПодбиратьУслуги);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		Запрос.Текст = ЗапросПриходНоменклатураКонтрагентаБезЦенИОстатков(Запрос);

	ИначеЕсли ИмяПодбора = "РасходЦеныНоменклатуры"
		  ИЛИ ИмяПодбора = "РасходЦеныПлановойСебестоимостиНоменклатуры"
		  ИЛИ ИмяПодбора = "РасходОстаткиИЦеныНоменклатуры" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПодбиратьУслуги"      , ПодбиратьУслуги);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		Если ИмяПодбора = "РасходЦеныПлановойСебестоимостиНоменклатуры" Тогда
			ПлановыйТипЦен = Константы.ТипЦенПлановойСебестоимостиНоменклатуры.Получить();
			Запрос.УстановитьПараметр("ТипЦен", ПлановыйТипЦен);
		КонецЕсли;
		
		УстановитьЗначенияПеременныхДляПодбораСерий(СтруктураИсходныхПараметров.Склад);

		УстановитьПараметрУсловиеПродаж(Запрос);

		Запрос.Текст = ЗапросРасходОстаткиИЦеныНоменклатуры(Запрос, Организация, ИмяПодбора);

	ИначеЕсли ИмяПодбора = "ОстаткиНоменклатуры" Тогда
		
		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПодбиратьУслуги"      , ПодбиратьУслуги);
		
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;
		
		УстановитьЗначенияПеременныхДляПодбораСерий(СтруктураИсходныхПараметров.Склад);
		
		Запрос.Текст = ЗапросОстаткиНоменклатуры(Запрос, Организация);
		
	ИначеЕсли ИмяПодбора = "ВозвратПоставщикуЦеныКонтрагентаИОстатки"
		ИЛИ ИмяПодбора = "ВозвратПоставщикуЦеныКонтрагентаИОстаткиНТТ" Тогда
		
		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;
		
		РегистрыОстатков = Неопределено;
		УстановитьЗначенияПеременныхДляПодбораСерий(ИмяПодбора, РегистрыОстатков);		

		УстановитьПараметрУсловиеПродаж(Запрос);
		Запрос.Текст = ЗапросВозвратПоставщикуЦеныКонтрагентаИОстатки(Запрос, РегистрыОстатков);

	ИначеЕсли ИмяПодбора = "ВозвратПоставщикуНоменклатураКонтрагентаИОстатки"
		ИЛИ ИмяПодбора = "ВозвратПоставщикуНоменклатураКонтрагентаИОстаткиНТТ" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;
		
		РегистрыОстатков = Неопределено;
		УстановитьЗначенияПеременныхДляПодбораСерий(ИмяПодбора, РегистрыОстатков);		

		УстановитьПараметрУсловиеПродаж(Запрос);
		Запрос.Текст = ЗапросВозвратПоставщикуНоменклатураКонтрагентаИОстатки(Запрос, РегистрыОстатков);

	ИначеЕсли ИмяПодбора = "ОстаткиУКомиссионеров" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("СтатусКомиссия"       , Перечисления.СтатусыПолученияПередачиТоваров.НаКомиссию);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		мИмяРегистраДляПодбораСерий = "ТоварыОрганизаций";

		УстановитьПараметрУсловиеПродаж(Запрос);

		Запрос.Текст = ЗапросОстаткиУКомиссионеров(Запрос);

	ИначеЕсли ИмяПодбора = "ОстаткиТоваровКомитентов" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Запрос.УстановитьПараметр("СтатусКомиссия"       , Перечисления.СтатусыПолученияПередачиТоваров.НаКомиссию);
		Запрос.УстановитьПараметр("ПустаяХарактеристика" , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("Сделка" , ?(ЗначениеЗаполнено(СтруктураИсходныхПараметров.Сделка), СтруктураИсходныхПараметров.Сделка, Неопределено));
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		мИмяРегистраДляПодбораСерий = "ТоварыПолученные";

		УстановитьПараметрУсловиеПродаж(Запрос);

		Запрос.Текст = ЗапросОстаткиТоваровКомитентов(Запрос);

	ИначеЕсли ИмяПодбора = "ОстаткиНТТ" Тогда

		Запрос.УстановитьПараметр("Дата"                           , ДатаЗапроса);
		Запрос.УстановитьПараметр("Родитель"                       , Родитель);
		Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета" , глЗначениеПеременной("ВалютаРегламентированногоУчета"));
		Запрос.УстановитьПараметр("ПодбиратьУслуги"      , ПодбиратьУслуги);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		мИмяРегистраДляПодбораСерий = "ТоварыВНТТ";

		Запрос.Текст = ЗапросОстаткиНТТ();

	ИначеЕсли ИмяПодбора = "РасходУслуги" Тогда

		Запрос.УстановитьПараметр("Родитель", Родитель);

		Запрос.Текст = ЗапросРасходУслуги();

	ИначеЕсли ИмяПодбора = "РасходЦеныУслуг" ИЛИ ИмяПодбора = "ПриходЦеныУслуг" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		УстановитьПараметрУсловиеПродаж(Запрос);

		Запрос.Текст = ЗапросЦеныУслуг(Запрос, ИмяПодбора);
	ИначеЕсли ИмяПодбора = "ЛимитПокупателю" 
		  ИЛИ ИмяПодбора = "ЛимитПоставщика" Тогда

		Запрос.УстановитьПараметр("Дата"                 , ДатаЗапроса);
		Запрос.УстановитьПараметр("ДатаРегистраСведений" , ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ТекущаяДата(), ДатаЗапроса));
		Запрос.УстановитьПараметр("Родитель"             , Родитель);
		Для каждого ЭлементСписка Из СписокПараметровЗапроса Цикл
			Запрос.УстановитьПараметр(ЭлементСписка.Значение , СтруктураИсходныхПараметров[ЭлементСписка.Значение]);
		КонецЦикла;

		Запрос.Текст = ЗапросЛимитПокупателю_ЛимитПоставщика(ИмяПодбора);
	КонецЕсли;

	Запрос.УстановитьПараметр( "ПересчитатьОстаткиВЕдиницуЦены", ПересчитатьОстаткиВЕдиницуЦены);

	Если ПустаяСтрока(Запрос.Текст) Тогда
		Возврат Неопределено;
	Иначе
		Возврат Запрос;
	КонецЕсли; 

КонецФункции // ПолучитьЗапросДляПодбора()

// Процедура определяет для частных случаев значения переменной ИмяПодбора функции ПолучитьЗапросДляПодбора, какие регистры надо использовать в запросах для подбора серий и определения остатков
//
// Параметры
//  <ПараметрВыбораРегистра>  - ПеречислениеСсылка.ВидыСкладов или строка, параметр для определения имени регистров в запросах
//  <РегистрыОстатков>    - локальная переменная для определения имени регистров в запросах
//
Процедура УстановитьЗначенияПеременныхДляПодбораСерий(ПараметрВыбораРегистра, РегистрыОстатков = Неопределено)
	
	Если ТипЗнч(ПараметрВыбораРегистра) = Тип("СправочникСсылка.Склады") Тогда
		Если ПараметрВыбораРегистра.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			мИмяРегистраДляПодбораСерий = "ТоварыВРознице";
		Иначе
			мИмяРегистраДляПодбораСерий = "ТоварыНаСкладах";
		КонецЕсли;                                                           
	Иначе 
		Если ПараметрВыбораРегистра = "ВозвратПоставщикуЦеныКонтрагентаИОстатки" или ПараметрВыбораРегистра = "ВозвратПоставщикуНоменклатураКонтрагентаИОстатки"  Тогда
			мИмяРегистраДляПодбораСерий = "ТоварыНаСкладах";
			РегистрыОстатков            = "ТоварыНаСкладах,ТоварыВРознице,ТоварыОрганизаций";
		Иначе
			мИмяРегистраДляПодбораСерий = "ТоварыВНТТ";
			РегистрыОстатков            = "ТоварыВНТТ";
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры //ПрисвоитьИмяРегиструДляПодбораСерий(УсловныйПараметр)


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ ВВОДА ДОПОЛНИТЕЛЬНЫХ ПАРАМЕТРОВ

// Процедура формирует и выводит сумму в информационной надписи.
//
Процедура мОбновитьНадписьФомулаСумма(Форма) Экспорт

	Если Форма.ЭлементыФормы.Найти("ТаблицаХарактеристикНоменклатуры") = Неопределено Тогда
		Форма.ЭлементыФормы.НадписьФомулаСумма.Заголовок = ОбщегоНазначения.ФорматСумм(Форма.Цена * Форма.Количество,,"0,00");
	Иначе
		ИтоговаяСумма = 0;
		Для Каждого СтрокаТабличнойЧасти Из Форма.ТаблицаХарактеристикНоменклатуры Цикл
			ИтоговаяСумма = ИтоговаяСумма + Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(СтрокаТабличнойЧасти.Цена, СтрокаТабличнойЧасти.ВалютаЦены, Форма.ВалютаЦены) * СтрокаТабличнойЧасти.Количество;
		КонецЦикла;
		Форма.ЭлементыФормы.НадписьФомулаСумма.Заголовок = ИтоговаяСумма;
	КонецЕсли;

КонецПроцедуры // мОбновитьНадписьФомулаСумма()

// Процедура возвращает в форму-владельца выбранные значения.
//
Процедура мВыборВозврат(Форма) Экспорт

	Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	Если Форма.ЭлементыФормы.Найти("ТаблицаХарактеристикНоменклатуры") <> Неопределено Тогда

		МассивСтруктурПараметров = Новый Массив;
		НетСерииВТаблице         = (Форма.ТаблицаХарактеристикНоменклатуры.Колонки.Найти("Серия") = Неопределено);

		Для Каждого СтрокаТаблицыХарактеристик Из Форма.ТаблицаХарактеристикНоменклатуры Цикл

			Если СтрокаТаблицыХарактеристик.Количество <> 0 Тогда
				Характеристика = СтрокаТаблицыХарактеристик.Характеристика;
				Если ТипЗнч(Характеристика) <> Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
					Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); // Это строка = нужно присвоить пустую ссылку
				КонецЕсли;

				СтруктураПараметров = Новый Структура();
				СтруктураПараметров.Вставить("ЕдиницаИзмерения", СтрокаТаблицыХарактеристик.ЕдиницаИзмерения);
				СтруктураПараметров.Вставить("Количество",       СтрокаТаблицыХарактеристик.Количество);
				СтруктураПараметров.Вставить("Цена",             СтрокаТаблицыХарактеристик.Цена);
				СтруктураПараметров.Вставить("ВалютаЦены",       СтрокаТаблицыХарактеристик.ВалютаЦены);
				СтруктураПараметров.Вставить("Серия",            ?(НетСерииВТаблице, Справочники.СерииНоменклатуры.ПустаяСсылка(), СтрокаТаблицыХарактеристик.Серия));
				СтруктураПараметров.Вставить("Характеристика",   Характеристика);
				СтруктураПараметров.Вставить("Качество", ?(Форма.ВладелецФормы.РазворачиватьДоКачества, СтрокаТаблицыХарактеристик.Качество, Справочники.Качество.Новый));

				МассивСтруктурПараметров.Добавить(СтруктураПараметров);
			КонецЕсли;

		КонецЦикла;

		Форма.Закрыть(МассивСтруктурПараметров);
		Возврат;

	КонецЕсли;

	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ЕдиницаИзмерения", Форма.ЕдиницаИзмерения);
	СтруктураПараметров.Вставить("Количество",       Форма.Количество);
	СтруктураПараметров.Вставить("Цена",             Форма.Цена);
	СтруктураПараметров.Вставить("Серия",            Форма.Серия);
	СтруктураПараметров.Вставить("Характеристика",   Характеристика);

	Форма.Закрыть(СтруктураПараметров);

КонецПроцедуры // мВыборВозврат()

// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура мПриОткрытии(Форма) Экспорт

	Перем ЗапрашиватьЦену, ЗапрашиватьСерию, ЗапрашиватьКоличество;
	Перем ЕстьЦена, ЕстьКоличество;
	
	ПолучитьСерверТО().ПодключитьКлиента(Форма);

	Форма.Заголовок = "Количество и цена """ + Форма.Номенклатура + """";

	ЗапрашиватьКоличество   = Форма.ВладелецФормы.ЗапрашиватьКоличество;
	ЗапрашиватьЦену         = Форма.ВладелецФормы.ЗапрашиватьЦену;
	ЗапрашиватьСерию        = Форма.ВладелецФормы.ЗапрашиватьСерию;
	РазворачиватьДоКачества = Форма.ВладелецФормы.РазворачиватьДоКачества;

	Если Форма.ЭлементыФормы.Найти("ТаблицаХарактеристикНоменклатуры") = Неопределено Тогда
		Форма.ЭлементыФормы.НадписьКоличество. Доступность = ЗапрашиватьКоличество;
		Форма.ЭлементыФормы.Количество.        Доступность = ЗапрашиватьКоличество;
		Форма.ЭлементыФормы.ЕдиницаИзмерения.  Доступность = ЗапрашиватьКоличество;
		Форма.ЭлементыФормы.НадписьЦена.       Доступность = ЗапрашиватьЦену;
		Форма.ЭлементыФормы.Цена.              Доступность = ЗапрашиватьЦену;
		Форма.ЭлементыФормы.НадписьВалютаЦены. Доступность = ЗапрашиватьЦену;
	Иначе

		Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Цена.ПропускатьПриВводе    = ЗапрашиватьЦену;
		Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Цена.Доступность           = ЗапрашиватьЦену;
		Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.ВалютаЦены.Доступность     = ЗапрашиватьЦену;

		Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Качество.Видимость         = РазворачиватьДоКачества;
		Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Качество.ИзменятьВидимость = РазворачиватьДоКачества;

		Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоСвободныйОстаток.Видимость           = Ложь;
		Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоСвободныйОстаток.ИзменятьНастройку   = Ложь;
		Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоОстатокОрганизации.ИзменятьНастройку = Ложь;
		Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоОстатокОрганизации.Видимость         = Ложь;
		Форма.ЭлементыФормы.ПоказыватьОстатки.Видимость                                                             = Ложь;

		// Активизируем первую строку
		Если Форма.ТаблицаХарактеристикНоменклатуры.Количество() > 0 Тогда
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущаяСтрока = Форма.ТаблицаХарактеристикНоменклатуры.Получить(0);
		КонецЕсли;

		Если СтруктураИсходныхПараметров.Свойство("ЕстьКоличество" , ЕстьКоличество) И НЕ ЕстьКоличество Тогда
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Количество.Данные       = "";
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Количество.ДанныеФлажка = "Количество";
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.Количество.ТекстШапки   = "Подбирать в документ";
		КонецЕсли;

	КонецЕсли;
	Форма.ЭлементыФормы.НадписьВалютаСуммы.Доступность = ЗапрашиватьЦену;
	Форма.ЭлементыФормы.НадписьСумма.      Доступность = ЗапрашиватьЦену;
	Форма.ЭлементыФормы.НадписьФомулаСумма.Доступность = ЗапрашиватьЦену;

	Если Форма.ЭлементыФормы.Найти("Серия") <> Неопределено Тогда
		Форма.ЭлементыФормы.Серия.Доступность = ЗапрашиватьСерию;
	КонецЕсли;
	
	///////////////////////// Работа с весами //////////////////////////////////
	МассивВесов = ПолучитьСерверТО().ПолучитьСписокУстройств(
	                    Перечисления.ВидыТорговогоОборудования.ЭлектронныеВесы);

	СписокВесов = РаботаСТорговымОборудованием.ПолучитьСписокУстройствТОДляВыбора(МассивВесов);

	Форма.ЭлементыФормы.ТекущиеВесы.СписокВыбора = СписокВесов;

	РаботаСДиалогами.УстановитьДоступностьКнопкиПолучитьВес(Форма.ЭлементыФормы.КоманднаяПанельДействий.Кнопки, МассивВесов);

	КоличествоВесов = МассивВесов.Количество();
	Если КоличествоВесов = 0 Тогда
		Форма.ЭлементыФормы.НадписьВесы.Доступность = Ложь;
		Форма.ЭлементыФормы.ТекущиеВесы.Доступность = Ложь;
	Иначе
		РаботаСДиалогами.УстановитьДоступностьКнопкиПолучитьВес(Форма.ЭлементыФормы.КоманднаяПанельДействий.Кнопки, МассивВесов);

		Если КоличествоВесов = 1 Тогда
			Форма.ЭлементыФормы.НадписьВесы.Доступность = Ложь;
			Форма.ЭлементыФормы.ТекущиеВесы.Доступность = Ложь;
			Форма.ЭлементыФормы.ТекущиеВесы.Значение = МассивВесов[0];
		Иначе
			Форма.ЭлементыФормы.НадписьВесы.Доступность = ЗапрашиватьКоличество;
			Форма.ЭлементыФормы.ТекущиеВесы.Доступность = ЗапрашиватьКоличество;

			МодельВесов = ВосстановитьЗначение("ВесыПредыдущегоСеанса");
			Форма.ЭлементыФормы.ТекущиеВесы.Значение = МодельВесов;
		КонецЕсли;
	КонецЕсли;

	мОбновитьНадписьФомулаСумма(Форма);

КонецПроцедуры // мПриОткрытии()

// Процедура - обработчик события "ПриЗакрытии" формы.
//
Процедура мПередЗакрытием(Форма) Экспорт

	ПолучитьСерверТО().ОтключитьКлиента(Форма);
	
	Если Форма.ЭлементыФормы.ТекущиеВесы.Значение <> Неопределено Тогда
		СохранитьЗначение("ВесыПредыдущегоСеанса", Форма.ЭлементыФормы.ТекущиеВесы.Значение);
	КонецЕсли;

КонецПроцедуры // мПередЗакрытием()

// Процедура - обработчик события "ОбновлениеОтображения" формы.
//
Процедура мОбновлениеОтображения(Форма) Экспорт

КонецПроцедуры // мОбновлениеОтображения()

// Процедура - обработчик события "ОбработкаВыбора" поля ввода единицы измерения.
//  Пересчитывает цену при изменении единицы измерения.
//
Процедура мЕдиницаИзмеренияОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт

	СтарыйКоэффициент = Элемент.Значение.Коэффициент;
	Если СтарыйКоэффициент <> 0 Тогда
		Форма.Цена = Форма.Цена * ВыбранноеЗначение.Коэффициент / СтарыйКоэффициент;
	КонецЕсли;
	Форма.Активизировать();

КонецПроцедуры // мЕдиницаИзмеренияОбработкаВыбора()

// Процедура - обработчик события "ПриИзменении" поля ввода количества.
//
Процедура мКоличествоПриИзменении(Форма, Элемент) Экспорт

	мОбновитьНадписьФомулаСумма(Форма);

КонецПроцедуры // мКоличествоПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля ввода цены.
//
Процедура мЦенаПриИзменении(Форма, Элемент) Экспорт

	мОбновитьНадписьФомулаСумма(Форма);

КонецПроцедуры // мЦенаПриИзменении()

// Процедура - обработчик события "Нажатие" кнопки "ОК".
//
Процедура мКнопкаОКНажатие(Форма, Элемент) Экспорт

	мВыборВозврат(Форма);

КонецПроцедуры // мКнопкаОКНажатие()

// Процедура - обработчик события "ПриАктивизацииСтроки" табличного поля характеристик номенклатуры.
//
Процедура мТаблицаХарактеристикНоменклатурыПриАктивизацииСтроки(Форма, Элемент) Экспорт

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыПриАктивизацииСтроки()

// Процедура - обработчик события "ПриОкончанииРедактирования" табличного поля характеристик номенклатуры.
//
Процедура мТаблицаХарактеристикНоменклатурыПриОкончанииРедактирования(Форма, Элемент, НоваяСтрока, ОтменаРедактирования) Экспорт

	мОбновитьНадписьФомулаСумма(Форма);

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыПриОкончанииРедактирования()

// Процедура - обработчик события "ПриНачалеРедактирования" табличного поля характеристик номенклатуры.
//
Процедура мТаблицаХарактеристикНоменклатурыПриНачалеРедактирования(Форма, Элемент, НоваяСтрока) Экспорт

	Если НоваяСтрока Тогда
		СтрокаТабличнойЧасти = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущиеДанные;
		СтрокаТабличнойЧасти.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КОнецЕсли;

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыПриНачалеРедактирования()

// Процедура - обработчик события "ПриИзменении" пола "Характеристика" таблицы характеристик номенклатуры.
//
Процедура мТаблицаХарактеристикНоменклатурыХарактеристикаПриИзменении(Форма, Элемент) Экспорт

	СтрокаТабличнойЧасти = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущиеДанные;

	
	ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");

	Характеристика   = ОписаниеТипов.ПривестиЗначение(СтрокаТабличнойЧасти.Характеристика);
	Номенклатура     = Форма.Номенклатура;
	ЕдиницаИзмерения = Форма.Номенклатура.ЕдиницаХраненияОстатков;
	ВалютаЦены       = Форма.ВалютаЦены;
	ВалютаЦены       = ?(НЕ ЗначениеЗаполнено(ВалютаЦены), ?(СтруктураИсходныхПараметров.Свойство("ВалютаДокумента"), СтруктураИсходныхПараметров.ВалютаДокумента, глЗначениеПеременной("ВалютаРегламентированногоУчета")), ВалютаЦены);

	// Получим Цену
	Цена = 0;
	Если СтруктураИсходныхПараметров.Свойство("ТипЦен") Тогда
		Если ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
			Цена = Ценообразование.ПолучитьЦенуНоменклатуры(Номенклатура, Характеристика, СтруктураИсходныхПараметров.ТипЦен, Форма.ДатаРасчетов, ЕдиницаИзмерения, ВалютаЦены);
		ИначеЕсли ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
			Цена = Ценообразование.ПолучитьЦенуКонтрагента(Номенклатура, Характеристика, СтруктураИсходныхПараметров.Контрагент,
											 СтруктураИсходныхПараметров.ТипЦен, Форма.ДатаРасчетов, ЕдиницаИзмерения, ВалютаЦены);
		КонецЕсли; 
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Характеристика)
	 Или ТипЗнч(СтрокаТабличнойЧасти.Характеристика) = Тип("Строка") Тогда
		СтрокаТабличнойЧасти.Характеристика = "<без характеристики>";
	КонецЕсли;

	СтрокаТабличнойЧасти.ВалютаЦены       = ВалютаЦены;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.Цена             = Цена;

	Если СтрокаТабличнойЧасти.Количество =  0 Тогда
		СтрокаТабличнойЧасти.Количество = Форма.Количество;
	КонецЕсли;

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыХарактеристикаПриИзменении()

// Процедура - обработчик события "НачалоВыбора" пола "Характеристика" таблицы характеристик номенклатуры.
//
Процедура мТаблицаХарактеристикНоменклатурыХарактеристикаНачалоВыбора(Форма, Элемент, СтандартнаяОбработка) Экспорт

	СтрокаТабличнойЧасти = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущиеДанные;

	Если ТипЗнч(СтрокаТабличнойЧасти.Характеристика) = Тип("Строка") Тогда
		СтрокаТабличнойЧасти.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыХарактеристикаНачалоВыбора()

// Процедура - обработчик события "ОбработкаВыбора" единицы измерения.
//
Процедура мТаблицаХарактеристикНоменклатурыЕдиницаИзмеренияОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт

	СтарыйКоэффициент = Элемент.Значение.Коэффициент;
	Если СтарыйКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущаяСтрока;
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Цена * ВыбранноеЗначение.Коэффициент / СтарыйКоэффициент;
	КонецЕсли;

КонецПроцедуры // мТаблицаХарактеристикНоменклатурыЕдиницаИзмеренияОбработкаВыбора()

// Процедура - обработчик события "НачалоВыбораИзСписка" поля ввода серии.
//
Процедура мСерияНачалоВыбораИзСписка(Форма, Элемент, СтандартнаяОбработка) Экспорт

	СерияВТабЧасти = (Форма.ЭлементыФормы.Найти("Серия") = Неопределено);

	Если СерияВТабЧасти Тогда
		Элемент.СписокВыбора.Очистить();
		СписокСерий = Элемент.СписокВыбора;
	Иначе
		СписокСерий = Форма.ЭлементыФормы.Серия.СписокВыбора;
	КонецЕсли;

	Если СписокСерий.Количество() = 0 Тогда

		// Заполнение списка при первом обращении к нему
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Номенклатура" , Форма.Номенклатура);
		
		Если НЕ ЗначениеЗаполнено(мИмяРегистраДляПодбораСерий) Тогда

			Запрос.Текст = "
			|ВЫБРАТЬ
			|	Серии.Ссылка КАК Серия,
			|	0            КАК Количество
			|
			|ИЗ
			|	Справочник.СерииНоменклатуры КАК Серии
			|
			|ГДЕ
			|	Серии.Ссылка.Владелец = &Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	Серии.Ссылка ВОЗР
			|";

		Иначе
			
			НуженФильтрПоКачеству = Ложь;
			Если ЗначениеЗаполнено(Форма.Качество) И Метаданные.РегистрыНакопления[мИмяРегистраДляПодбораСерий].Измерения.Найти("Качество") <> Неопределено Тогда
				НуженФильтрПоКачеству = Истина;
				Запрос.УстановитьПараметр("Качество", Форма.Качество);
			КонецЕсли;

			Если Форма.ВладелецФормы.ЭлементыФормы.СписокВидовПодбора.Значение = "ОстаткиУКомиссионеров" Тогда
				Запрос.УстановитьПараметр("Комиссионер", СтруктураИсходныхПараметров.Контрагент);
				Если СтруктураИсходныхПараметров.Свойство("Организация") Тогда
					Запрос.УстановитьПараметр("Организация", СтруктураИсходныхПараметров.Организация);
				КонецЕсли;
			КонецЕсли;
			
			Если Форма.ВладелецФормы.ЭлементыФормы.СписокВидовПодбора.Значение = "ОстаткиТоваровКомитентов" Тогда
				Запрос.УстановитьПараметр("Контрагент", СтруктураИсходныхПараметров.Контрагент);
				Если СтруктураИсходныхПараметров.Свойство("Организация") Тогда
					Запрос.УстановитьПараметр("Организация", СтруктураИсходныхПараметров.Организация);
				КонецЕсли;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Дата"         , Форма.ДатаРасчетов);
			Запрос.УстановитьПараметр("Склад"        , СтруктураИсходныхПараметров.Склад);
			Запрос.УстановитьПараметр("ЦенаВРознице" , Форма.Цена);
			Если СерияВТабЧасти Тогда
				Характеристика = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущиеДанные.Характеристика;
			Иначе
				Характеристика = Форма.Характеристика;
			КонецЕсли;
			Если ТипЗнч(Характеристика) <> Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
				Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			КонецЕсли;
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Характеристика);

			Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Остатки.СерияНоменклатуры        КАК Серия,
			|	СУММА(Остатки.КоличествоОстаток) КАК Количество
			|
			|ИЗ
			|	РегистрНакопления." + мИмяРегистраДляПодбораСерий + ".Остатки(&Дата, (Номенклатура = &Номенклатура И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры" +
			    ?(мИмяРегистраДляПодбораСерий = "ТоварыВНТТ", " И ЦенаВРознице = &ЦенаВРознице", "") +
			    ?(СтруктураИсходныхПараметров.Склад <> Неопределено и (Форма.ВладелецФормы.ЭлементыФормы.СписокВидовПодбора.Значение <> "ОстаткиТоваровКомитентов"), (" И Склад В (&Склад)"), "") +
			    ?(Форма.ВладелецФормы.ЭлементыФормы.СписокВидовПодбора.Значение = "ОстаткиУКомиссионеров", " И Комиссионер = &Комиссионер", "") +
				
			    ?(Форма.ВладелецФормы.ЭлементыФормы.СписокВидовПодбора.Значение = "ОстаткиТоваровКомитентов", " И Контрагент = &Контрагент", "") +
				
			    ?((СтруктураИсходныхПараметров.Свойство("Организация") И Форма.ВладелецФормы.ЭлементыФормы.СписокВидовПодбора.Значение = "ОстаткиУКомиссионеров"), " И Организация = &Организация", "") +
				?(НуженФильтрПоКачеству, " И Качество = &Качество", "") + ")) КАК Остатки
			|
			|ГДЕ
			|	Остатки.КоличествоОстаток > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	Остатки.СерияНоменклатуры
			|
			|УПОРЯДОЧИТЬ ПО
			|	Серия ВОЗР
			|";

		КонецЕсли;

		ТаблицаСерий = Запрос.Выполнить().Выгрузить();

		Для каждого Строка Из ТаблицаСерий Цикл
			Если НЕ ЗначениеЗаполнено(мИмяРегистраДляПодбораСерий) Тогда
				СписокСерий.Добавить(Строка.Серия, Строка(Строка.Серия));
			Иначе
				СписокСерий.Добавить(Строка.Серия, (?(ПустаяСтрока(Строка(Строка.Серия)), "<без серии>", Строка(Строка.Серия)) + " (" + СокрЛП(Формат(Строка.Количество, "ЧЦ=15; ЧДЦ=3")) + " " + СокрЛП(Форма.Номенклатура.ЕдиницаХраненияОстатков) + ")"));
			КонецЕсли;
		КонецЦикла;

		Если СписокСерий.Количество() > 0 Тогда
			Если СерияВТабЧасти Тогда
				Элемент.Значение                   = СписокСерий[0].Значение;
			Иначе
				Форма.ЭлементыФормы.Серия.Значение = СписокСерий[0].Значение;
			КонецЕсли;
		КонецЕсли;

	КОнецЕсли;

КонецПроцедуры // мСерияНачалоВыбораИзСписка()

Процедура мЕдиницаИзмеренияПриИзменении(Форма, Элемент) Экспорт

	мОбновитьНадписьФомулаСумма(Форма);

КонецПроцедуры // мЕдиницаИзмеренияПриИзменении()

// Процедура - обработчик события "Нажатие" кнопки "Заполнить" командной панели таблицы характеристик.
//
Процедура мКоманднаяПанельТаблицыХарактеристикНоменклатурыЗаполнить(Форма) Экспорт
	Перем РезультатПодборПоЗапросу, ПоказыватьОстатки;
	ЕстьЦена                       = Ложь;
	ПоказыватьОстатки              = Ложь;
	ПодборПоСправочнику            = Форма.ВладелецФормы.ПодборПоСправочнику;
	ПерезаполнятьТаблицу = СтруктураИсходныхПараметров.Свойство("ТипЦен") и СтруктураИсходныхПараметров.ТипЦен <> Неопределено;
	КачествоПоУмолчанию  = СтруктураИсходныхПараметров.Свойство("КачествоПоУмолчанию");

	Если СтруктураИсходныхПараметров.Свойство("РезультатПодборПоЗапросу", РезультатПодборПоЗапросу) И НЕ РезультатПодборПоЗапросу = Неопределено Тогда
		ЕстьЦена = ?(РезультатПодборПоЗапросу.Колонки.Найти("Цена") = Неопределено, Ложь, Истина);
	КонецЕсли;

	Если ПодборПоСправочнику ИЛИ (ПерезаполнятьТаблицу И НЕ ЕстьЦена) Тогда

		Если НЕ СтруктураОстаткиПриВыбореНоменклатуры = Неопределено Тогда
			СтруктураПоказыватьОстатки = Неопределено;
			СтруктураОстаткиПриВыбореНоменклатуры.Свойство("ПоказыватьОстатки", СтруктураПоказыватьОстатки);
			ПоказыватьОстатки = СтруктураПоказыватьОстатки["ПоказыватьОстатки"] = Истина;
		КонецЕсли;

		// Заполним характеристики
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Запрос.УстановитьПараметр("Номенклатура"                     , Форма.Номенклатура);
		Запрос.УстановитьПараметр("ВалютаЦены"                       , Форма.ВалютаЦены);

		ТекстЗапроса = "";
		Если СтруктураИсходныхПараметров.Свойство("ТипЦен") и СтруктураИсходныхПараметров.ТипЦен <> Неопределено Тогда
			Склад = ?(СтруктураИсходныхПараметров.Свойство("Склад"), СтруктураИсходныхПараметров.Склад, Неопределено);
			СтрокаУсловия = ПолучитьСтрокуУсловия(ПодборПоСправочнику, "НоменклатураСкладДополнительнаяФорма", Склад);
			ТипЦен = СтруктураИсходныхПараметров.ТипЦен;

			Запрос.УстановитьПараметр("Дата"                           , Форма.ДатаРасчетов);
			Запрос.УстановитьПараметр("ДатаРегистраСведений"           , ?(НЕ ЗначениеЗаполнено(Форма.ДатаРасчетов), ТекущаяДата(), Форма.ДатаРасчетов));
			Запрос.УстановитьПараметр("Контрагент"                     , ?(СтруктураИсходныхПараметров.Свойство("Контрагент"), СтруктураИсходныхПараметров.Контрагент, NULL));
			Запрос.УстановитьПараметр("ЕдиницаХраненияОстатков"        , Форма.Номенклатура.ЕдиницаХраненияОстатков);
			Запрос.УстановитьПараметр("Склад"                          , Склад);
			Запрос.УстановитьПараметр("ТипЦен"                         , ТипЦен);
			Запрос.УстановитьПараметр("ЗначениеКачество"               , ?(КачествоПоУмолчанию, СтруктураИсходныхПараметров.КачествоПоУмолчанию, Справочники.Качество.Новый));
			УстановитьПараметрУсловиеПродаж(Запрос);

			Если НЕ ПодборПоСправочнику И НЕ ЕстьЦена Тогда
				Запрос.УстановитьПараметр("тНоменклатураХарактеристика", Форма.ТаблицаХарактеристикНоменклатуры);
				ТекстЗапроса = "
				|ВЫБРАТЬ
				|	&Номенклатура                                                      КАК Номенклатура,
				|	ВЫРАЗИТЬ(Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК ХарактеристикаНоменклатуры,
				|	""""                                                               КАК ХарактеристикаНаименование,
				|	Качество                                                           КАК Качество,
				|	&ТипЦен                                                            КАК ТипЦен,
				|	&ЕдиницаХраненияОстатков                                           КАК ЕдиницаХраненияОстатков
				|ПОМЕСТИТЬ НоменклатураСХарактеристикой
				|ИЗ &тНоменклатураХарактеристика КАК тНоменклатураХарактеристика
				|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
				|";
			Иначе
				ТекстЗапроса = "
				|ВЫБРАТЬ
				|	Характеристики.Владелец                                  КАК Номенклатура,
				|	Характеристики.Ссылка                                    КАК ХарактеристикаНоменклатуры,
				|	Характеристики.Наименование                              КАК ХарактеристикаНаименование,
				|	&ЗначениеКачество                                        КАК Качество,
				|	&ТипЦен                                                  КАК ТипЦен,
				|	&ЕдиницаХраненияОстатков                                 КАК ЕдиницаХраненияОстатков
				|ПОМЕСТИТЬ НоменклатураСХарактеристикой
				|ИЗ
				|	Справочник.ХарактеристикиНоменклатуры КАК Характеристики
				|ГДЕ Характеристики.Владелец = &Номенклатура
				|ОБЪЕДИНИТЬ
				|ВЫБРАТЬ
				|	&Номенклатура                                                КАК Номенклатура,
				|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
				|	""""                                                         КАК ХарактеристикаНаименование,
				|	&ЗначениеКачество                                            КАК Качество,
				|	&ТипЦен                                                      КАК ТипЦен,
				|	&ЕдиницаХраненияОстатков                                     КАК ЕдиницаХраненияОстатков
				|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры, ТипЦен
				|";
			КонецЕсли;
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.Выполнить();

			Если СтруктураИсходныхПараметров.Свойство("СпособЗаполненияЦен") И СтруктураИсходныхПараметров.СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоРозничнымЦенам Тогда
				ТекстЗапроса = "
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Характеристики.ХарактеристикаНоменклатуры                               КАК Характеристика,
				|	Характеристики.Качество                                                 КАК Качество,
				|	ВЫБОР КОГДА НЕ ЦеныСХарактеристикой.ЦенаВРознице ЕСТЬ NULL
				|	      ТОГДА ЦеныСХарактеристикой.ЦенаВРознице
				|	      ИНАЧЕ ВЫБОР КОГДА НЕ ЦеныБезХарактеристики.ЦенаВРознице ЕСТЬ NULL
				|	                  ТОГДА ЦеныБезХарактеристики.ЦенаВРознице
				|	                  ИНАЧЕ 0 КОНЕЦ КОНЕЦ                                   КАК Цена,
				|	&ВалютаЦены                                                             КАК ВалютаЦены,
				|	Характеристики.ЕдиницаХраненияОстатков                                  КАК ЕдиницаИзмерения,
				|	Характеристики.ХарактеристикаНаименование                               КАК ХарактеристикаНаименование
				|" + ?(ПодборПоСправочнику И ПоказыватьОстатки, " ПОМЕСТИТЬ Цены ", "") + "
				|ИЗ
				//
				|	НоменклатураСХарактеристикой КАК Характеристики
				//
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрНакопления.ТоварыВНТТ.Остатки(&Дата, " + СтрокаУсловия + ") КАК ЦеныБезХарактеристики
				|ПО
				|	ЦеныБезХарактеристики.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|	И ЦеныБезХарактеристики.Номенклатура = Характеристики.Номенклатура
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрНакопления.ТоварыВНТТ.Остатки(&Дата, " + СтрокаУсловия + ") КАК ЦеныСХарактеристикой
				|ПО
				|	ЦеныСХарактеристикой.ХарактеристикаНоменклатуры = Характеристики.ХарактеристикаНоменклатуры
				|	И ЦеныСХарактеристикой.Номенклатура = Характеристики.Номенклатура
				|" + ?(ПодборПоСправочнику И ПоказыватьОстатки, " ИНДЕКСИРОВАТЬ ПО Характеристики.ХарактеристикаНоменклатуры", " УПОРЯДОЧИТЬ ПО Характеристики.ХарактеристикаНаименование") + "
				|";
			ИначеЕсли СтруктураИсходныхПараметров.Свойство("СпособЗаполненияЦен") И СтруктураИсходныхПараметров.СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоПродажнымЦенам Тогда
				ТекстЗапроса = "
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Характеристики.ХарактеристикаНоменклатуры                                       КАК Характеристика,
				|	Характеристики.Качество                                                         КАК Качество,
				|	ЕСТЬNULL(ЕСТЬNULL(ЦеныСХарактеристикой.Цена, ЦеныБезХарактеристики.Цена), 0.00) * (1 + ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)/100) КАК Цена,
				|	&ВалютаЦены                                                                     КАК ВалютаЦены,
				|	Характеристики.ЕдиницаХраненияОстатков                                          КАК ЕдиницаИзмерения,
				|	Характеристики.ХарактеристикаНаименование                                       КАК ХарактеристикаНаименование
				|" + ?(ПодборПоСправочнику И ПоказыватьОстатки, " ПОМЕСТИТЬ Цены ", "") + "
				|ИЗ
				//
				|	НоменклатураСХарактеристикой КАК Характеристики
				//
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.ЦеныАТТ.СрезПоследних(&ДатаРегистраСведений, " + СтрокаУсловия + ") КАК ЦеныСХарактеристикой
				|ПО
				|	ЦеныСХарактеристикой.Номенклатура = Характеристики.Номенклатура
				|	И ЦеныСХарактеристикой.ХарактеристикаНоменклатуры = Характеристики.ХарактеристикаНоменклатуры
				|
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.ЦеныАТТ.СрезПоследних(&ДатаРегистраСведений, " + СтрокаУсловия + ") КАК ЦеныБезХарактеристики
				|ПО
				|	ЦеныБезХарактеристики.Номенклатура = Характеристики.Номенклатура
				|	И ЦеныБезХарактеристики.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.НаценкиПоУсловиямПродаж.СрезПоследних(&ДатаРегистраСведений, УсловиеПродаж = &УсловиеПродаж) КАК УсловияПродаж
				|ПО
				|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Характеристики.Номенклатура.ЦеноваяГруппа
				|	ИЛИ
				|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Характеристики.Номенклатура.НоменклатурнаяГруппа
				|
				|" + ?(ПодборПоСправочнику И ПоказыватьОстатки, " ИНДЕКСИРОВАТЬ ПО Характеристики.ХарактеристикаНоменклатуры", " УПОРЯДОЧИТЬ ПО Характеристики.ХарактеристикаНаименование") + "
				|";
			ИначеЕсли ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
				ДоговорКонтрагента = ?(СтруктураИсходныхПараметров.Свойство("ДоговорКонтрагента"),СтруктураИсходныхПараметров.ДоговорКонтрагента, NULL);
				Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
				ТекстЗапроса = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|		ЦеныНаБазовыйТип.ХарактеристикаНоменклатуры КАК Характеристика,
				|		ЦеныНаБазовыйТип.Качество                   КАК Качество,
				|		ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
				|				ТОГДА ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена) * (1 + ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)/100)
				|				ИНАЧЕ
				|						ВЫБОР	КОГДА ЦеныНаБазовыйТип.Рассчитывается
				|								ТОГДА
				|										ВЫБОР	КОГДА ЦеныНаБазовыйТип.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
				|												ТОГДА (ЕСТЬNULL(ЦеныНаБазовыйТип.Цена, 0.00) + ЕСТЬNULL(ЦеныНаБазовыйТип.Цена, 0.00) * (ЦеныНаБазовыйТип.ПроцентСкидкиНаценки /100)) * (1 + ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)/100)
				|												ИНАЧЕ ЕСТЬNULL(ЦенаПоДиапазону.Цена, 0.00) * (1 + ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)/100)
				|										КОНЕЦ
				|								ИНАЧЕ ЦеныНаБазовыйТип.Цена * (1 + ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)/100)
				|						КОНЕЦ
				|		КОНЕЦ                                       КАК Цена,
				|		ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
				|				ТОГДА ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ВалютаЦены)
				|				ИНАЧЕ	ЕСТЬNULL(
				|						ВЫБОР	КОГДА ЦеныНаБазовыйТип.Рассчитывается
				|								ТОГДА
				|										ВЫБОР	КОГДА ЦеныНаБазовыйТип.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
				|												ТОГДА ЦеныНаБазовыйТип.Валюта
				|												ИНАЧЕ ЦенаПоДиапазону.Валюта
				|										КОНЕЦ
				|								ИНАЧЕ ЦеныНаБазовыйТип.Валюта
				|						КОНЕЦ, &ВалютаЦены)
				|		КОНЕЦ                                       КАК ВалютаЦены,
				|		ВЫБОР	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) > 0
				|				ТОГДА ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ЕдиницаИзмерения)
				|				ИНАЧЕ	ЕСТЬNULL(
				|						ВЫБОР	КОГДА ЦеныНаБазовыйТип.Рассчитывается
				|								ТОГДА
				|										ВЫБОР	КОГДА ЦеныНаБазовыйТип.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаЦены.ПоПроцентнойНаценкеНаБазовыйТип)
				|												ТОГДА ЦеныНаБазовыйТип.ЕдиницаИзмерения
				|												ИНАЧЕ ЦенаПоДиапазону.ЕдиницаИзмерения
				|										КОНЕЦ
				|								ИНАЧЕ ЦеныНаБазовыйТип.ЕдиницаИзмерения
				|						КОНЕЦ, ЦеныНаБазовыйТип.Номенклатура.ЕдиницаХраненияОстатков)
				|		КОНЕЦ                                       КАК ЕдиницаИзмерения
				|" + ?(ПодборПоСправочнику И ПоказыватьОстатки, ", ЦеныНаБазовыйТип.ХарактеристикаНаименование ПОМЕСТИТЬ Цены ", "") + "
				| ИЗ
				|(
				|	ВЫБРАТЬ
				|		НоменклатураХарактеристикаТипЦены.Номенклатура               КАК Номенклатура,
				|		НоменклатураХарактеристикаТипЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|		НоменклатураХарактеристикаТипЦены.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
				|		НоменклатураХарактеристикаТипЦены.Качество                   КАК Качество,
				|		ВЫБОР	КОГДА НоменклатураХарактеристикаТипЦены.Рассчитывается
				|				ТОГДА	ВЫБОР	КОГДА ЕСТЬNULL(КурсВалют.Кратность, 0.00) = 0 ИЛИ ЕСТЬNULL(КурсВалютДинамическийТип.Курс, 0.00) = 0
				|								ТОГДА 0.00
				|								ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(ЦеныНоменклатуры.Цена, ЦеныНоменклатурыПустаяХарактеристика.Цена), 0.00)
				|									  * ЕСТЬNULL(КурсВалют.Курс, 0.00)
				|									  * ЕСТЬNULL(КурсВалютДинамическийТип.Кратность, 0.00)
				|									  / КурсВалют.Кратность
				|									  / КурсВалютДинамическийТип.Курс
				|						КОНЕЦ
				|				ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, ЦеныНоменклатурыПустаяХарактеристика.Цена)
				|		КОНЕЦ                                                        КАК Цена,
				|		ВЫБОР	КОГДА НоменклатураХарактеристикаТипЦены.Рассчитывается
				|				ТОГДА	ВЫБОР	КОГДА ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.СпособРасчетаЦены, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.СпособРасчетаЦены) ЕСТЬ NULL
				|				                ТОГДА ТипЦенНоменклаутры.СпособРасчетаЦены
				|				                ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.СпособРасчетаЦены, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.СпособРасчетаЦены)
				|				        КОНЕЦ
				|				ИНАЧЕ NULL
				|		КОНЕЦ                                                        КАК СпособРасчета,
				|		ВЫБОР	КОГДА НоменклатураХарактеристикаТипЦены.Рассчитывается
				|				ТОГДА	ВЫБОР	КОГДА ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.ПроцентСкидкиНаценки, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.ПроцентСкидкиНаценки) ЕСТЬ NULL
				|				                ТОГДА ТипЦенНоменклаутры.ПроцентСкидкиНаценки
				|				                ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.ПроцентСкидкиНаценки, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.ПроцентСкидкиНаценки)
				|				        КОНЕЦ
				|				ИНАЧЕ NULL
				|		КОНЕЦ                                                        КАК ПроцентСкидкиНаценки,
				|		ВЫБОР	КОГДА НоменклатураХарактеристикаТипЦены.Рассчитывается
				|				ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.Валюта, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.Валюта), ТипЦенНоменклаутры.ВалютаЦены)
				|				ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Валюта, ЦеныНоменклатурыПустаяХарактеристика.Валюта)
				|		КОНЕЦ                                                        КАК Валюта,
				|		КурсВалютДинамическийТип.Валюта                              КАК ВалютаДинамическийТип,
				|		ЕСТЬNULL(ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения, ЦеныНоменклатурыПустаяХарактеристика.ЕдиницаИзмерения), НоменклатураХарактеристикаТипЦены.ЕдиницаХраненияОстатков) КАК ЕдиницаИзмерения,
				|		НоменклатураХарактеристикаТипЦены.ТипЦен                     КАК ТипЦен,
				|		НоменклатураХарактеристикаТипЦены.ТипЦенБазовыйДинамический  КАК ТипЦенБазовыйДинамический,
				|		НоменклатураХарактеристикаТипЦены.Рассчитывается             КАК Рассчитывается
				|	ИЗ
				|	(
				|		ВЫБРАТЬ
				|			НоменклатураХарактеристикаТипЦены.Номенклатура               КАК Номенклатура,
				|			НоменклатураХарактеристикаТипЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|			НоменклатураХарактеристикаТипЦены.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
				|			НоменклатураХарактеристикаТипЦены.Качество                   КАК Качество,
				|			НоменклатураХарактеристикаТипЦены.ЕдиницаХраненияОстатков    КАК ЕдиницаХраненияОстатков,
				|			ВЫБОР	КОГДА СпрТипЦены.Рассчитывается
				|					ТОГДА СпрТипЦены.БазовыйТипЦен
				|					ИНАЧЕ СпрТипЦены.Ссылка
				|			КОНЕЦ                                                        КАК ТипЦен,
				|			СпрТипЦены.Ссылка                                            КАК ТипЦенБазовыйДинамический,
				|			СпрТипЦены.Рассчитывается                                    КАК Рассчитывается
				|		ИЗ
				|		(
				|			ВЫБРАТЬ НоменклатураХарактеристика.Номенклатура                        КАК Номенклатура,
				|					НоменклатураХарактеристика.ХарактеристикаНоменклатуры          КАК ХарактеристикаНоменклатуры,
				|					НоменклатураХарактеристика.ХарактеристикаНаименование          КАК ХарактеристикаНаименование,
				|					НоменклатураХарактеристика.Качество                            КАК Качество,
				|					НоменклатураХарактеристика.ТипЦен                              КАК Тип,
				|					СпрНомеклатура.ЕдиницаХраненияОстатков                         КАК ЕдиницаХраненияОстатков,
				|					ЕСТЬNULL(ТипИЗГрупп.ТипЦен, НоменклатураХарактеристика.ТипЦен) КАК ТипЦен
				|			ИЗ
				//
				|				НоменклатураСХарактеристикой КАК НоменклатураХарактеристика
				//
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				|				Справочник.Номенклатура КАК СпрНомеклатура
				|			ПО
				|				СпрНомеклатура.Ссылка = НоменклатураХарактеристика.Номенклатура
				|			ЛЕВОЕ СОЕДИНЕНИЕ
				//
				|				ТипИЗГрупп КАК ТипИЗГрупп
				//
				|			ПО
				|				ТипИЗГрупп.НоменклатурнаяЦеноваяГруппа = СпрНомеклатура.НоменклатурнаяГруппа
				|				ИЛИ ТипИЗГрупп.НоменклатурнаяЦеноваяГруппа = СпрНомеклатура.ЦеноваяГруппа
				|		) КАК НоменклатураХарактеристикаТипЦены
				|		ЛЕВОЕ СОЕДИНЕНИЕ
				|			Справочник.ТипыЦенНоменклатуры КАК СпрТипЦены
				|		ПО
				|			СпрТипЦены.Ссылка = НоменклатураХарактеристикаТипЦены.ТипЦен
				|	) КАК НоменклатураХарактеристикаТипЦены
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|		РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, Номенклатура = &Номенклатура) КАК ЦеныНоменклатуры
				|	ПО
				|		ЦеныНоменклатуры.Номенклатура = НоменклатураХарактеристикаТипЦены.Номенклатура
				|		И ЦеныНоменклатуры.ХарактеристикаНоменклатуры = НоменклатураХарактеристикаТипЦены.ХарактеристикаНоменклатуры
				|		И ЦеныНоменклатуры.ТипЦен = НоменклатураХарактеристикаТипЦены.ТипЦен
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|		РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыПустаяХарактеристика
				|	ПО
				|		ЦеныНоменклатурыПустаяХарактеристика.Номенклатура = НоменклатураХарактеристикаТипЦены.Номенклатура
				|		И ЦеныНоменклатурыПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|		И ЦеныНоменклатурыПустаяХарактеристика.ТипЦен = НоменклатураХарактеристикаТипЦены.ТипЦен
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|		РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыДинамическийТип
				|	ПО
				|		ЦеныНоменклатурыДинамическийТип.Номенклатура = НоменклатураХарактеристикаТипЦены.Номенклатура
				|		И ЦеныНоменклатурыДинамическийТип.ХарактеристикаНоменклатуры = НоменклатураХарактеристикаТипЦены.ХарактеристикаНоменклатуры
				|		И ЦеныНоменклатурыДинамическийТип.ТипЦен = НоменклатураХарактеристикаТипЦены.ТипЦенБазовыйДинамический
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|		РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип
				|	ПО
				|		ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.Номенклатура = НоменклатураХарактеристикаТипЦены.Номенклатура
				|		И ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|		И ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.ТипЦен = НоменклатураХарактеристикаТипЦены.ТипЦенБазовыйДинамический
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|		РегистрСведений.КурсыВалют.СрезПоследних(&ДатаРегистраСведений) КАК КурсВалют
				|	ПО
				|		КурсВалют.Валюта = ЕСТЬNULL(ЦеныНоменклатуры.Валюта, ЦеныНоменклатурыПустаяХарактеристика.Валюта)
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|		Справочник.ТипыЦенНоменклатуры КАК ТипЦенНоменклаутры
				|	ПО 
				|		ТипЦенНоменклаутры.Ссылка = НоменклатураХарактеристикаТипЦены.ТипЦенБазовыйДинамический
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|		РегистрСведений.КурсыВалют.СрезПоследних(&ДатаРегистраСведений) КАК КурсВалютДинамическийТип
				|	ПО
				|		КурсВалютДинамическийТип.Валюта =	ВЫБОР	КОГДА НоменклатураХарактеристикаТипЦены.Рассчитывается И ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.Валюта, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.Валюта) ЕСТЬ NULL
				|													ТОГДА ТипЦенНоменклаутры.ВалютаЦены
				|													ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыДинамическийТип.Валюта, ЦеныНоменклатурыПустаяХарактеристикаДинамическийТип.Валюта)
				|											КОНЕЦ
				|) КАК ЦеныНаБазовыйТип
				|//Динамический тип цен
				|ЛЕВОЕ СОЕДИНЕНИЕ
				//
				|	ЦенаПоДиапазону КАК ЦенаПоДиапазону
				//
				|ПО
				|	ЦенаПоДиапазону.БазовыйТипЦен = ЦеныНаБазовыйТип.ТипЦен
				|	И ЦенаПоДиапазону.Номенклатура = ЦеныНаБазовыйТип.Номенклатура
				|	И ЦенаПоДиапазону.ХарактеристикаНоменклатуры = ЦеныНаБазовыйТип.ХарактеристикаНоменклатуры
				|//Цены по договорам самый высокий приоритет
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
				|ПО
				|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = ЦеныНаБазовыйТип.Номенклатура
				|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = ЦеныНаБазовыйТип.ХарактеристикаНоменклатуры
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика
				|ПО
				|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Номенклатура = ЦеныНаБазовыйТип.Номенклатура
				|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.НаценкиПоУсловиямПродаж.СрезПоследних(&ДатаРегистраСведений, УсловиеПродаж = &УсловиеПродаж) КАК УсловияПродаж
				|ПО
				|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = ЦеныНаБазовыйТип.Номенклатура.ЦеноваяГруппа
				|	ИЛИ
				|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = ЦеныНаБазовыйТип.Номенклатура.НоменклатурнаяГруппа
				|" + ?(ПодборПоСправочнику И ПоказыватьОстатки, " ИНДЕКСИРОВАТЬ ПО ЦеныНаБазовыйТип.ХарактеристикаНоменклатуры", " УПОРЯДОЧИТЬ ПО ЦеныНаБазовыйТип.ХарактеристикаНаименование") + "
				|";

				Запрос.Текст = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|		ТипИЗГрупп.НоменклатурнаяЦеноваяГруппа КАК НоменклатурнаяЦеноваяГруппа,
				|		ТипИЗГрупп.ТипЦен                      КАК ТипЦен
				|ПОМЕСТИТЬ ТипИЗГрупп
				|ИЗ
				|	РегистрСведений.ТипыЦенПоГруппамНоменклатурыДляПокупателей.СрезПоследних(&ДатаРегистраСведений, Контрагент = &Контрагент) КАК ТипИЗГрупп
				|ГДЕ
				|	НЕ ТипИЗГрупп.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка)
				|ИНДЕКСИРОВАТЬ ПО НоменклатурнаяЦеноваяГруппа
				|";
				Запрос.Выполнить();

				Запрос.Текст = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|		ТипЦен           КАК ТипЦен,
				|		МАКСИМУМ(Период) КАК Период
				|ПОМЕСТИТЬ Диапазон2
				|ИЗ
				|	РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних(&ДатаРегистраСведений, ) КАК Диапазон
				|СГРУППИРОВАТЬ ПО Диапазон.ТипЦен
				|ИНДЕКСИРОВАТЬ ПО ТипЦен, Период
				|";
				Запрос.Выполнить();

				Запрос.Текст = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|		Диапазон.Валюта         КАК Валюта,
				|		ТипыЦен.БазовыйТипЦен   КАК ТипЦен,
				|		Диапазон.Цена           КАК Цена,
				|		Диапазон.ВерхняяГраница КАК ВерхняяГраница
				|ПОМЕСТИТЬ ЦенаПоДиапазонуВерхняяГраница
				|ИЗ
				|	РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних(&ДатаРегистраСведений,) КАК Диапазон
				|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				//
				|	Диапазон2 КАК Диапазон2
				//
				|ПО
				|	Диапазон2.ТипЦен = Диапазон.ТипЦен
				|	И Диапазон2.Период = Диапазон.Период
				|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦен
				|ПО
				|	ТипыЦен.Ссылка = Диапазон.ТипЦен
				|ИНДЕКСИРОВАТЬ ПО ТипЦен, ВерхняяГраница
				|";
				Запрос.Выполнить();

				Запрос.Текст = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|		Диапазон.Валюта         КАК Валюта,
				|		ТипыЦен.БазовыйТипЦен   КАК ТипЦен,
				|		Диапазон.Цена           КАК Цена,
				|		Диапазон.ВерхняяГраница КАК ВерхняяГраница
				|ПОМЕСТИТЬ ЦенаПоДиапазонуЦена
				|ИЗ
				|	РегистрСведений.ДиапазоныЦенДляНаценки.СрезПоследних(&ДатаРегистраСведений,) КАК Диапазон 
				|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦен
				|ПО
				|	ТипыЦен.Ссылка = Диапазон.ТипЦен
				|ИНДЕКСИРОВАТЬ ПО ТипЦен, ВерхняяГраница
				|";
				Запрос.Выполнить();

				Запрос.Текст = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЦеныБазовые.Номенклатура               КАК Номенклатура,
				|	ЦеныБазовые.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	ЦеныБазовые.ТипЦен                     КАК ТипЦен,
				|	ЦеныБазовые.Цена                       КАК Цена,
				|	ЦеныБазовые.Валюта                     КАК Валюта,
				|	ЦеныБазовые.ЕдиницаИзмерения           КАК ЕдиницаИзмерения
				|ПОМЕСТИТЬ ЦеныБазовые
				|ИЗ
				|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаРегистраСведений, Номенклатура = &Номенклатура И НЕ ТипЦен.Рассчитывается) КАК ЦеныБазовые
				|ИНДЕКСИРОВАТЬ ПО Номенклатура, ХарактеристикаНоменклатуры
				|";
				Запрос.Выполнить();

				Запрос.Текст = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДинамическийТипЦен.Номенклатура               КАК Номенклатура,
				|	ДинамическийТипЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	ДинамическийТипЦен.ДинамическийТип            КАК БазовыйТипЦен,
				|	ДинамическийТипЦен.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
				|	ЕСТЬNULL(ЦенаПоДиапазонуЦена.Цена, 0.00)      КАК Цена,
				|	ЦенаПоДиапазонуЦена.Валюта                    КАК Валюта
				|ПОМЕСТИТЬ ЦенаПоДиапазону
				|ИЗ
				|(
				|	ВЫБРАТЬ ЦенаДляРасчетаДиапазона.Номенклатура                  КАК Номенклатура,
				|			ЦенаДляРасчетаДиапазона.ХарактеристикаНоменклатуры    КАК ХарактеристикаНоменклатуры,
				|			ЦенаДляРасчетаДиапазона.ДинамическийТип               КАК ДинамическийТип,
				|			МИНИМУМ(ЦенаПоДиапазонуВерхняяГраница.Валюта)         КАК Валюта,
				|			МИНИМУМ(ЦенаДляРасчетаДиапазона.ЕдиницаИзмерения)     КАК ЕдиницаИзмерения,
				|			МИНИМУМ(ЦенаПоДиапазонуВерхняяГраница.ВерхняяГраница) КАК Цена
				|	ИЗ
				|	(
				|		ВЫБРАТЬ
				|				НомеклатураХарактеристикаТип.Номенклатура                                                КАК Номенклатура,
				|				НомеклатураХарактеристикаТип.ХарактеристикаНоменклатуры                                  КАК ХарактеристикаНоменклатуры,
				|				ЕСТЬNULL(ЕСТЬNULL(ЦеныБазовые.Цена, ЦеныБазовыеПустаяХарактеристика.Цена), 0.00)         КАК Цена,
				|				ЕСТЬNULL(ЦеныБазовые.ТипЦен, ЦеныБазовыеПустаяХарактеристика.ТипЦен)                     КАК ДинамическийТип,
				|				ЕСТЬNULL(ЦеныБазовые.ЕдиницаИзмерения, ЦеныБазовыеПустаяХарактеристика.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
				|		ИЗ
				//
				|			НоменклатураСХарактеристикой КАК НомеклатураХарактеристикаТип
				//
				|		ЛЕВОЕ СОЕДИНЕНИЕ
				//
				|			ЦеныБазовые КАК ЦеныБазовые
				//
				|		ПО
				|			ЦеныБазовые.Номенклатура = НомеклатураХарактеристикаТип.Номенклатура
				|			И ЦеныБазовые.ХарактеристикаНоменклатуры = НомеклатураХарактеристикаТип.ХарактеристикаНоменклатуры
				|		ЛЕВОЕ СОЕДИНЕНИЕ
				|			ЦеныБазовые КАК ЦеныБазовыеПустаяХарактеристика
				|		ПО
				|			ЦеныБазовыеПустаяХарактеристика.Номенклатура = НомеклатураХарактеристикаТип.Номенклатура
				|			И ЦеныБазовыеПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|		ГДЕ
				|			НЕ ЕСТЬNULL(ЦеныБазовые.ТипЦен, ЦеныБазовыеПустаяХарактеристика.ТипЦен) ЕСТЬ NULL
				|) КАК ЦенаДляРасчетаДиапазона
				|ЛЕВОЕ СОЕДИНЕНИЕ
				//
				|		ЦенаПоДиапазонуВерхняяГраница КАК ЦенаПоДиапазонуВерхняяГраница
				//
				|ПО
				|	ЦенаПоДиапазонуВерхняяГраница.ТипЦен = ЦенаДляРасчетаДиапазона.ДинамическийТип
				|	И ЦенаПоДиапазонуВерхняяГраница.ВерхняяГраница > ЦенаДляРасчетаДиапазона.Цена
				|ГДЕ
				|	НЕ ЦенаПоДиапазонуВерхняяГраница.ВерхняяГраница ЕСТЬ NULL
				|	СГРУППИРОВАТЬ ПО
				|		ЦенаДляРасчетаДиапазона.ДинамическийТип,
				|		ЦенаДляРасчетаДиапазона.ХарактеристикаНоменклатуры,
				|		ЦенаДляРасчетаДиапазона.Номенклатура
				|) КАК ДинамическийТипЦен
				|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				//
				|		ЦенаПоДиапазонуЦена КАК ЦенаПоДиапазонуЦена
				//
				|ПО
				|	ЦенаПоДиапазонуЦена.ТипЦен = ДинамическийТипЦен.ДинамическийТип
				|	И ЦенаПоДиапазонуЦена.ВерхняяГраница = ДинамическийТипЦен.Цена
				|ИНДЕКСИРОВАТЬ ПО БазовыйТипЦен, Номенклатура, ХарактеристикаНоменклатуры
				|";
				Запрос.Выполнить();
			ИначеЕсли ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
				ДоговорКонтрагента = ?(СтруктураИсходныхПараметров.Свойство("ДоговорКонтрагента"),СтруктураИсходныхПараметров.ДоговорКонтрагента, NULL);
				Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
				ТекстЗапроса = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Характеристики.ХарактеристикаНоменклатуры КАК Характеристика,
				|	Характеристики.Качество                   КАК Качество,
				|	ВЫБОР 	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
				|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСХарактеристикой.Цена, ЦеныБезХарактеристики.Цена), 0.00) * (1 + ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)/100)
				|			ИНАЧЕ ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена) * (1 + ЕСТЬNULL(УсловияПродаж.ПроцентНаценки, 0.00)/100)
				|	КОНЕЦ                                     КАК Цена,
				|	ВЫБОР 	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
				|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСХарактеристикой.Валюта, ЦеныБезХарактеристики.Валюта), &ВалютаЦены)
				|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ВалютаЦены, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ВалютаЦены), &ВалютаЦены)
				|	КОНЕЦ                                     КАК ВалютаЦены,
				|	ВЫБОР 	КОГДА ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Цена, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Цена), 0.00) = 0
				|			ТОГДА ЕСТЬNULL(ЕСТЬNULL(ЦеныСХарактеристикой.ЕдиницаИзмерения, ЦеныБезХарактеристики.ЕдиницаИзмерения), Характеристики.ЕдиницаХраненияОстатков)
				|			ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ЕдиницаИзмерения, УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ЕдиницаИзмерения), Характеристики.ЕдиницаХраненияОстатков)
				|	КОНЕЦ                                     КАК ЕдиницаИзмерения
				|" + ?(ПодборПоСправочнику И ПоказыватьОстатки, ", Характеристики.ХарактеристикаНаименование ПОМЕСТИТЬ Цены ", "") + "
				|ИЗ
				//
				|	НоменклатураСХарактеристикой КАК Характеристики
				//
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, Номенклатура = &Номенклатура И ТипЦен = &ТипЦен) КАК ЦеныБезХарактеристики
				|ПО
				|	ЦеныБезХарактеристики.Номенклатура = Характеристики.Номенклатура
				|	И ЦеныБезХарактеристики.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаРегистраСведений, Номенклатура = &Номенклатура И ТипЦен = &ТипЦен) КАК ЦеныСХарактеристикой
				|ПО
				|	ЦеныСХарактеристикой.Номенклатура = Характеристики.Номенклатура
				|	И ЦеныСХарактеристикой.ХарактеристикаНоменклатуры = Характеристики.ХарактеристикаНоменклатуры
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, Номенклатура = &Номенклатура И ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре
				|ПО 
				|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.Номенклатура = Характеристики.Номенклатура
				|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.ХарактеристикаНоменклатуры = Характеристики.ХарактеристикаНоменклатуры
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуре.СрезПоследних(&ДатаРегистраСведений, Номенклатура = &Номенклатура И ДоговорКонтрагента = &ДоговорКонтрагента) КАК УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика
				|ПО 
				|	УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.Номенклатура = Характеристики.Номенклатура
				|	И УсловияПоставокПоДоговорамКонтрагентовПоНоменклатуреПустаяХарактеристика.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.НаценкиПоУсловиямПродаж.СрезПоследних(&ДатаРегистраСведений, УсловиеПродаж = &УсловиеПродаж) КАК УсловияПродаж
				|ПО
				|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Характеристики.Номенклатура.ЦеноваяГруппа
				|	ИЛИ
				|	УсловияПродаж.НоменклатурнаяЦеноваяГруппа = Характеристики.Номенклатура.НоменклатурнаяГруппа
				|" + ?(ПодборПоСправочнику И ПоказыватьОстатки, " ИНДЕКСИРОВАТЬ ПО Характеристики.ХарактеристикаНоменклатуры", " УПОРЯДОЧИТЬ ПО Характеристики.ХарактеристикаНаименование") + "
				|";
			КонецЕсли;
		Иначе
			ТекстЗапроса = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Характеристики.Ссылка                           КАК Характеристика,
			|	ЗНАЧЕНИЕ(Справочник.Качество.Новый)             КАК Качество,
			|	0                                               КАК Цена,
			|	&ВалютаЦены                                     КАК ВалютаЦены,
			|	Характеристики.Владелец.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения
			|" + ?(ПодборПоСправочнику И ПоказыватьОстатки, ", Характеристики.ХарактеристикаНаименование ПОМЕСТИТЬ Цены ", "") + "
			|ИЗ
			|	(ВЫБРАТЬ
			|		Характеристики.Представление КАК ХарактеристикаНаименование,
			|		Характеристики.Ссылка   КАК Ссылка,
			|		Характеристики.Владелец КАК Владелец
			|	ИЗ
			|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
			|
			|	ГДЕ
			|		Характеристики.Ссылка.Владелец = &Номенклатура
			|
			|	ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		""""                    КАК Наименование,
			|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Ссылка,
			|		Номенклатура.Ссылка     КАК Владелец
			|	ИЗ
			|		Справочник.Номенклатура КАК Номенклатура
			|
			|	ГДЕ
			|		Номенклатура.Ссылка = &Номенклатура
			|	) КАК Характеристики
			|" + ?(ПодборПоСправочнику И ПоказыватьОстатки, " ИНДЕКСИРОВАТЬ ПО Характеристики.Ссылка", " УПОРЯДОЧИТЬ ПО Характеристики.ХарактеристикаНаименование") + "
			|";
		КонецЕсли;

		Форма.ТаблицаХарактеристикНоменклатуры.Очистить();
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ (ПодборПоСправочнику И ПоказыватьОстатки) Тогда
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(РезультатЗапроса.Выгрузить(), Форма.ТаблицаХарактеристикНоменклатуры);

			Если СтруктураИсходныхПараметров.Свойство("ТипЦен")
			   И СтруктураИсходныхПараметров.ТипЦен <> Неопределено
			   И ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда

				Для Каждого СтрокаТабличнойЧасти Из Форма.ТаблицаХарактеристикНоменклатуры Цикл

					СтрокаТабличнойЧасти.Цена = Ценообразование.ОкруглитьЦену(СтрокаТабличнойЧасти.Цена , ТипЦен.ПорядокОкругления, ТипЦен.ОкруглятьВБольшуюСторону);

				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ПодборПоСправочнику И ПоказыватьОстатки Тогда

			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоОстатокОрганизации.ИзменениеРазмера  = ИзменениеРазмераКолонки.Изменять;
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоОстатокОрганизации.Доступность       = Ложь;
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоОстатокОрганизации.ИзменятьНастройку = ПоказыватьОстатки;
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоОстатокОрганизации.Видимость         = СтруктураПоказыватьОстатки["ПоказыватьКолонки"];

			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоСвободныйОстаток.ИзменениеРазмера    = ИзменениеРазмераКолонки.Изменять;
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоСвободныйОстаток.Доступность         = Ложь;
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоСвободныйОстаток.ИзменятьНастройку   = ПоказыватьОстатки;
			Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.Колонки.КоличествоСвободныйОстаток.Видимость           = СтруктураПоказыватьОстатки["ПоказыватьКолонки"];

			Форма.ЭлементыФормы.ПоказыватьОстатки.Видимость = ПоказыватьОстатки;
			Форма.ЭлементыФормы.ПоказыватьОстатки.Значение  = СтруктураПоказыватьОстатки["ПоказыватьКолонки"];

			ПараметрыЗапросаОстатки = Неопределено;
			СтруктураОстаткиПриВыбореНоменклатуры.Свойство("ТекстЗапроса"              ,Запрос.Текст);
			СтруктураОстаткиПриВыбореНоменклатуры.Свойство("СтруктураПараметровЗапроса",ПараметрыЗапросаОстатки);
			Для Каждого элементСтруктуры Из ПараметрыЗапросаОстатки Цикл
				Запрос.УстановитьПараметр(элементСтруктуры.Ключ,элементСтруктуры.Значение);
			КонецЦикла;
			Запрос.УстановитьПараметр("МассивНоменклатуры", Форма.Номенклатура);
			ДобавитьВременнуюТаблицу(Запрос);
			Запрос.Выполнить();

			Запрос.Текст = "
			|ВЫБРАТЬ
			|	Цены.Характеристика                       КАК Характеристика,
			|	Цены.Цена                                 КАК Цена,
			|	Цены.ВалютаЦены                           КАК ВалютаЦены,
			|	Цены.ЕдиницаИзмерения                     КАК ЕдиницаИзмерения,
			|	ЕСТЬNULL(Остатки.Качество, Цены.Качество) КАК Качество,
			|	Остатки.КоличествоСвободныйОстаток        КАК КоличествоСвободныйОстаток,
			|	Остатки.КоличествоОстатокОрганизации      КАК КоличествоОстатокОрганизации
			|ИЗ
			|	Цены КАК Цены
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	Остатки КАК Остатки
			|ПО
			|	Остатки.ХарактеристикаНоменклатуры = Цены.Характеристика
			|	УПОРЯДОЧИТЬ ПО
			|		Цены.ХарактеристикаНаименование
			|";

			ТаблицаХарактеристикНоменклатуры = Запрос.Выполнить().Выгрузить();
			Форма.ТаблицаХарактеристикНоменклатуры.Очистить();
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаХарактеристикНоменклатуры, Форма.ТаблицаХарактеристикНоменклатуры);
			Если СтруктураИсходныхПараметров.Свойство("ТипЦен")
				И СтруктураИсходныхПараметров.ТипЦен <> Неопределено
				И ТипЗнч(СтруктураИсходныхПараметров.ТипЦен) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
				Для Каждого СтрокаТабличнойЧасти Из Форма.ТаблицаХарактеристикНоменклатуры Цикл
					СтрокаТабличнойЧасти.Цена = Ценообразование.ОкруглитьЦену(СтрокаТабличнойЧасти.Цена , ТипЦен.ПорядокОкругления, ТипЦен.ОкруглятьВБольшуюСторону);
				КонецЦикла;
			КонецЕсли;
	КонецЕсли;

	// Заменим пустые характеристики на строку "<без характеристики>"
	СтрокаПустойХарактеристики = Форма.ТаблицаХарактеристикНоменклатуры.Найти(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), "Характеристика");
	Пока СтрокаПустойХарактеристики <> Неопределено Цикл
		СтрокаПустойХарактеристики.Характеристика = "<без характеристики>";
		СтрокаПустойХарактеристики = Форма.ТаблицаХарактеристикНоменклатуры.Найти(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), "Характеристика");
	КонецЦикла;
КонецПроцедуры // мКоманднаяПанельТаблицыХарактеристикНоменклатурыЗаполнить()

// Процедура - обработчик события "Нажатие" кнопки "ПолучитьВес".
//
Процедура мКоманднаяПанельДействийСлеваПолучитьВес(Форма, Кнопка) Экспорт

	ВесТовара = 0;
	
	Ответ = ПолучитьСерверТО().ПолучитьВесЭВ(Форма.ЭлементыФормы.ТекущиеВесы.Значение, ВесТовара);
	Если Не ЗначениеЗаполнено(Ответ) Тогда
		Если Форма.ЭлементыФормы.Найти("ТаблицаХарактеристикНоменклатуры") = Неопределено Тогда
			Форма.Количество = ВесТовара;
		Иначе
			СтрокаТабличнойЧасти = Форма.ЭлементыФормы.ТаблицаХарактеристикНоменклатуры.ТекущаяСтрока;
			Если СтрокаТабличнойЧасти <> Неопределено Тогда
				СтрокаТабличнойЧасти.Количество = ВесТовара;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Предупреждение(ПолучитьСерверТО().ПолучитьТекстОшибкиЭВТО(Ответ), 5,"Ошибка ТО");
	КонецЕсли;
	

КонецПроцедуры // мКоманднаяПанельДействийСлеваПолучитьВес()

мИмяРегистраДляПодбораСерий    = "";
мИспользоватьХарактеристики    = глЗначениеПеременной("ИспользоватьХарактеристикиНоменклатуры");
мИспользоватьСерии             = глЗначениеПеременной("ИспользоватьСерииНоменклатуры");

#КонецЕсли