
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр амбСрокиИСерии Расход
	Движения.амбСрокиИСерии.Записывать = Истина;
	Движения.амбСрокиИСерии.Очистить();
	Для Каждого ТекСтрокаСписываем Из Списываем Цикл
		Движение = Движения.амбСрокиИСерии.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Номенклатура;
		Движение.СерияНоменклатуры = ТекСтрокаСписываем.СерияНоменклатуры;
		Движение.СрокГодности = ТекСтрокаСписываем.СрокГодности;
		Движение.Количество = ТекСтрокаСписываем.Количество;
		СкладДляРегистра = ?(Склад.амбИспользоватьОбособленныйУчетСроковГодности, Склад, Справочники.Склады.ПустаяСсылка());
        Движение.Склад = СкладДляРегистра;
	КонецЦикла;

	// регистр амбСрокиИСерии Приход
	
		Для Каждого ТекСтрокаПриходуем Из Приходуем Цикл
		Движение = Движения.амбСрокиИСерии.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = Номенклатура;
		Движение.СерияНоменклатуры = ТекСтрокаПриходуем.СерияНоменклатуры;
		Движение.СрокГодности = ТекСтрокаПриходуем.СрокГодности;
		Движение.Количество = ТекСтрокаПриходуем.Количество;
		СкладДляРегистра = ?(Склад.амбИспользоватьОбособленныйУчетСроковГодности, Склад, Справочники.Склады.ПустаяСсылка());
		Движение.Склад = СкладДляРегистра;
	КонецЦикла;


КонецПроцедуры
