
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЭтоБазовая = ОбновлениеКонфигурации.ЭтоБазоваяВерсияКонфигурации();
	Если НЕ ЭтоБазовая Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ОписаниеУТ11";
		Параметры.Вставить("ОписаниеУТ11",Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаТекущейВерсииПлатформы() Экспорт

	РекомендуемаяВерсияПлатформы = "8.3.5.1482";
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, РекомендуемаяВерсияПлатформы) >= 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

