
// ОБРАБОТЧИКИ ОБНОВЛЕНИЯ

// Обработчик обновления
//
// Устанавливает новый код вида операции в документе "Формирование записей книги покупок"
Процедура УстановитьКодВидаОперации() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураПолученныйДокументыОснования.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_СводныеКомиссионныеСФ
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|ГДЕ
	|	СчетФактураПолученныйДокументыОснования.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И СчетФактураПолученныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|	И СчетФактураПолученныйДокументыОснования.Ссылка.СводныйКомиссионный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.Ссылка КАК Ссылка,
	|	ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.НомерСтроки - 1 КАК ИндексСтроки,
	|	ВЫБОР
	|		КОГДА ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.КодВидаОперации <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КодЗаполнен,
	|	ВЫБОР
	|		КОГДА ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.Ссылка.ПредъявленНДСКВычету0
	|			ТОГДА ""25""
	|		КОГДА ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.СчетФактура ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|						ТОГДА ""16""
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.СчетФактура КАК Документ.ВозвратТоваровОтПокупателя).НомерРасходногоКассовогоОрдера <> """"
	|								ТОГДА ""17""
	|							ИНАЧЕ ""03""
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОГДА ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныеПлатежи)
	|			ТОГДА ""20""
	|		КОГДА ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|				И ВЫРАЗИТЬ(ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.СчетФактура КАК Документ.СчетФактураПолученный).БланкСтрогойОтчетности
	|			ТОГДА ""23""
	|		КОГДА НЕ ВТ_СводныеКомиссионныеСФ.ДокументОснование ЕСТЬ NULL 
	|			ТОГДА ""27""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаОперации
	|ИЗ
	|	Документ.ФормированиеЗаписейКнигиПокупок.ВычетПоПриобретеннымЦенностям КАК ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СводныеКомиссионныеСФ КАК ВТ_СводныеКомиссионныеСФ
	|		ПО ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.СчетФактура = ВТ_СводныеКомиссионныеСФ.ДокументОснование
	|ГДЕ
	|	ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.Ссылка.Дата >= ДАТАВРЕМЯ(2015, 1, 1)
	|	И ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.Ссылка,
	|	ВЫБОР
	|		КОГДА ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.КодВидаОперации <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.НомерСтроки - 1,
	|	ВЫБОР
	|		КОГДА ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.Ссылка.ПредъявленНДСКВычету0
	|			ТОГДА ""25""
	|		КОГДА ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Возврат)
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.СчетФактура ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|						ТОГДА ""16""
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВЫРАЗИТЬ(ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.СчетФактура КАК Документ.ВозвратТоваровОтПокупателя).НомерРасходногоКассовогоОрдера <> """"
	|								ТОГДА ""17""
	|							ИНАЧЕ ""03""
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОГДА ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныеПлатежи)
	|			ТОГДА ""20""
	|		КОГДА ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|				И ВЫРАЗИТЬ(ФормированиеЗаписейКнигиПокупокВычетПоПриобретеннымЦенностям.СчетФактура КАК Документ.СчетФактураПолученный).БланкСтрогойОтчетности
	|			ТОГДА ""23""
	|		КОГДА НЕ ВТ_СводныеКомиссионныеСФ.ДокументОснование ЕСТЬ NULL 
	|			ТОГДА ""27""
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИТОГИ
	|	СУММА(КодЗаполнен)
	|ПО
	|	ОБЩИЕ,
	|	Ссылка";
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаИтоги.Следующий()
		И ВыборкаИтоги.КодЗаполнен = 0 Тогда
		ВыборкаДокументы = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДокументы.Следующий() Цикл
			ФормированиеЗаписейДокумент = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
			ВыборкаСтроки = ВыборкаДокументы.Выбрать();
			Пока ВыборкаСтроки.Следующий() Цикл
				ФормированиеЗаписейДокумент.ВычетПоПриобретеннымЦенностям[ВыборкаСтроки.ИндексСтроки].КодВидаОперации = ВыборкаСтроки.КодВидаОперации;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ФормированиеЗаписейДокумент);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры
