// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка Тогда

		Если Не  ЗначениеЗаполнено(ТипНоменклатуры) Тогда
			ТекстСообщения = "Необходимо указать тип номенклатуры!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;

		СуществуютСсылки = Неопределено;
		Если НЕ ЭтоНовый() 
		   И ТипНоменклатуры <> Ссылка.ТипНоменклатуры 
		   И ПолныеПрава.ВидыНоменклатуры_СуществуютСсылкиВНоменклатуре(Ссылка, СуществуютСсылки) Тогда
			ТекстСообщения = "Вид номенклатуры """ + СокрЛП(Ссылка) + """ выбран в элементах справочника ""Номенклатура"".
			|Тип не может быть изменен!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
