
Процедура ОбработкаПроведения(Отказ, Режим)
	//Проверим наличие строк без заказа.
	Для Каждого строкаТЧ из Товары Цикл
		Если СТрокаТЧ.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка() тогда
			 Сообщить("Ошибка: В строке "+Формат(СтрокаТЧ.НомерСтроки,"ЧДЦ=0") +" не указан заказ покупателя", СтатусСообщения.Важное);
			 Отказ= Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	Если не отказ тогда
	//Провести может только пользователь с полными правами (устанавливается на уровне полных прав.
	//Отметим пользователя, который проводит документ	
	Если Не ЗначениеЗаполнено(Бухгалтер) тогда
		Бухгалтер = ПараметрыСеанса.ТекущийПользователь.Ссылка;
	КонецЕсли;	
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл   		
		//Оформим расход по резервам расписки
		Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Расписка.Заказ.складГруппа;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		Движение.ДокументРезерва = Расписка.Заказ;
		Движение.амбРасписка = истина;
		Движение.Количество = ТекСтрокаТовары.Количество;
		//Оформим перераспределение по расписке.
		Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = ТекСтрокаТовары.Заказ.складГруппа;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		Движение.ДокументРезерва = ТекСтрокаТовары.Заказ;
		Движение.амбРасписка = истина;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	КонецЕсли;
		//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры



  
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
 
 

 
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РезервированиеТоваров") Тогда
		// Заполнение шапки
		Комментарий = Основание.Комментарий;
		Контрагент = Основание.Контрагент;
		Расписка = Основание.Ссылка;
		Для Каждого ТекСтрокаТовары Из Основание.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.КоличествоВРасписке = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
