
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		КонтактПоЗаявке = ДанныеЗаполнения.КонтактПоЗаявке;
		ПодразделениеИсполнитель = ДанныеЗаполнения.ПодразделениеИсполнитель;
		ПодразделениеИсточник = ДанныеЗаполнения.ПодразделениеИсточник;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаОборудование Из ДанныеЗаполнения.Оборудование Цикл
			НоваяСтрока = Оборудование.Добавить();
			НоваяСтрока.Оборудование = ТекСтрокаОборудование.Оборудование;
			НоваяСтрока.Цель = ТекСтрокаОборудование.Цель;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриЗаписи(ПараметрыЗаписи)
	

	
	 
КонецПроцедуры

