////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура РазобратьФайлНаСервере();
	
	ОбъектXML = Новый ЧтениеXML;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	ВремФайл = ЭлектронныеДокументыСлужебный.ТекущееИмяВременногоФайла("xml");
	ДвоичныеДанные.Записать(ВремФайл);
	
	Попытка
		ОбъектXML.ОткрытьФайл(ВремФайл);
		ЭД = ФабрикаXDTO.ПрочитатьXML(ОбъектXML);
	Исключение
		ОбъектXML.Закрыть();
		ШаблонСообщения = НСтр("ru = 'Возникла ошибка при чтении данных из файла %1: %2 (подробности см. в Журнале регистрации).'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
			ВремФайл, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьИсключениеПоЭДНаСервере(НСтр("ru = 'Чтение ЭД.'"),
																					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
																					ТекстСообщения);
		Возврат;
	КонецПопытки;

	ОбъектXML.Закрыть();
	УдалитьФайлы(ВремФайл);

	Если НЕ ЭД.Тип() = ЭлектронныеДокументыВнутренний.ПолучитьТипЗначенияCML("Контрагент") Тогда
		Возврат;
	КонецЕсли;
	
	ДопустимыеТипы = "Страна, Регион, Район, Город, Улица, Дом, Корпус, Квартира";
	
	СвойствоЭД = ЭД.Свойства().Получить("РасчетныеСчета");
	Если СвойствоЭД <> Неопределено Тогда
		ЗнДанных = ЭД.Получить(СвойствоЭД);
		Если ЗнДанных <> Неопределено Тогда
			Для Каждого ТекСв Из ЗнДанных.РасчетныйСчет Цикл
				РасчетныйСчет         = ТекСв.НомерСчета;
				БИК                   = ТекСв.Банк.БИК;
				КорреспондентскийСчет = ТекСв.Банк.СчетКорреспондентский;
				Банк                  = ТекСв.Банк.Наименование;
				
				Если НЕ ТекСв.БанкКорреспондент=Неопределено Тогда
					БИКБанкаДляРасчетов                       = ТекСв.БанкКорреспондент.БИК;
					КоррСчетБанкаДляРасчетов                  = ТекСв.БанкКорреспондент.СчетКорреспондентский;
					ПредставлениеБанкаДляРасчетов             = ТекСв.БанкКорреспондент.Наименование;
					Элементы.ГруппаНепрямыхРасчетов.Видимость = Истина;
				КонецЕсли;
			КонецЦикла
		КонецЕсли;
	КонецЕсли;
	
	СвойствоЭД = ЭД.Свойства().Получить("ЮрЛицо");
	Если СвойствоЭД <> Неопределено Тогда
		
		ЗнДанных = ЭД.Получить(СвойствоЭД);
		Если ЗнДанных <> Неопределено Тогда
			СвойствоИНН = ЗнДанных.Свойства().Получить("ИНН");
			Если СвойствоИНН <> Неопределено Тогда
				ИНН = ЗнДанных.Получить(СвойствоИНН);
			КонецЕсли;
			СвойствоКПП = ЗнДанных.Свойства().Получить("КПП");
			Если СвойствоКПП <> Неопределено Тогда
				КПП = ЗнДанных.Получить(СвойствоКПП);
			КонецЕсли;
			СвойствоОКПО = ЗнДанных.Свойства().Получить("ОКПО");
			Если СвойствоОКПО <> Неопределено Тогда
				ОКПО = ЗнДанных.Получить(СвойствоОКПО);
			КонецЕсли;
			СвойствоОФНаим = ЗнДанных.Свойства().Получить("ОфициальноеНаименование");
			Если СвойствоОФНаим <> Неопределено Тогда
				Наименование = ЗнДанных.Получить(СвойствоОфНаим);
			КонецЕсли;
			
			СвойствоРуководитель = ЗнДанных.Свойства().Получить("Руководитель");
			Если СвойствоРуководитель <> Неопределено Тогда
				ЗнРуководитель = ЗнДанных.Получить(СвойствоРуководитель);
				Если ЗнРуководитель <> Неопределено Тогда
					СвойствоФизЛицо = ЗнРуководитель.Свойства().Получить("ФизЛицо");
					Если СвойствоФизЛицо <> Неопределено Тогда
						ЗнФизЛицо = ЗнРуководитель.Получить(СвойствоФизЛицо);
						Если ЗнФизЛицо <> Неопределено Тогда
							ДолжностьРуководителя = ЗнФизЛицо.Должность;
							Руководитель = ЗнФизЛицо.ПолноеНаименование;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			СвойствоЮрАдрес = ЗнДанных.Свойства().Получить("ЮридическийАдрес");
			Если СвойствоЮрАдрес <> Неопределено Тогда
				ЗнЮрАдрес = ЗнДанных.Получить(СвойствоЮрАдрес);
				Если ЗнЮрАдрес <> Неопределено Тогда
					ЮридическийАдрес = ЗнЮрАдрес.Представление;
					Для Каждого ТекСв Из ЗнЮрАдрес.АдресноеПоле Цикл
						Если ТекСв.Тип = "Почтовый индекс" Тогда
							ЗначенияПолейЮрАдрес = ЗначенияПолейФактАдрес + "Индекс" + "=" + ТекСв.Значение + Символы.ПС;
						ИначеЕсли	ТекСв.Тип = "Населенный пункт" Тогда
							ЗначенияПолейЮрАдрес = ЗначенияПолейФактАдрес + "НаселенныйПункт" + "=" + ТекСв.Значение + Символы.ПС;
						ИначеЕсли Найти(ДопустимыеТипы, ТекСв.Тип)>0 ТОгда
							ЗначенияПолейЮрАдрес = ЗначенияПолейФактАдрес + ТекСв.Тип + "=" + ТекСв.Значение + Символы.ПС;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли
			КонецЕсли;
			
		КонецЕсли
	КонецЕсли;
		
	СвойствоЭД = ЭД.Свойства().Получить("Контакты");
	Если СвойствоЭД <> Неопределено Тогда
		ЗнДанных =  ЭД.Получить(СвойствоЭД);
		Если ЗнДанных <> Неопределено Тогда
			Для Каждого ТекКонтакт Из ЭД.Контакты.Контакт Цикл
				Если ТекКонтакт.Тип = "Телефон рабочий" Тогда
					Телефон = ТекКонтакт.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	СвойствоЭД = ЭД.Свойства().Получить("Адрес");
	Если СвойствоЭД <> Неопределено Тогда
		ЗнДанных = ЭД.Получить(СвойствоЭД);
		Если ЗнДанных <> Неопределено Тогда
			ФактическийАдрес = ЗнДанных.Представление;
			Для Каждого ТекСв Из ЗнДанных.АдресноеПоле Цикл
				Если ТекСв.Тип = "Почтовый индекс" Тогда
					ЗначенияПолейФактАдрес = ЗначенияПолейФактАдрес + "Индекс" + "=" + ТекСв.Значение + Символы.ПС;
				ИначеЕсли ТекСв.Тип = "Населенный пункт" Тогда
					ЗначенияПолейФактАдрес = ЗначенияПолейФактАдрес + "НаселенныйПункт" + "=" + ТекСв.Значение + Символы.ПС;
				ИначеЕсли Найти(ДопустимыеТипы, ТекСв.Тип)>0 ТОгда
					ЗначенияПолейФактАдрес = ЗначенияПолейФактАдрес + ТекСв.Тип + "=" + ТекСв.Значение + Символы.ПС;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	ИНН_КПП = "" +  ИНН + "/" + КПП;

	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		ОпределитьКонтрагента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполненыОбязательныеРеквизиты()
	
	ОчиститьСообщения();
	РеквизитыЗаполнены = Истина;
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		РеквизитыЗаполнены = Ложь;
		ТекстСообщения = НСтр("ru = 'Не заполнено <Наименование>, загрузка не возможна.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ТекстСообщения = НСтр("ru = 'Проверьте правильность указания <Файла> с реквизитами контрагента.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат РеквизитыЗаполнены;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьФорму()
	
	Наименование = "";
	ИНН_КПП = "";
	ОКПО = "";
	ДолжностьРуководителя="";
	Руководитель="";
	ЮридическийАдрес="";
	ФактическийАдрес="";
	Телефон="";
	Банк="";
	РасчетныйСчет="";
	КорреспондентскийСчет="";
	БИК="";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыКонтрагента()
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("Контрагент",             Контрагент);
	СтруктураРеквизитов.Вставить("ИНН_КПП",                ИНН_КПП);
	СтруктураРеквизитов.Вставить("ОКПО",                   ОКПО);
	СтруктураРеквизитов.Вставить("Наименование",           Наименование);
	СтруктураРеквизитов.Вставить("ЮрАдресПредставление",   ЮридическийАдрес);
	СтруктураРеквизитов.Вставить("ЮрАдресЗначенияПолей",   ЗначенияПолейЮрАдрес);
	СтруктураРеквизитов.Вставить("ФактАдресПредставление", ФактическийАдрес);
	СтруктураРеквизитов.Вставить("ФактАдресЗначенияПолей", ЗначенияПолейФактАдрес);
	СтруктураРеквизитов.Вставить("Телефон",                Телефон);
	СтруктураРеквизитов.Вставить("БИК",                    БИК);
	СтруктураРеквизитов.Вставить("КорреспондентскийСчет",  КорреспондентскийСчет);
	СтруктураРеквизитов.Вставить("Банк",                   Банк);
	СтруктураРеквизитов.Вставить("РасчетныйСчет",          РасчетныйСчет);
	
	Контрагент = ЭлектронныеДокументыПереопределяемый.ЗаполнитьРеквизитыКонтрагента(СтруктураРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьКонтрагента()
	
	НазваниеСправочникаКонтрагенты = ЭлектронныеДокументыПовтИсп.ПолучитьИмяПрикладногоСправочника("Контрагенты");
	Если Не ЗначениеЗаполнено(НазваниеСправочникаКонтрагенты) Тогда
		НазваниеСправочникаКонтрагенты = "Контрагенты";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник."+НазваниеСправочникаКонтрагенты + " КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН";
	Запрос.УстановитьПараметр("ИНН", Сред(ИНН_КПП, 1, Найти(ИНН_КПП, "/") - 1));
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Контрагент = Результат.Ссылка;
	Иначе
		Контрагент = ЭлектронныеДокументыПовтИсп.ПолучитьПустуюСсылку("Контрагенты");
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ЗаполненыОбязательныеРеквизиты() Тогда
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Текст = Нстр("ru = 'Контрагент существует. Перезаполнить реквизиты?'");
			Ответ = Вопрос(Текст, Режим, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьРеквизитыКонтрагента();
		Если Не ОткрытаФормаЭлемента Тогда
			ОткрытьЗначение(Контрагент);
		Иначе
			Оповестить("ОбновитьСостояниеЭД");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	АдресВХранилище = Неопределено;
	
	Если ЭлектронныеДокументыСлужебныйКлиент.ВыбратьПоместитьФайлЭДВХранилище(АдресВХранилище, Файл, УникальныйИдентификатор) Тогда
		РазобратьФайлНаСервере();
	Иначе
		ОчиститьФорму();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = Параметры.Контрагент;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ОткрытаФормаЭлемента = Истина;
	КонецЕсли;
	
КонецПроцедуры
