
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем ПрошлыйПометкаНаУдаление;

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	ПрошлыйПометкаНаУдаление = Ссылка.ПометкаУдаления;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не ОбменДанными.Загрузка и Не ПрошлыйПометкаНаУдаление и ПометкаУдаления Тогда
		
		УниверсальныеМеханизмы.ПометитьНаУдалениеДополнительнуюИнформациюОбъекта(Ссылка, Отказ, "Ошибка при записи вопроса для анкетирования """ + СокрЛП(ЭтотОбъект) + """: ");
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ


