
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Запись ИЗ Параметры.Сертификаты Цикл
		НовСтр = СписокСертификатов.Добавить();
		НовСтр.Сертификат = Запись.Значение;
		НовСтр.Идентификатор = Запись.Представление;
	КонецЦикла
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <Список сертификатов>

&НаКлиенте
Процедура СписокСертификатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(Элементы.СписокСертификатов.ТекущиеДанные.Идентификатор);
	
КонецПроцедуры



