
Процедура ПередЗаписью(Отказ)
	Если НЕ ИспользоватьОтборПоОрганизациям Тогда
		Организации.Очистить();
	КонецЕсли;
	Если НЕ ИспользоватьОтборПоСкладам Тогда
		Склады.Очистить();
	КонецЕсли;
	Если НЕ ИспользоватьОтборПоПодразделениям Тогда
		Подразделения.Очистить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю) Тогда
		ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю = Перечисления.ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю.НеВыгружать;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВариантПереносаСебестоимостиСписанияВБухгалтериюПредприятия) Тогда
		ВариантПереносаСебестоимостиСписанияВБухгалтериюПредприятия = Перечисления.ВариантыПереносаСебестоимостиСписанияВБухгалтериюПредприятия.НеПереносить;
	КонецЕсли;
	РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
КонецПроцедуры