// Функция предназначенная для открытия внешней обработки, сохраненной в БД
 
//
 // Параметры
 
//  Обработка  - ссылка на элемент справочник ВнешниеОбработки
 //
 
// Возвращает объект внешнюю обработку/отчет, если не удалось открыть форму по умолчанию
Функция ОткрытьВнешнююОбработкуИзБД(ОбработкаСсылка, ВернутьСсылку = ЛОЖЬ)
    
    ЭтоОбработка = ?(ОбработкаСсылка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка, Истина, Ложь);
    ЭтоОтчет = ?(ОбработкаСсылка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет, Истина, Ложь);
    
    ИмяФайла = ПолучитьИмяВременногоФайла();
    ДвоичныеДанные = ОбработкаСсылка.ХранилищеВнешнейОбработки.Получить();
    ДвоичныеДанные.Записать(ИмяФайла);
    
	Если ЭтоОтчет Тогда
		Если ВернутьСсылку Тогда
			Возврат ВнешниеОтчеты.Создать(ИмяФайла);
		Иначе
        	Форма = ВнешниеОтчеты.ПолучитьФорму(ИмяФайла);
		КонецЕсли;
    Иначе
        Форма = ВнешниеОбработки.ПолучитьФорму(ИмяФайла);
    КонецЕсли;
    
    Если Не Форма = Неопределено Тогда
        Форма.Открыть();
    Иначе
        ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла);
        
        Возврат ВнешняяОбработка;
    КонецЕсли;
    
КонецФункции


Процедура ОткрытьОтчетПоНеЗакрытымРаспискам() Экспорт
	//МИША!!! Изменить	
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000012"); 
    Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
    ОткрытьВнешнююОбработкуИзБД(Ссылка);

КонецПроцедуры

Процедура ОткрытьОтчетПоСтоимостиТовараНаСкладах() Экспорт
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000014");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
    ОткрытьВнешнююОбработкуИзБД(Ссылка);
КонецПроцедуры

Процедура ОткрытьОтчетПоПросроченнойДебиторскойЗадолженности() Экспорт
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000015");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
    ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Функция ПолучитьОтчетПоПросроченнойДебиторскойЗадолженности() Экспорт
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000015");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
    Возврат ОткрытьВнешнююОбработкуИзБД(Ссылка,Истина);	
КонецФункции
             
Процедура ОткрытьОтчетПоПросроченнымТоварам() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000018");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьОбработкуЗакрытияКонтрактов() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000019");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры                                  

Процедура ОткрытьЗапчастиСтоимостьВНакладных() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000020");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьГрафикОплатыОтгрузки() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000021");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьОтчетПоКонтрактамБезДвиженияДваМесяца() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000022");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьНеПроставленыСвойстваВНоменклатуре() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000023");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьОтчетПоКонтрагентамСНепроставленнымиСвойствамиПринадлежности() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000024");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьОтчетПоПродажамВектораСоСвойствами() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000026");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьПоискДокументовПоНомеру() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000027");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры



// Шаблон!!!
//Процедура Открыть<Название отчета или обработки>() Экспорт 
//	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("<КодВнешнегоОтчета>");
//	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
// 
//	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
//КонецПроцедуры
