
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПрофильНастроекЭДО") Тогда
		ТекущаяЗапись = РегистрыСведений.СостоянияОбменовЭДЧерезОператоровЭДО.СоздатьМенеджерЗаписи();
		ТекущаяЗапись.ПрофильНастроекЭДО = Параметры.ПрофильНастроекЭДО;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияОбменовЭДЧерезОператоровЭДО.ДатаПолученияЭД,
		|	СостоянияОбменовЭДЧерезОператоровЭДО.ДатаПоследнегоПолученияПриглашений
		|ИЗ
		|	РегистрСведений.СостоянияОбменовЭДЧерезОператоровЭДО КАК СостоянияОбменовЭДЧерезОператоровЭДО
		|ГДЕ
		|	СостоянияОбменовЭДЧерезОператоровЭДО.ПрофильНастроекЭДО = &ПрофильНастроекЭДО";
		Запрос.УстановитьПараметр("ПрофильНастроекЭДО", Параметры.ПрофильНастроекЭДО);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущаяЗапись.ДатаПолученияЭД = Выборка.ДатаПолученияЭД;
			ТекущаяЗапись.ДатаПоследнегоПолученияПриглашений = Выборка.ДатаПоследнегоПолученияПриглашений;
		КонецЕсли;
		ЭтаФорма.ЗначениеВРеквизитФормы(ТекущаяЗапись, "Запись");
		
	КонецЕсли;
	
КонецПроцедуры