
Функция ЗагрузитьЭлементХМЛ(ОбъектXML, ИмяУзла, Параметры) Экспорт
	
	Перем СтрокаТовара;
	
	Параметры.Свойство("СтрокаТовара", СтрокаТовара);
	
	Если ИмяУзла = "Извещение" Тогда
		
		Обработан = Истина;
		
	ИначеЕсли ИмяУзла = "НомерИсходногоДокумента" Тогда
		
		ИсходныйДокумент = ЭлектронныеДокументы.ПолучитьСсылкуНаДокументПоДаннымИзXML(ОбъектXML, Неопределено, Параметры);
		
	ИначеЕсли ИмяУзла = "СтатусОбработкиДокумента" Тогда
		
		СтатусОбработки = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);		
		
	ИначеЕсли ИмяУзла = "СтатусОбработкиТовара" Тогда			
		
		СтрокаТовара = Товары.Добавить();
		Параметры.Вставить("СтрокаТовара", СтрокаТовара);
		
	ИначеЕсли   ИмяУзла = "ИдТовара" Тогда
		ЭлектронныеДокументы.ЗаполнитьНоменклатуруИХарактеристикуПоИдентификатору(СтрокаТовара, ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML), Параметры);
		
	ИначеЕсли ИмяУзла = "Примечание" Тогда
		
		СтрокаТовара.Примечание = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);			
	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СуществуетИсходящийДокумент(СсылкаНаОтветныйДокумент = Неопределено) Экспорт
  	
	Возврат Ложь;
	
КонецФункции // () 