#Если Клиент Тогда

Процедура ВывестиТитульныйЛист(Результат, Макет, ПредставлениеОрганизации)
	
	ОбластьОрганизация      = Макет.ПолучитьОбласть("ТитульныйЛист");
	
	ОбластьОрганизация.Параметры.НазваниеОрганизации = ПредставлениеОрганизации;
	ОбластьОрганизация.Параметры.ПредставлениеПериода = УправлениеОтчетами.ПолучитьПредставлениеПериода(НачалоПериода, КонецПериода, 0);
	
	Если ЗначениеЗаполнено(Склад) Тогда
		ОбластьОрганизация.Параметры.Подразделение = Склад;
	КонецЕсли;
		
	Результат.Вывести(ОбластьОрганизация);
	Результат.ВывестиГоризонтальныйРазделительСтраниц();
	
	Результат.Область("R1:R" + Результат.ВысотаТаблицы).Имя = "ТитульныйЛист";
	
КонецПроцедуры

Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	Макет = Отчеты.ЖурналУчетаРозничнойПродажиАлкогольнойПродукции.ПолучитьМакет("Макет");

	ТабличныйДокумент.Очистить();
	
	// Выведем заголовок
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, КонецПериода);
    ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
	
	// Выведем шапку
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
	Если ТитульныйЛист Тогда
		
		ВывестиТитульныйЛист(ТабличныйДокумент, Макет, ПредставлениеОрганизации);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");

	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ОрганизацияНаименование", ПредставлениеОрганизации);
	Запрос.УстановитьПараметр("ОрганизацияИНН",	СведенияОбОрганизации.ИНН);
	Запрос.УстановитьПараметр("Склад", 			Склад);
	Запрос.УстановитьПараметр("ДатаНач", 		НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаКон", 		Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	ИсключаемыеВидыДоговоров = Новый СписокЗначений;
	ИсключаемыеВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	Запрос.УстановитьПараметр("ИсключаемыеВидыДоговоров", ИсключаемыеВидыДоговоров);
	Текст =
		"ВЫБРАТЬ
		|	СведенияОбАлкогольнойПродукции.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
		|	СведенияОбАлкогольнойПродукции.КоэффПересчетаДал * 10 КАК Емкость,
		|	СведенияОбАлкогольнойПродукции.КоэффПересчетаДал КАК КоэффПересчетаДал,
		|	СведенияОбАлкогольнойПродукции.ВидПродукции.Наименование КАК ВидПродукции,
		|	СведенияОбАлкогольнойПродукции.ВидПродукции.КодВидаПродукции КАК КодВидаПродукции
		|ПОМЕСТИТЬ АлкогольнаяПродукция
		|ИЗ
		|	РегистрСведений.СведенияОбАлкогольнойПродукции КАК СведенияОбАлкогольнойПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидПродукцииПоступление,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.КодВидаПродукции
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КодВидаПоступление,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|				ТОГДА &ОрганизацияНаименование
		|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
		|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
		|				ТОГДА &ОрганизацияНаименование
		|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|				ТОГДА АвансовыйОтчетТовары.Поставщик.НаименованиеПолное
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.Регистратор.Контрагент.НаименованиеПолное
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК СТРОКА(1000)) КАК Поставщик,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|				ТОГДА &ОрганизацияИНН
		|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
		|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
		|				ТОГДА &ОрганизацияИНН
		|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|				ТОГДА АвансовыйОтчетТовары.Поставщик.ИНН
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.Регистратор.Контрагент.ИНН
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК СТРОКА(1000)) КАК ИНН,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА ВЫБОР
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента = """"
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Номер
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента = """"
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Номер
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
		|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|						ТОГДА АвансовыйОтчетТовары.НомерВходящегоДокумента
		|					ИНАЧЕ Обороты.Регистратор.Номер
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерТТН,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА ВЫБОР
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Дата
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Дата
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
		|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|						ТОГДА АвансовыйОтчетТовары.ДатаВходящегоДокумента
		|					ИНАЧЕ Обороты.Регистратор.Дата
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаТТН,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.Емкость
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ЕмкостьПоступление,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.КоличествоОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоПоступление,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.КоличествоОборот * АлкогольнаяПродукция.КоэффПересчетаДал
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемПоступление,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА Обороты.Регистратор
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДокументПоступление,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА Обороты.Регистратор
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДокументРасход,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И Обороты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА ""Проданная продукция""
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И (Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщикуИзНТТ
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
		|			ТОГДА ""Продукция, возвращенная поставщику""
		|		КОГДА Обороты.Регистратор ССЫЛКА Документ.СписаниеТоваров
		|			ТОГДА ""Недостачи продукции""
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|			ТОГДА ""Продукция, переданная в другое подразделение""
		|		КОГДА Обороты.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.РасходПоНакладной)
		|						ТОГДА ""Проданная продукция""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.Перемещение)
		|						ТОГДА ""Продукция, переданная в другое подразделение""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоставщику)
		|						ТОГДА ""Продукция, возвращенная поставщику""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоПриходномуОрдеру)
		|						ТОГДА ""Продукция, возвращенная поставщику""
		|				КОНЕЦ
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА ""Списанная продукция""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК СодержаниеРасход,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидПродукцииРасход,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА АлкогольнаяПродукция.Емкость
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ЕмкостьРасход,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот < 0
		|				ТОГДА -Обороты.КоличествоОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоРасход,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот < 0
		|				ТОГДА -Обороты.КоличествоОборот * АлкогольнаяПродукция.КоэффПересчетаДал
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемРасход
		|ИЗ
		|	АлкогольнаяПродукция КАК АлкогольнаяПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНач, &ДатаКон, Регистратор, &Условие) КАК Обороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
		|			ПО Обороты.Номенклатура = АвансовыйОтчетТовары.Номенклатура
		|				И (Обороты.Регистратор = АвансовыйОтчетТовары.Ссылка
		|					ИЛИ Обороты.Регистратор = АвансовыйОтчетТовары.Ссылка.СкладОрдер)
		|		ПО АлкогольнаяПродукция.Номенклатура = Обороты.Номенклатура
		|ГДЕ
		|	НЕ Обороты.Регистратор ССЫЛКА Документ.КорректировкаКачестваТоваров
		|	И НЕ Обороты.Регистратор ССЫЛКА Документ.КорректировкаСерийИХарактеристикТоваров
		|	И ВЫБОР
		|			КОГДА НЕ Обороты.Регистратор.ДоговорКонтрагента ЕСТЬ NULL 
		|				ТОГДА НЕ Обороты.Регистратор.ДоговорКонтрагента.ВидДоговора В (&ИсключаемыеВидыДоговоров)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.Период,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.КодВидаПродукции
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.Емкость
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА Обороты.Регистратор
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА Обороты.Регистратор
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА АлкогольнаяПродукция.Емкость
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|				ТОГДА &ОрганизацияНаименование
		|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
		|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
		|				ТОГДА &ОрганизацияНаименование
		|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|				ТОГДА АвансовыйОтчетТовары.Поставщик.НаименованиеПолное
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.Регистратор.Контрагент.НаименованиеПолное
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК СТРОКА(1000)),
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|				ТОГДА &ОрганизацияИНН
		|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
		|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
		|				ТОГДА &ОрганизацияИНН
		|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|				ТОГДА АвансовыйОтчетТовары.Поставщик.ИНН
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.Регистратор.Контрагент.ИНН
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК СТРОКА(1000)),
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА ВЫБОР
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента = """"
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Номер
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента = """"
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Номер
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
		|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|						ТОГДА АвансовыйОтчетТовары.НомерВходящегоДокумента
		|					ИНАЧЕ Обороты.Регистратор.Номер
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА ВЫБОР
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Дата
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Дата
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
		|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|						ТОГДА АвансовыйОтчетТовары.ДатаВходящегоДокумента
		|					ИНАЧЕ Обороты.Регистратор.Дата
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И Обороты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА ""Проданная продукция""
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И (Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщикуИзНТТ
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
		|			ТОГДА ""Продукция, возвращенная поставщику""
		|		КОГДА Обороты.Регистратор ССЫЛКА Документ.СписаниеТоваров
		|			ТОГДА ""Недостачи продукции""
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|			ТОГДА ""Продукция, переданная в другое подразделение""
		|		КОГДА Обороты.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.РасходПоНакладной)
		|						ТОГДА ""Проданная продукция""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.Перемещение)
		|						ТОГДА ""Продукция, переданная в другое подразделение""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоставщику)
		|						ТОГДА ""Продукция, возвращенная поставщику""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоПриходномуОрдеру)
		|						ТОГДА ""Продукция, возвращенная поставщику""
		|				КОНЕЦ
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА ""Списанная продукция""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Обороты.Период";
		
	СтрокаУсловия = "Комиссионер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	| Организация = &Организация";
	
	Если ЗначениеЗаполнено(Склад) Тогда
		СтрокаУсловия = СтрокаУсловия + " И Склад = &Склад";
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, "&Условие", СтрокаУсловия);
	Запрос.Текст = Текст;
	Результат = Запрос.Выполнить().Выбрать();
	
	НомерСтроки 			= 1;
	ОбъемПоступление		= 0;
	ОбъемРасход 			= 0;
	КоличествоПоступление	= 0;
	КоличествоРасход		= 0;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");

	Пока Результат.Следующий() Цикл
		
		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
		ОбластьМакета.Параметры.Заполнить(Результат);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбъемПоступление 		= ОбъемПоступление + Результат.ОбъемПоступление;
		ОбъемРасход 			= ОбъемРасход + Результат.ОбъемРасход;
		КоличествоПоступление 	= КоличествоПоступление + Результат.КоличествоПоступление;
		КоличествоРасход 		= КоличествоРасход + Результат.КоличествоРасход;

		НомерСтроки 			= НомерСтроки + 1;
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
	
	ОбластьМакета.Параметры.ОбъемПоступление 		= ОбъемПоступление;
	ОбластьМакета.Параметры.ОбъемРасход 			= ОбъемРасход;
	ОбластьМакета.Параметры.КоличествоПоступление 	= КоличествоПоступление;
	ОбластьМакета.Параметры.КоличествоРасход 		= КоличествоРасход;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТабличныйДокумент.ПовторятьПриПечатиСтроки = ТабличныйДокумент.Область("СтрокиДляПовтора");
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(
		ТабличныйДокумент, , Строка(глЗначениеПеременной("глТекущийПользователь")));
	
КонецПроцедуры

#КонецЕсли
