
Функция НайтиПоступлениеПоНомеруИДате(НомерРеализации, ДатаРеализации)
	
	ДатаНачалаПериода = НачалоГода(ДатаРеализации);
	ДатаКонцаПериода = КонецГода(ДатаРеализации);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПоступлениеТоваровУслуг.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.НомерВходящегоДокументаЭлектронногоОбмена = &НомерВходящегоДокументаЭлектронногоОбмена
	               |	И ПоступлениеТоваровУслуг.ДатаВходящегоДокументаЭлектронногоОбмена <= &ДатаКонцаПериода
	               |	И ПоступлениеТоваровУслуг.ДатаВходящегоДокументаЭлектронногоОбмена >= &ДатаНачалаПериода
	               |	И ПоступлениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ";
				   
	Запрос.УстановитьПараметр("НомерВходящегоДокументаЭлектронногоОбмена", НомерРеализации);
	Запрос.УстановитьПараметр("ДатаНачалаПериода", ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаКонцаПериода", ДатаКонцаПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

Функция ЗагрузитьЭлементХМЛ(ОбъектXML, ИмяУзла, Параметры) Экспорт
	
	Если ИмяУзла = "СчетФактура" Тогда
		
	ИначеЕсли ИмяУзла = "ДлительностьОжиданияОтвета" Тогда
		ДлительностьОжиданияОтвета = ЭлектронныеДокументы.ПолучитьДлительностьЭлемента(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "НомерСчетФактураПоставщик" Тогда
		НомерСчетаФактуры = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "ДатаСчетФактураПоставщик" Тогда
		ДатаСчетаФактуры = ЭлектронныеДокументы.ПолучитьДатуЭлемента(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "СтрокаСчетФактура" Тогда
					
	ИначеЕсли   ИмяУзла = "ИдТовара" Тогда
			
	ИначеЕсли   ИмяУзла = "НомерТоварнойНакладной" Тогда
		
		НомерТоварнойНакладной = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);
		Параметры.Вставить("НомерТоварнойНакладной", НомерТоварнойНакладной);
		
	ИначеЕсли   ИмяУзла = "ДатаТоварнойНакладной" Тогда
		
		ДатаТоварнойНакладной = ЭлектронныеДокументы.ПолучитьДатуЭлемента(ОбъектXML);
		
		// нужно искать поступление по номеру и дате реализации
		//НомерВходящегоДокументаЭлектронногоОбмена
		//ДатаВходящегоДокументаЭлектронногоОбмена
		
		Накладная = НайтиПоступлениеПоНомеруИДате(Параметры.НомерТоварнойНакладной, ДатаТоварнойНакладной);
		
		Если ЗначениеЗаполнено(Накладная) Тогда
			
			Если ДокументыОснования.Найти(Накладная, "ДокументОснование") = Неопределено Тогда 
				
				СтрокаТовара = ДокументыОснования.Добавить();
				Параметры.Вставить("СтрокаТовара",СтрокаТовара);
				
				СтрокаТовара.ДокументОснование = Накладная;	
				
			КонецЕсли;
		
		КонецЕсли;
	
	ИначеЕсли   ИмяУзла = "ОКЕИ" Тогда
			
	ИначеЕсли ИмяУзла = "Количество" Тогда
			
	ИначеЕсли ИмяУзла = "СуммаПоСтроке" Тогда
		
	ИначеЕсли ИмяУзла = "Сумма" Тогда		
	
	ИначеЕсли ИмяУзла = "Налог" Тогда
		
	ИначеЕсли ИмяУзла = "ТипНалога" Тогда		
				
	ИначеЕсли ИмяУзла = "ВеличинаСтавкиНалога" Тогда		
		
	ИначеЕсли ИмяУзла = "Сумма" Тогда
				
	ИначеЕсли ИмяУзла = "ВключеноВСтоимость" Тогда
						
	ИначеЕсли ИмяУзла = "Примечание" Тогда
					
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СуществуетИсходящийДокумент(СсылкаНаОтветныйДокумент = Неопределено) Экспорт
	
	СсылкаНаОтветныйДокумент = ЭлектронныеДокументы.НайтиПервыйОтветныйДокумент(Ссылка, "ИсходящийРеджектАкцептСчетаФактуры");
	
	Возврат ЗначениеЗаполнено(СсылкаНаОтветныйДокумент);
	
КонецФункции // ()
